[
  {
    "id": "T3-BucketD-001",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A soccer club introduces a new high-press coaching system mid-season. Analysts compare match outcomes after the change to outcomes before the change and conclude the new system improved performance because the team’s points-per-game increased. The coach notes that several starters also returned from injury around the same time, and the team’s fixture difficulty eased in the following month.",
    "claim": "Implementing the high-press system (X) caused the increase in points-per-game (Y).",
    "variables": {
      "X": "Adoption of a high-press coaching system (tactical intervention) starting from a specific matchweek",
      "Y": "Team performance measured by points-per-game (or win rate) in subsequent matches",
      "Z": "Time-varying team strength and context: player availability/fitness, opponent strength (fixture difficulty), and morale, which both influence the decision to adopt X and affect Y"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z(t) affects both the probability of adopting X at time t (coach changes tactics when injuries resolve, morale shifts, or fixtures soften) and the outcome Y(t+1). Past outcomes Y(t-1) also influence future Z(t) (morale/selection) and future X(t) (reactive tactical changes), creating treatment-confounder feedback over time.",
      "key_insight": "Because Z changes over time and is itself influenced by prior outcomes, a simple before/after or naive regression adjustment can attribute to X what is actually due to evolving squad health and schedule; identifying the causal effect requires methods that handle time-varying confounding (e.g., g-methods) and clear measurement of Z.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Y(t-1) (recent poor results) -> increases probability of X(t) (tactical overhaul). Meanwhile Z(t) (injury recoveries, fixture difficulty) -> affects both X(t) and Y(t+1). Also Y(t-1) -> Z(t) (morale, lineup choices) -> Y(t+1), creating a feedback loop between outcomes, confounders, and treatment over matchweeks.",
    "conditional_answers": "Ambiguous as stated. If, conditional on a sufficiently rich set of time-varying covariates Z (player availability, opponent strength, home/away, rest days, morale proxies) and appropriate longitudinal causal methods, the estimated effect of X remains positive and robust, then the claim becomes more credible. If the effect disappears after properly accounting for Z and pre-trends (e.g., improvement already underway due to returning starters and easier fixtures), then the claim is likely false.",
    "label": "Ambiguous",
    "correct_reasoning": "This is a Pearl L2 question because the claim is about the effect of intervening to set X (adopting the high-press system) on Y (points-per-game). However, the observed post-change improvement does not identify the causal effect do(X) because the intervention timing is not randomized and is entangled with time-varying confounding Z. Z(t) (injury recovery, fixture difficulty, morale/selection) causally affects Y(t+1) and also causally affects the coach’s decision to implement X(t). Additionally, prior outcomes Y(t-1) can influence both Z(t) (morale, lineup stability) and X(t) (reactive tactical changes), creating treatment–confounder feedback. In such settings, naive before/after comparisons or standard regression can produce biased estimates because they fail to block all backdoor paths from X to Y across time and may inappropriately condition on variables affected by prior Y. Without a design or model that measures Z over time and properly accounts for its evolution (e.g., marginal structural models, g-formula, or a credible quasi-experiment like an exogenous coaching change date unrelated to Z), we cannot determine whether do(X) would have increased Y. Therefore the causal conclusion is not justified from the described evidence, but it is not disproven either; the correct label is Ambiguous."
  },
  {
    "id": "T3-BucketD-002",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A soccer club wants to reduce hamstring injuries. The head coach proposes an intervention: cap each player’s weekly high-speed running (HSR) distance in training (measured by GPS) at a fixed threshold. After implementing the cap for 8 weeks, the club compares injury rates to the prior 8 weeks and observes fewer hamstring injuries. The coach concludes the cap caused the reduction.",
    "claim": "Imposing a weekly high-speed running cap in training reduces hamstring injuries.",
    "variables": {
      "X": "Intervention: enforce a weekly cap on each player’s high-speed running distance in training (GPS-based limit).",
      "Y": "Outcome: hamstring injury incidence over the following weeks (games + training).",
      "Z": "Confounder: concurrent reduction in match congestion (fewer matches per week) that lowers total sprint exposure and fatigue."
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Easy",
      "subdomain": "Sports",
      "causal_structure": "Z affects both X and Y over time: when match congestion drops (Z), coaches are more able/willing to enforce training HSR caps (X) and players have lower fatigue/total sprint load, reducing hamstring injuries (Y). A naive before-after comparison attributes Z-driven improvements to X.",
      "key_insight": "A before-after evaluation of an intervention is not causal when a time-varying factor shifts at the same time and influences both treatment assignment and the outcome.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: schedule congestion changes (Z). t1: staff implements/enforces HSR cap (X) partly because congestion is lower. t2: injury risk (Y) changes due to both altered total load/fatigue from Z and any true effect of X.",
    "conditional_answers": "If match congestion (Z) is held constant (e.g., by comparing to a matched period with identical match frequency or using teams/players with similar congestion), the estimated effect of the HSR cap on injuries could be isolated; without that, the observed reduction may be partly or wholly due to Z.",
    "label": "Yes",
    "correct_reasoning": "The claim is valid as a causal statement about an intervention (L2): it asserts that doing X would change Y. The causal trap is that the observed pre/post association is not, by itself, sufficient to justify the claim because a time-varying confounder Z (match congestion) changes around the same time and causally influences both the likelihood/intensity of enforcing X and the injury outcome Y. In a causal graph, Z -> X and Z -> Y creates an open backdoor path X <- Z -> Y, so the raw comparison mixes the effect of X with the effect of Z. However, the claim itself can still be true in the underlying data-generating process; the correct causal conclusion is that to support the claim one must estimate the effect of do(X) on Y by blocking the backdoor via controlling for Z (or using a design that holds Z fixed), rather than relying on the before-after injury decline."
  },
  {
    "id": "T3-BucketD-003",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A soccer club introduces a new high-press training block during mid-season. Coaches decide who fully participates based on recent match fitness and minor knock history. Analysts compare the next 6 matches and find that players who received the high-press block show higher total distance covered and more high-intensity sprints, but they also show a higher rate of soft-tissue injuries. The performance staff proposes scaling back the block, claiming the block causes injuries.",
    "claim": "Implementing the high-press training block (X) increases soft-tissue injury risk (Y), so reducing the block will reduce injuries.",
    "variables": {
      "X": "Assignment to (or dosage of) the high-press training block during the mid-season microcycle",
      "Y": "Soft-tissue injury occurrence over the subsequent 6-match window (e.g., hamstring/calf strain)",
      "Z": "Recent match fitness / latent fragility and load tolerance (including prior minor knocks), which influences both assignment to the block and injury risk"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z (time-varying fitness/fragility) affects X (training block dosage) and Y (injury). Past Y-like signals (minor knocks, soreness) update Z, which then changes future X; additionally, X changes future Z via adaptation/fatigue, which then affects Y.",
      "key_insight": "Because fitness/fragility evolves over time and is influenced by prior training and prior knock signals, naive comparisons of injury rates by training dosage can mix causal effects with time-varying confounding; the direction of bias is not identifiable without stronger design/assumptions.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: prior microcycles produce soreness/knock signals and current fitness (Z0). t1: coaches set high-press block dosage (X1) based on Z0. t2: X1 changes fatigue/adaptation (Z1). t3: injury occurs (Y) depending on Z1 and other shocks. Meanwhile, early symptoms before t3 can also feed back to future training decisions (X2) if the window is extended.",
    "conditional_answers": "Answer if the club randomized (or quasi-randomized) who receives the block conditional on baseline fitness/knock history: the causal effect of X on Y could be estimated, and the claim might become Yes or No depending on the estimated effect. Answer if assignment is purely coach-driven using evolving fitness/knock signals: the claim remains Ambiguous because observed injury differences could be due to Z rather than X.",
    "label": "Ambiguous",
    "correct_reasoning": "This is an L2 (interventional) question: it asks what would happen to Y under an intervention do(X=reduce high-press block). The observed association between X and Y is not sufficient because Z is a time-varying common cause of both X and Y. Coaches set X using current Z (match fitness, prior knocks, perceived robustness), and Z also directly affects injury propensity. Moreover, X changes future Z through fatigue/adaptation, so Z is simultaneously a confounder (for later X) and a mediator-like mechanism (from earlier X to Y). If we adjust for the wrong version of Z (e.g., post-X fatigue markers), we risk blocking part of the causal pathway (confounder–mediator entanglement); if we do not adjust for evolving Z, we leave backdoor paths open (unblocked backdoor). Without a design that breaks the dependence of X on Z over time (e.g., randomization, valid instrument, or a correctly specified longitudinal causal model such as a marginal structural model with appropriate weighting), the direction and magnitude of the causal effect of reducing X on Y are not identifiable from the described comparison. Therefore, the claim that reducing the block will reduce injuries is not validated nor refuted by the given evidence, making the correct label Ambiguous."
  },
  {
    "id": "T3-BucketD-004",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A soccer club pilots an AI-driven training plan that prescribes higher weekly high-speed running (HSR) volume for attackers. Coaches partially follow the plan: they increase HSR volume when the model flags a player as 'low injury risk' and hold back when it flags 'high risk'. The performance staff then runs an analysis to estimate the causal effect of increasing HSR volume on next-match sprint output, using observational training logs. They correctly decide to adjust for pre-week risk score and recent acute workload history, but they also (incorrectly) consider adjusting for 'midweek muscle soreness' measured two days after the HSR sessions. After consulting a causal diagram, they exclude soreness from adjustment, block the backdoor path via risk/fitness, and estimate that increasing HSR volume causally increases next-match sprint output for attackers.",
    "claim": "If the club intervenes to increase an attacker’s weekly HSR volume (X), their next-match sprint output (Y) will increase, provided we adjust for pre-week injury-risk/fitness indicators (Z) and do not adjust for post-session soreness.",
    "variables": {
      "X": "Intervention: Increase weekly high-speed running (HSR) training volume for an attacker during the week (e.g., +15% HSR meters vs the planned baseline).",
      "Y": "Outcome: Next-match sprint output (e.g., total sprint meters or number of sprints above a speed threshold).",
      "Z": "Time-varying confounding set: Pre-week injury-risk/fitness state summarized by the AI risk score and recent acute:chronic workload ratio (these influence both the coach’s decision to increase HSR and the player’s next-match sprint output)."
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "Z (pre-week risk/fitness and recent workload) affects both X (coach’s HSR increase decision) and Y (next-match sprint output). X affects midweek soreness (a post-treatment mediator) which also affects Y. Conditioning on soreness would induce a confounder–mediator error; correct identification uses adjustment for pre-treatment Z only, leaving mediators unadjusted.",
      "key_insight": "At L2 we need the effect of do(X). Because training assignment responds to evolving risk/fitness (time-varying confounding), we must block the backdoor through pre-treatment state Z. But we must not adjust for post-treatment variables like soreness that lie on the causal pathway from X to Y (or act as post-treatment colliders), or we would bias the estimated total causal effect.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t-14d to t0: recent acute/chronic workload and fitness form Z; t0: coaches choose whether to increase HSR (X) based on Z; t0 to t+2d: higher HSR increases soreness; t+3d to t+6d: recovery/training continuation; t+7d: match occurs and sprint output Y is realized.",
    "conditional_answers": "Answer if the analyst adjusts only for pre-week Z (risk score and recent workload) and avoids conditioning on post-session soreness: the claim is supported (Yes). If the analyst also conditions on midweek soreness (post-treatment), the estimated effect may be biased toward zero or even flip sign, so the claim would no longer be justified from that analysis.",
    "label": "Yes",
    "correct_reasoning": "We are asked about an interventional claim: the effect of do(X=Increase HSR) on Y (next-match sprint output). In the data-generating process, coaches do not assign X randomly; they choose X in response to the player’s evolving pre-week state Z (risk/fitness and recent workload). Z is a common cause of X and Y, creating an open backdoor path X <- Z -> Y. Therefore, without adjustment, the association between X and Y mixes the causal effect of X with selection effects driven by Z (time-varying confounding).\n\nHowever, Z is measured prior to the week’s HSR decision, so conditioning on Z blocks the backdoor path and yields exchangeability with respect to Z: within strata of Z, the remaining variation in X can be treated as-if randomized for identifying the total effect of do(X) on Y (assuming no additional unmeasured confounders and correct temporal ordering).\n\nCrucially, midweek muscle soreness occurs after X and is downstream of X on a causal path X -> soreness -> Y. Conditioning on soreness would remove part of the causal effect (blocking a mediator) and can also introduce post-treatment bias if soreness is influenced by other factors that also affect Y. Since the target estimand is the total causal effect of increasing HSR on sprint output, the correct adjustment set includes pre-treatment Z but excludes post-treatment soreness.\n\nGiven this causal structure, the claim is valid: intervening to increase weekly HSR volume will increase next-match sprint output, and the appropriate identification strategy is to adjust for pre-week Z (to block time-varying confounding) while not adjusting for post-treatment soreness."
  },
  {
    "id": "T3-BucketD-005",
    "pearl_level": "L3",
    "domain": "Sports",
    "scenario": "An NBA analytics staffer reviews a star guard who played through a minor ankle sprain. The team’s internal report notes that in games where the guard received a pregame painkiller injection, he finished with higher points per possession and the team won more often. The staffer then makes a counterfactual claim: 'If we had given him the injection in the games we didn’t, he would have performed just as well as in the injection games, without increasing reinjury risk, because the injection only changes pain and pain doesn’t change tissue healing.' The medical staff objects that the injection changes how he moves, how much he plays, and what the coach asks him to do, and that these downstream changes interact with the injury’s latent severity and the game context.",
    "claim": "Counterfactually, if the player had received the painkiller injection in the games he did not receive it, his performance (points per possession) would have increased to the level observed in injection games, while reinjury risk would have stayed the same, because the injection only affects pain and not the underlying ankle damage.",
    "variables": {
      "X": "Receiving a pregame painkiller injection (vs. not) for the ankle sprain",
      "Y": "Game performance (points per possession) and short-horizon reinjury occurrence in/after the game",
      "Z": "Latent ankle injury severity and game/usage context (coach minutes/role decisions, defensive attention, pace), which jointly influence both injection decision and outcomes"
    },
    "annotations": {
      "trap_type": "Confounder–Mediator Error",
      "trap_subtype": "Mediator Fixing Error",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "Z (latent severity + context) affects X (injection decision) and affects Y (performance and reinjury). X affects pain and perceived readiness, which affects minutes/role and movement patterns (mediators), which then affect Y. The claim implicitly holds the underlying damage/healing pathway fixed while changing X, ignoring that X changes mediators that are part of the causal pathway to both performance and reinjury.",
      "key_insight": "The counterfactual compares worlds while illegitimately 'freezing' mediators (movement, minutes, role) and even aspects of the injury trajectory; changing X changes the downstream behavior and exposure that determine both performance and reinjury, so you cannot assert 'same risk' or 'same underlying state' without specifying and modeling those mediator changes.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: Z (true sprain severity + opponent/context) realized. t1: Decision X (inject or not) made based on Z and expected usage. t2: Injection changes pain perception and perceived readiness. t3: Coach adjusts minutes/role; player alters movement aggressiveness. t4: Y1 performance realized during game; t5: Y2 reinjury/flare-up risk realized postgame.",
    "conditional_answers": "Answer if you instead ask: 'What is the effect of a policy that assigns injections randomly at t1 (regardless of Z) on performance and reinjury?': It would still require modeling mediators (minutes/movement) because the injection changes them; you cannot claim 'no change in reinjury' unless you also specify the induced change in playing intensity and exposure. Answer if you ask: 'What is the effect of injection while holding minutes fixed by design (e.g., strict minutes cap)?': That becomes a different intervention (do(X) plus do(minutes=cap)) and could have different effects; the original claim does not distinguish these interventions.",
    "label": "No",
    "correct_reasoning": "The claim is flawed because it asserts a Level-3 counterfactual while implicitly performing an impossible cross-world operation: it changes X (injection) but assumes away the mediator pathways by which X would alter the player’s behavior and exposure (minutes, aggressiveness, movement mechanics), and then concludes reinjury risk is unchanged. Formally, the observed association between X and Y is compatible with a causal graph where Z (latent severity and context) is a common cause of both X and Y, and where X also causally affects mediators M (pain, perceived readiness, coach usage, movement) that in turn affect Y. The counterfactual quantity needed is Y_{x=1} for games where X=0, but the claim substitutes an intuition closer to 'Y_{x=1, M=M_{x=0}}' (changing injection while fixing downstream behavior/usage as if the player would have played the same way), which is a mediator-fixing error and generally not identifiable or even well-defined without a structural model. Moreover, because Z influences both the decision to inject and the baseline risk/performance, the injection games are not exchangeable with non-injection games; the higher performance in injection games could reflect easier contexts or strategic deployment rather than the injection’s effect. Therefore, from the given information, one cannot validly conclude that injecting in the non-injection games would have raised performance to the observed injection level while leaving reinjury risk unchanged; the counterfactual claim overreaches by ignoring both confounding by Z and the fact that intervening on X changes mediators that drive Y."
  },
  {
    "id": "T3-BucketD-006",
    "pearl_level": "L1",
    "domain": "Sports",
    "scenario": "In professional tennis, players are allowed to take a Medical Timeout (MTO) for injury treatment. Data shows that players who take an MTO lose the match 70% of the time. A pundit claims MTOs break a player's own rhythm and should be avoided.",
    "claim": "Taking a Medical Timeout (X) causes a player to lose the match (Y).",
    "variables": {
      "X": "Taking a Medical Timeout",
      "Y": "Losing the match",
      "Z": "Underlying injury or physical distress"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Confounding by Indication",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z (Injury) causes X (Need for MTO) and Z causes Y (Poor performance/Loss). The observed relationship is spurious.",
      "key_insight": "Players take MTOs because they are hurt. Being hurt causes losing. The MTO is a symptom of the confounder, not the cause of the loss.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z occurs at t0. X happens at t1. Y happens at t2.",
    "conditional_answers": "No. If a healthy player took an MTO strategically (intervention without Z), they might actually gain an advantage (rest). The data reflects Z, not X.",
    "label": "No",
    "correct_reasoning": "The association between X and Y is driven by the common cause Z (injury). Players do not take MTOs randomly; they take them when Z is present. Z reduces the probability of winning. Therefore, X is a marker for Z, not a cause of Y. Asserting a causal link ignores the confounding by indication."
  },
  {
    "id": "T3-BucketD-007",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "An NBA team rolls out a new 'momentum timeout' policy: whenever the opponent makes two straight 3-pointers, the coach immediately calls a timeout. Midseason, analysts compare games where the coach used the momentum timeout versus games where he did not, and they find that games with a momentum timeout have a higher probability of losing. Some staff argue the policy is harmful and should be scrapped; others argue the policy is being deployed only when the game is already slipping away.",
    "claim": "Calling a momentum timeout (after two straight opponent threes) increases the chance the team loses, so the coach should stop using it.",
    "variables": {
      "X": "Coach calls an immediate 'momentum timeout' after the opponent hits two consecutive 3-pointers (policy intervention)",
      "Y": "Game outcome (probability of losing / win-loss)",
      "Z": "In-game adverse momentum state that triggers the timeout (e.g., opponent hot shooting, defensive breakdowns, fatigue, lineup mismatch, score run severity)"
    },
    "annotations": {
      "trap_type": "Reverse Causation",
      "trap_subtype": "Reactive Intervention",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z (adverse momentum) increases both the likelihood of X (timeout is called) and Y (loss). The observed association X–Y is therefore partly/mostly driven by Z. The intended causal arrow is X -> Y, but the policy is triggered by Z which is already on a path to Y.",
      "key_insight": "Because the timeout is a reactive response to worsening game state, comparing games with vs without the timeout conflates the effect of the timeout with the effect of the underlying momentum shock that caused it.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: Z (opponent run / hot shooting / mismatch) begins. t1: Z triggers X (timeout called). t2: Y (final result) is realized; Z continues to influence Y regardless of X.",
    "conditional_answers": "If the analysis can isolate exogenous variation in timeouts (e.g., random coach absence, a pre-committed rule applied regardless of severity, or an instrument like a broadcast-mandated timeout that occurs right after the second three independent of the coach), then the causal effect of X on Y could be estimated; otherwise the observed higher loss rate in timeout games is not interpretable as the effect of the timeout.",
    "label": "Ambiguous",
    "correct_reasoning": "At Pearl Level 2 we ask an interventional query: what would Y be under do(X=1) versus do(X=0). The empirical comparison P(Y|X=1) vs P(Y|X=0) is not equal to the causal effect because X is not assigned independently; it is triggered by Z, an adverse momentum state. Z is a common cause of X and Y (a backdoor path X <- Z -> Y), so the association can be negative even if the timeout is beneficial, neutral, or harmful. Without a valid strategy to block the backdoor (e.g., measuring and adjusting for the full relevant Z, or using quasi-random variation in X), the sign and magnitude of the causal effect of calling the timeout remain unidentified. Therefore the claim that the timeout increases losing is not justified from the observed comparison, but we also cannot conclude the timeout helps; the correct label is Ambiguous."
  },
  {
    "id": "T3-BucketD-008",
    "pearl_level": "L3",
    "domain": "Sports",
    "scenario": "An NBA team’s analytics group evaluates whether a late-game timeout by the coach prevented a loss. In the actual game, with 18 seconds left, the team was down 1, looked disorganized, and the coach called a timeout (X=1). Out of the timeout they ran a clean set, got a good shot, and won by 1 (Y=Win). A commentator claims: “If the coach hadn’t called the timeout, they still would have won, because the star guard was already ‘locked in’ and would have created a good shot anyway.” The team wants a counterfactual judgment about that single play, not an average effect across games.",
    "claim": "In this specific game, had the coach not called the timeout, the team would still have won because the star guard’s late-game focus would have produced an equally good possession.",
    "variables": {
      "X": "Calling a timeout with 18 seconds left (vs not calling it)",
      "Y": "Game outcome: team wins vs loses",
      "Z": "Set quality/possession organization (play call, spacing, matchup targeting) as a mediator generated by the timeout; also partially driven by in-the-moment defensive alignment"
    },
    "annotations": {
      "trap_type": "Preemption",
      "trap_subtype": "Late Preemption",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "X (timeout) causes Z (organized set quality), which causes Y (win). A backup cause B (star guard improvisation under chaos) could also cause Y if X were absent, but in the actual world X occurs and produces Y first, preempting the backup pathway.",
      "key_insight": "Counterfactual credit in a single event depends on whether the observed cause preempted a plausible alternative cause; the existence of a backup plan does not negate the causal role of the actual intervention when it changed the causal route to the outcome.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: coach observes disorganization/defense; t1: timeout called (X); t2: set is installed and spacing/mismatch created (Z); t3: shot quality increases; t4: made basket and defensive stop; t5: win (Y). In the no-timeout world, the possession evolves differently and may or may not reach a comparable shot via improvisation.",
    "conditional_answers": "Answer is Yes (claim is valid) if (i) the star guard’s improvisation would, in the no-timeout world, reliably generate a shot of equal or higher quality against the same defensive alignment and clock constraints, and (ii) the timeout did not materially alter the defense, matchups, or shot selection relative to the no-timeout trajectory. Otherwise the claim is not supported.",
    "label": "Yes",
    "correct_reasoning": "We are asked a counterfactual about a single realized play: whether Y would still have occurred had X been set to 0. In the actual world, X=1 triggered Z (an organized set), and Z produced Y (a win). The claim asserts that even under do(X=0), Y would still occur due to a backup causal route (star-guard improvisation), i.e., B -> Y, that would activate only if X were absent. This is precisely a late-preemption structure: the actual cause (timeout) brings about Y, while a plausible alternative cause would have brought about Y later or under a different trajectory if the actual cause had not occurred. Under late preemption, it can be true that (a) X caused Y in the actual world and simultaneously (b) Y would still have happened under do(X=0) because the backup route would have produced Y. Therefore the counterfactual claim ‘they still would have won without the timeout’ can be valid even though the timeout was causally efficacious in the observed world. The key is that counterfactual dependence is not required for actual causation in preemption settings, and the presence of a preempted backup pathway makes the counterfactual Y_{X=0}=Win consistent with the observed Y under X=1."
  },
  {
    "id": "T3-BucketD-009",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "An NBA team introduces a new in-game “momentum timeout” rule: whenever the opponent scores 8+ unanswered points, the head coach must call a timeout within the next dead ball. The front office wants to estimate the causal effect of enforcing this rule on win probability. Analysts compare games where the coach called a momentum timeout during an opponent run versus games where no such timeout was called, and they also adjust for the current score margin and time remaining. They find that games with momentum timeouts have lower final win probability, concluding the rule hurts performance.",
    "claim": "Enforcing the momentum-timeout rule (calling a timeout during opponent scoring runs) reduces the team’s chance of winning.",
    "variables": {
      "X": "Enforcing the momentum-timeout intervention (coach calls a timeout during an opponent 8+ point run)",
      "Y": "Game outcome (final win probability / win vs loss)",
      "Z": "Time-varying game state and latent team condition (e.g., opponent run severity, lineup fatigue, foul trouble, defensive breakdown intensity, and coach’s private assessment of team stability)"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "Z(t) (evolving game state and latent instability) influences both X(t) (timeout decision/enforcement at that moment) and Y (final outcome); additionally, past Y-proxy signals (earlier scoring swings) update Z(t) and change the probability of X(t), creating treatment assignment that depends on prior outcome trajectory.",
      "key_insight": "Timeouts are triggered reactively by worsening, rapidly changing game states that also predict losing; adjusting for only coarse observed state (score/time) may not block the backdoor path because unobserved and time-varying drivers of both the intervention and outcome remain, and some observed state variables can be affected by earlier (implicit) interventions and game dynamics.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "At t0 the team plays normally; between t0 and t1 an opponent run begins and Z(t1) worsens (fatigue, matchup issues). At t1 the coach decides X(t1)=1 (timeout) partly based on Z(t1) and prior scoring trajectory. Between t1 and t2, Z(t2) evolves again (lineup changes, foul trouble), affecting both subsequent timeout likelihood and the final Y at t_end.",
    "conditional_answers": "Ambiguous: If all components of Z(t) that jointly drive timeout decisions and future win probability are fully observed over time and correctly modeled (e.g., possession-level state, lineup matchups, fatigue proxies, foul risk, shot quality, and coach intent) and no post-treatment variables are inappropriately controlled for, then one could identify the causal effect of enforcing the rule; if key parts of Z(t) are unobserved or mismeasured, the observed negative association may be entirely due to reactive assignment and time-varying confounding.",
    "label": "Ambiguous",
    "correct_reasoning": "The claim attempts to move from an observational contrast to an interventional statement about do(X). In this setting, X is not assigned randomly: the coach calls a momentum timeout precisely when the evolving game state Z(t) indicates elevated risk (e.g., defensive confusion, fatigue, foul trouble, opponent hot streak, matchup exploitation). Those same components of Z(t) causally increase the probability of losing Y. Therefore there is an open backdoor path X \u001f\u001f Z(t) \u001f\u001f Y (time-varying confounding). Moreover, Z(t) is updated by earlier scoring trajectory (a proxy for prior outcome evolution), so treatment assignment depends on past outcome-related signals, which is the hallmark of time-varying confounding. Adjusting only for score margin and time remaining does not guarantee blocking the backdoor because (i) they may be too coarse to capture the latent instability that drives both X and Y, and (ii) some game-state variables used for adjustment may themselves be downstream of earlier strategic responses, risking bias if conditioned on incorrectly. Hence, from the information given, the negative association between calling a momentum timeout and winning cannot be interpreted as the causal effect of enforcing the rule. The effect could be harmful, beneficial, or null; identification would require either randomization (e.g., rule-enforced vs not enforced games) or a valid causal strategy that correctly handles time-varying confounding (e.g., sequential ignorability with rich Z(t), g-methods, or an instrument that shifts X without directly affecting Y)."
  },
  {
    "id": "T3-BucketD-010",
    "pearl_level": "L3",
    "domain": "Sports",
    "scenario": "A tennis player feels mild wrist pain the morning of a tournament match. The coach debates whether to switch from a heavy topspin forehand (high wrist load) to a flatter forehand (lower wrist load). After choosing to keep the heavy topspin style, the player’s wrist worsens mid-match and they retire. A commentator claims: “If the coach had forced the flatter forehand, the player would not have retired.”",
    "claim": "If the coach had forced the flatter forehand, the player would not have retired from the match.",
    "variables": {
      "X": "Counterfactual intervention: coach forces the player to use a flatter forehand technique (reduced wrist load) for the match",
      "Y": "Match retirement due to wrist injury aggravation",
      "Z": "Latent injury severity and biological fragility of the wrist that morning (e.g., micro-tear extent), affecting both technique choice feasibility and retirement risk"
    },
    "annotations": {
      "trap_type": "Selection Bias",
      "trap_subtype": "Counterfactual Conditioning",
      "difficulty": "Easy",
      "subdomain": "Sports",
      "causal_structure": "Z (true wrist damage) influences both X (whether a flatter technique is feasible/accepted without performance collapse) and Y (retirement). The counterfactual statement conditions on the realized fact that Y happened (retired), then infers what would happen under do(X), which implicitly selects a subset of worlds/players where the match is even played similarly and where retirement is comparable.",
      "key_insight": "Counterfactuals about preventing retirement are ill-posed when you condition on the observed retirement event; the set of “would-have-played” worlds under the alternative technique may differ because the injury severity that led to retirement also affects whether the alternative technique is possible and whether the player would continue playing at all.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: underlying wrist micro-damage Z exists before the match; t1: coach/player choose technique X; t2: wrist load during rallies interacts with Z; t3: injury aggravates; t4: retirement Y occurs (observed).",
    "conditional_answers": "Ambiguous unless we specify (i) the causal effect of technique change on wrist load and aggravation, (ii) whether the player would still attempt to play the full match under the alternative technique given pain/performance tradeoffs, and (iii) how Z would behave under the counterfactual (e.g., whether Z is the same micro-damage but with different load exposure).",
    "label": "Ambiguous",
    "correct_reasoning": "The claim is a counterfactual of the form: Y_{X=flat}=0 given we observed Y=1 under X=topspin. This is not identifiable from the observation alone because conditioning on the realized retirement (Y=1) induces counterfactual selection: the observed world is one where Z was sufficiently severe (or fragile) to culminate in retirement, and that same Z also affects whether the flatter forehand would be feasible (X) and whether retirement would still occur (Y). Without a structural model linking Z, technique-induced load, and the retirement decision, we cannot infer whether, in the closest world where we intervene to force a flatter forehand, the player would (a) continue playing without retirement, (b) retire anyway due to the same underlying damage, or (c) retire for a different reason (e.g., performance collapse leading to strategic retirement). Therefore the counterfactual conclusion is not warranted from the given information; it remains ambiguous because multiple causal models consistent with the facts imply different values of Y_{X=flat}."
  },
  {
    "id": "T3-BucketD-011",
    "pearl_level": "L1",
    "domain": "Sports",
    "scenario": "A soccer analytics group studies whether using a high press is linked to better match results. They compute, across a full season, the association between a team’s press intensity (measured by PPDA: passes allowed per defensive action, inverted so higher means more pressing) and match points. They find that higher press intensity is associated with more points per match. They also notice that within the subset of matches where the team trailed at any point, higher press intensity is associated with fewer points. A pundit argues this means pressing is only good when you are already winning and is harmful when you are behind. The analytics group instead claims the season-level association (pressing correlates with more points) is still valid as an observational statement about the whole dataset.",
    "claim": "In this season’s match data, teams that press more intensely tend to earn more points per match (i.e., press intensity is positively associated with points).",
    "variables": {
      "X": "Press intensity in a match (e.g., inverted PPDA; higher values indicate more aggressive pressing)",
      "Y": "Match outcome measured as points earned (0/1/3) or expected points",
      "Z": "Match state / game context that shapes both pressing and outcomes (e.g., whether the team is trailing, leading, red cards, opponent strength, time remaining)"
    },
    "annotations": {
      "trap_type": "Simpson’s Paradox",
      "trap_subtype": "Aggregation Bias",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "Z (match state/opponent strength) influences both X (press intensity) and Y (points). Aggregating across heterogeneous Z strata can yield an overall X–Y association that differs in sign from within-stratum associations.",
      "key_insight": "Simpson’s paradox is about how aggregation over a context variable Z can reverse within-group associations; it does not invalidate the existence of the marginal association itself. The claim is purely associational (P(Y|X) differs with X) and can be true even if causal interpretations fail or subgroup patterns reverse.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z at t0 (pre-match opponent strength, lineup quality) and Z at t1 (in-match scoreline, red cards, time remaining) affect X at t1 (pressing decision/intensity) and also affect Y at t2 (final points).",
    "conditional_answers": "Answer is Yes if the dataset indeed shows a positive marginal association between press intensity and points when not conditioning on Z. Answer could flip to No only if the empirical marginal association is not actually positive (i.e., the descriptive statistic was computed incorrectly).",
    "label": "Yes",
    "correct_reasoning": "Pearl L1 concerns associations, not interventions. The claim asserts a marginal statistical relationship: that higher X is observed alongside higher Y in the pooled season data. Simpson’s paradox (aggregation bias) warns that conditioning on a context variable Z (match state/opponent strength) can yield within-Z associations that differ from, or even reverse, the pooled association. However, the presence of a reversal after stratifying on Z does not logically contradict the existence of the pooled association; both can simultaneously be true because P(Y|X) in the aggregate is a weighted mixture over Z strata with weights that depend on X. Therefore, if the computed season-level correlation/mean difference is positive, the claim is valid as an L1 statement. What would be invalid is a causal conclusion like “pressing causes more points,” because Z is a common cause of both X and Y and can drive the observed association; but the claim deliberately stays at the associational level, so it remains correct."
  },
  {
    "id": "T3-BucketD-012",
    "pearl_level": "L1",
    "domain": "Sports",
    "scenario": "A soccer club’s analysts notice that matches in which the head coach makes an early substitution (before the 30th minute) are much more likely to end in a loss. A commentator claims this proves that early subs hurt team performance and the coach should avoid them.",
    "claim": "Making an early substitution causes the team to lose more often.",
    "variables": {
      "X": "Early substitution by the coach (before the 30th minute)",
      "Y": "Match outcome (probability of losing)",
      "Z": "Early-match adversity (e.g., red card, key injury, or conceding an early goal) that prompts the substitution and also increases losing probability"
    },
    "annotations": {
      "trap_type": "Reverse Causation",
      "trap_subtype": "Outcome-driven Selection",
      "difficulty": "Easy",
      "subdomain": "Sports",
      "causal_structure": "Z increases the chance of an early substitution (X) and independently increases the chance of losing (Y); observed association between X and Y is driven by matches already going badly.",
      "key_insight": "Early substitutions are often reactions to a deteriorating game state; the outcome risk is already elevated before the substitution decision, so correlation does not identify a harmful effect of the substitution.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z at t0 (early adversity: red card/injury/early goal) raises baseline loss risk by t90 and triggers X at t0+ (early substitution); analysts then observe X correlated with Y at t90.",
    "conditional_answers": "Answer if you only look at observational match logs without accounting for why the substitution happened: you will (incorrectly) conclude early subs cause losses. Answer if you compare similar game states (same scoreline, same red-card status, similar injury severity) at the same minute: the apparent harm should shrink or could even reverse.",
    "label": "No",
    "correct_reasoning": "At Pearl Level 1 we are only describing association, not intervention. The claim is causal but the evidence is merely correlational. The data-generating story contains a common cause Z (early-match adversity) that (i) makes an early substitution X more likely because the coach is responding to trouble, and (ii) makes losing Y more likely because the team is already disadvantaged. Therefore P(Y|X) > P(Y|not X) can hold even when X has no harmful causal effect (and could be beneficial). This is a reverse-causation/outcome-driven selection pattern: the impending bad outcome is foreshadowed by Z and induces the ‘treatment’ X. Without conditioning on (or otherwise accounting for) Z, the observed association between X and Y cannot be interpreted as X -> Y, so the causal conclusion is flawed."
  },
  {
    "id": "T3-BucketD-013",
    "pearl_level": "L1",
    "domain": "Sports",
    "scenario": "Formula 1 data shows that drivers who make an 'unscheduled' pit stop (outside their planned window) finish, on average, 8 positions lower than those who stick to the schedule. Fans argue that sticking to the schedule is the key to winning.",
    "claim": "Sticking to the planned pit schedule causes better race finishes; deviating causes poor finishes.",
    "variables": {
      "X": "Making an unscheduled pit stop",
      "Y": "Race finish position",
      "Z": "Car damage, collision, or extreme tire degradation"
    },
    "annotations": {
      "trap_type": "Reverse Causation",
      "trap_subtype": "Outcome-driven Selection",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z (Damage/Collision) forces X (Unscheduled stop) and Z causes Y (Time loss/Retirement). The stop is a reaction to a problem, not the cause of the problem.",
      "key_insight": "Unscheduled stops are almost always reactions to adverse events (Z) that have already ruined the race strategy. The correlation is due to the adverse event.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z (crash) at Lap 20 -> X (pit stop) at Lap 21 -> Y (finish last) at Lap 50.",
    "conditional_answers": "No. If a driver randomly decided to make an extra stop (do(X)) without damage, they would lose time, but likely less than the data suggests for 'unscheduled' stops which include repair time.",
    "label": "No",
    "correct_reasoning": "This is L1 Reverse Causation/Confounding. The decision to pit early (X) is caused by Z (damage/issues), which also causes the poor result (Y). The 'unscheduled stop' group is selecting for drivers who are already in trouble. The claim incorrectly attributes the result to the strategic decision rather than the external cause."
  },
  {
    "id": "T3-BucketD-014",
    "pearl_level": "L3",
    "domain": "Sports",
    "scenario": "In a tennis tournament, a star player feels mild wrist pain during the warm-up. The coach chooses to shorten the pre-match hitting session and asks the player to avoid high-pace forehand drills. The player wins the match but later aggravates the wrist in the next round and withdraws. A commentator claims the shortened warm-up 'caused' the later injury because the wrist was not fully prepared. The coach counters: if they had done the full warm-up, the wrist would have been even worse and the player might have withdrawn earlier. Analysts debate the counterfactual: what would have happened to the wrist if the warm-up had not been shortened, given the same underlying pain state.",
    "claim": "If the coach had NOT shortened the warm-up (X=0), the player would NOT have aggravated the wrist in the next round (Y=0).",
    "variables": {
      "X": "Warm-up modification decision: shortened/low-intensity warm-up vs normal full-intensity warm-up",
      "Y": "Subsequent wrist aggravation leading to withdrawal in the next round",
      "Z": "Latent wrist tissue fragility and pain severity at warm-up time (unobserved), which influences both the decision to shorten the warm-up and the probability of later aggravation"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Cross-world Confounder",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z -> X and Z -> Y in the actual world; the counterfactual query compares Y_x=0 vs Y_x=1 but Z is not invariant across worlds because the coach's decision and the player's behavior/effort can change pain evolution and load, so the 'same Z' assumption is not justified without a structural model.",
      "key_insight": "Counterfactual claims require a model that specifies how the unobserved injury state Z and subsequent load evolve under each action; you cannot treat Z as a fixed background attribute shared across the X=0 and X=1 worlds when Z is partly latent and dynamically affected by behavior and micro-trauma.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: latent wrist fragility/pain Z present at warm-up; t0: coach chooses warm-up modification X based on observed cues of Z; t1: match load and compensatory mechanics respond to X and Z; t2: next-round cumulative load leads to aggravation/withdrawal Y.",
    "conditional_answers": "Ambiguous unless we specify (i) whether warm-up intensity causally changes micro-damage accumulation vs protective readiness, (ii) how the player would have adjusted stroke mechanics and effort under a full warm-up, and (iii) whether the same latent wrist state Z at t0 would have evolved differently under X=0 vs X=1.",
    "label": "Ambiguous",
    "correct_reasoning": "The claim is a counterfactual statement about the same player: compare Y under do(X=0) (normal warm-up) to Y under do(X=1) (shortened warm-up). However, the decision X is made in response to an underlying injury state Z that also drives Y, and Z is only partially observed and dynamically evolves with subsequent behavior. In an L3 query, we cannot identify P(Y_{x=0}=0 | observed history) from the single realized world without a structural causal model that specifies how Z and downstream match load respond to each intervention. Treating Z as a fixed 'background' attribute across the two worlds is a cross-world confounding error: the very intervention may alter pain evolution, compensatory mechanics, and load, which in turn changes effective injury risk. Therefore, from the given information, neither 'full warm-up would have prevented aggravation' nor its negation is logically entailed; the counterfactual remains underdetermined, making the correct label Ambiguous."
  },
  {
    "id": "T3-BucketD-015",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "An NBA team pilots an in-game “momentum timeout” policy: whenever the opponent goes on a 7–0 run, the coach calls an immediate timeout (X). Analysts compare games where the coach used the momentum-timeout rule versus games where he did not, and they observe that games with momentum timeouts have worse final point differential (Y). The front office considers banning the policy, claiming it harms performance. However, the coach tends to trigger the policy precisely when the team is already spiraling (e.g., poor shot quality, defensive breakdowns, fatigue), and those same conditions also predict losing margins. Additionally, the coach sometimes deviates from the rule when he expects the run to end naturally (e.g., opponent’s hot shooter subbing out), creating further endogeneity in when the timeout is called.",
    "claim": "If the team were to enforce the momentum-timeout rule (call a timeout after every 7–0 opponent run), the final point differential would improve compared to not enforcing it.",
    "variables": {
      "X": "Calling an immediate timeout in response to an opponent 7–0 run (enforcing the momentum-timeout policy)",
      "Y": "Final point differential / win probability at game end",
      "Z": "Time-varying game state that both triggers the timeout decision and affects outcomes (e.g., current lineup fatigue, defensive communication quality, shot quality, opponent hot streak sustainability, foul trouble, and score/clock context)"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "Z(t) influences both X(t) (timeout called) and Y; additionally Y(t-1) (current margin and run dynamics) affects Z(t) and X(t), creating a time-varying backdoor path X(t) <- Z(t) <- Y(t-1) -> Y",
      "key_insight": "The timeout is a reactive, state-dependent intervention chosen in response to evolving in-game conditions that also causally drive the final outcome; naive comparisons (even with some controls) can misattribute the effect of the bad game state to the timeout itself, and proper identification requires modeling the longitudinal treatment assignment and history.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: prior possessions set current margin and fatigue; t1: opponent run emerges and game state Z(t1) worsens; t2: coach decides whether to call timeout X(t2) based on Z(t1) and expectations; t3: subsequent possessions determine Y(t3) (final margin).",
    "conditional_answers": "Answer is Ambiguous if we only observe that timeouts are more common in games with worse outcomes, because that association can arise from time-varying confounding. The claim becomes answerable (potentially Yes or No) if we have a valid identification strategy such as a quasi-random instrument (e.g., exogenous communication failure forcing a timeout, or a rule-enforced automatic timeout), or rich play-by-play to apply g-methods (MSMs/g-formula) with correct modeling of the full history.",
    "label": "Ambiguous",
    "correct_reasoning": "At Pearl Level 2 we ask an interventional question: what would Y be under do(X=1) versus do(X=0). The observed data are generated by a policy where X is not randomized; it is chosen as a function of the evolving game state Z(t) and prior outcomes Y(t-1) (the run itself and current margin). Z(t) is a time-varying common cause of both the decision to call a timeout and the eventual final margin, opening an unblocked backdoor path from X to Y through Z. Moreover, because Z(t) is itself affected by earlier outcomes and earlier coaching choices, naive adjustment (e.g., controlling for current score only) can fail: it may omit key components of Z (fatigue, shot quality, matchup issues) or condition on post-treatment variables if earlier timeouts already changed the state. Therefore, from the reported association alone we cannot determine the sign or magnitude of the causal effect of enforcing the momentum-timeout rule. The claim that enforcing the rule would improve Y is not identifiable without additional assumptions or a design that breaks the dependence of X on Z(t) (e.g., randomization, an instrument, or correct longitudinal causal estimation). Hence the proper label is Ambiguous."
  },
  {
    "id": "T3-BucketD-016",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "An NBA team pilots a wearable-based 'fatigue alert' system. When the system flags a player as high-fatigue during the week, the coaching staff reduces that player's minutes in the next game (rest intervention). The analytics department wants to estimate the causal effect of reducing minutes on next-game performance (points per 36 and defensive rating impact). A naive model that adjusts for the wearable fatigue score concludes that reducing minutes has no benefit or even harms performance. A causal analyst argues that this adjustment is invalid because the fatigue score is partly caused by the rest decision itself through mid-week practice modifications and recovery protocols that are triggered once a player is flagged and slated for reduced minutes.",
    "claim": "If we intervene to reduce a player's minutes in the next game (relative to the coach's default plan), the player's next-game performance improves on average; the 'no benefit' estimate arises because the analysis incorrectly adjusts for a post-intervention mediator (wearable fatigue score and related recovery actions), blocking part of the causal pathway.",
    "variables": {
      "X": "Minutes reduction policy for the next game (coach-enforced cap vs. default minutes plan)",
      "Y": "Next-game performance (e.g., points per 36, on/off defensive impact, shooting efficiency)",
      "Z": "Wearable-derived fatigue score and triggered recovery/practice modifications (a mediator influenced by X and affecting Y)"
    },
    "annotations": {
      "trap_type": "Confounder–Mediator Error",
      "trap_subtype": "Mediator Adjustment Error",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "X (minutes cap) affects Z (fatigue score and recovery/practice load changes), which affects Y (performance). Separately, latent baseline condition (e.g., minor soreness, travel load) affects both the coach's default inclination to cap minutes and Y, but the key trap is treating Z as a pre-treatment confounder and adjusting for it even though it is downstream of X once the policy is in place.",
      "key_insight": "At L2, we must estimate the effect of do(X). Conditioning on a mediator Z that is affected by X removes part of X's effect on Y and can also open spurious paths if Z is a collider for downstream processes, yielding a misleading 'no effect' estimate.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: baseline soreness/travel load exists; t1: team sets X (minutes cap for upcoming game); t2: given X, staff alters practices/recovery, changing Z (fatigue score trajectory); t3: game occurs and Y is realized.",
    "conditional_answers": "Answer if you adjust for Z: you estimate mostly the direct effect of X not mediated through fatigue/recovery, and you may conclude X has little or negative effect. Answer if you do not adjust for Z (and instead block only true pre-treatment backdoors): you recover the total causal effect of X on Y, which is positive in this scenario.",
    "label": "Yes",
    "correct_reasoning": "We are asked about an intervention: the effect of do(X=minutes cap) on Y (next-game performance). Under the stated data-generating process, X causally influences Z (fatigue trajectory and the recovery/practice changes that occur because the staff plans reduced minutes), and Z causally influences Y. Therefore Z lies on the causal pathway X -> Z -> Y. Adjusting for Z when estimating the effect of do(X) is a mediator adjustment error: it blocks the indirect path through Z and thus does not identify the total effect of X on Y. Consequently, an analysis that conditions on Z can legitimately return a near-zero or negative estimate even when the true total effect of intervening to reduce minutes is beneficial. The correct estimand for the coaching decision is the total causal effect, which requires not conditioning on post-intervention mediators like Z; instead one should adjust only for pre-treatment confounders of X and Y (e.g., baseline soreness/travel schedule known before the minutes plan is set). Given that the claim attributes the null finding to incorrect mediator adjustment and asserts a positive total effect under proper L2 reasoning, the claim is valid."
  },
  {
    "id": "T3-BucketD-017",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "An NBA team introduces a wearable-based 'high-intensity minutes cap' policy mid-season. Coaches are instructed to pull players once the wearable estimates they have exceeded a threshold of high-speed runs and accelerations in a game. After implementation, the team’s internal report compares players who were actually pulled early (cap-triggered) vs. players who were not pulled, and finds that the pulled-early players have a higher rate of next-game soft-tissue injuries. The performance staff concludes the cap policy is harmful and recommends abandoning it.",
    "claim": "Because players who were pulled early due to the intensity cap had more next-game soft-tissue injuries, enforcing the intensity cap increases injury risk and should be stopped.",
    "variables": {
      "X": "Enforcing the wearable-based high-intensity minutes cap in a game (player is pulled early once the cap is triggered)",
      "Y": "Soft-tissue injury occurrence in the next game (e.g., hamstring/calf strain)",
      "Z": "Acute fatigue/strain signals during the game (the same latent/estimated physiological stress that both triggers the cap and elevates injury risk)"
    },
    "annotations": {
      "trap_type": "Collider",
      "trap_subtype": "Conditioning on Compliance",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z (acute fatigue/strain) increases Y (next-game injury) and also increases the probability that X is applied (cap is triggered and enforced). The analysis conditions on compliance/implementation status (who actually got pulled early), which is partly determined by Z, creating a biased comparison that makes X look harmful even if it is protective or neutral.",
      "key_insight": "Being 'pulled early' is not randomly assigned; it is a downstream indicator of in-game overload. Comparing pulled vs not-pulled players conditions on a variable influenced by the same stress that causes injury, inducing collider/selection bias in the estimated effect of the policy.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: Player experiences high acute fatigue/strain Z during game. t0: Z triggers cap enforcement X (coach pulls player). t1: Z (and related physiological damage) raises probability of next-game injury Y; X may reduce further load after t0 but does not erase prior strain.",
    "conditional_answers": "If cap enforcement were randomized at the player-game level (or if the analysis used an exogenous rule-based threshold with a regression discontinuity around the trigger point and did not condition on post-trigger compliance), then a causal estimate of X on Y could be identified; under the current pulled-vs-not comparison, the direction and magnitude are not trustworthy.",
    "label": "No",
    "correct_reasoning": "The claim treats the observed association between X (being pulled early) and Y (next-game injury) as the causal effect of enforcing the cap. But at Pearl Level 2 we must ask what would happen under an intervention do(X). Here, X is not assigned independently: the cap is enforced precisely when Z (acute fatigue/strain) is high. Z is a common cause of both X and Y (Z -> X and Z -> Y). The report effectively compares high-Z games (more likely to trigger enforcement) to lower-Z games (less likely to trigger enforcement), so the higher injury rate among the pulled group is expected even if enforcing the cap reduces incremental load after the trigger. In causal terms, the comparison conditions on a post-trigger implementation/compliance status that is itself a function of Z, producing selection/collider-type bias in the estimated effect. Therefore, the observed higher injury rate among pulled players does not imply do(X=1) increases Y; it more plausibly reflects that Z was worse in the games where X occurred. A valid causal evaluation would require blocking the backdoor path through Z (e.g., randomization, valid quasi-experiment, or appropriate causal adjustment using pre-intervention measures of strain), rather than conditioning on who ended up being pulled."
  },
  {
    "id": "T3-BucketD-018",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A soccer club introduces a new high-intensity press in mid-season. The coaching staff compares matches where the team 'fully implemented the press' versus matches where they did not, and finds that fully-press matches have fewer goals conceded. They conclude the press causally improves defensive performance and decide to mandate it every match going forward. However, the decision to fully press in a given match is made on game day based on opponent strength, player freshness, and whether key defenders are available.",
    "claim": "Mandating the high-intensity press (X) will reduce goals conceded (Y) because matches with full pressing had fewer goals conceded.",
    "variables": {
      "X": "Coach mandates full high-intensity pressing for the match (vs partial/no press)",
      "Y": "Goals conceded by the team in the match",
      "Z": "Match-specific tactical risk context (opponent strength/style, player freshness/fatigue, key defender availability) that influences whether the press is used and also affects goals conceded"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z (game-day context and evolving team condition) affects both X (whether the press is mandated) and Y (goals conceded). Additionally, past Y (recent defensive performance and match load) influences Z (fatigue/injury status) which then influences future X, creating time-varying confounding across matches.",
      "key_insight": "The observed association between pressing and fewer goals conceded mixes the effect of the press with the effect of match context and evolving fatigue/availability that also drives the coach's decision; without a design that blocks these backdoor paths, the interventional effect of mandating the press is not identified.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t-2 to t-1: Prior match load and prior goals conceded affect perceived defensive form and fatigue/injuries (part of Z). t0: Based on Z, coach chooses whether to mandate the press (X). t1: Match is played and goals conceded (Y) is realized. The cycle repeats with Y feeding into future Z and X.",
    "conditional_answers": "Ambiguous: If the club can credibly treat the press mandate as randomized conditional on pre-match covariates (or uses a valid quasi-experiment like an exogenous assistant-coach change that affects X but not Y except through X), then the claim could be supported. If, instead, pressing is more likely when the squad is fresher or when the opponent is weak (or less likely when defenders are missing), then the observed reduction in goals conceded may be due to Z rather than X.",
    "label": "Ambiguous",
    "correct_reasoning": "This is a Level-2 (interventional) question: we want the causal effect of do(X=press) on Y (goals conceded). The comparison made is observational: E[Y|X=press] vs E[Y|X=no press]. But X is not assigned independently; it is chosen as a response to Z (opponent, freshness, availability), and Z also causally affects Y. Therefore there is an open backdoor path X <- Z -> Y, so the associational difference does not equal the interventional contrast E[Y|do(X=press)] - E[Y|do(X=no press)]. Moreover, Z is time-varying: prior outcomes and match loads influence current fatigue/availability (part of Z), which then influences the coach's future X, so naive adjustment choices can also be problematic if they condition on post-treatment variables in a multi-match panel. Without additional information—e.g., a correct longitudinal causal model with appropriate adjustment/weighting for time-varying confounding, or an exogenous source of variation in X—the direction and magnitude of the true effect of mandating the press cannot be determined from the stated comparison. Hence the claim is not confirmably true or false from the provided evidence, making the conclusion ambiguous."
  },
  {
    "id": "T3-BucketD-019",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A soccer club rolls out a new GPS-based training program mid-season that caps each player’s weekly high-speed running distance. The performance staff then evaluates the program by comparing match availability (not missing games due to injury) between players who complied with the cap and those who did not. They find that compliant players missed fewer games and conclude the cap caused fewer injuries.",
    "claim": "Imposing the GPS high-speed running cap (X) reduces injury-related game absences (Y), because compliant players have fewer absences than non-compliant players.",
    "variables": {
      "X": "Intervention: enforce/assign a weekly cap on high-speed running distance in training (GPS-based load restriction)",
      "Y": "Outcome: injury-related match absences over the next 8 weeks",
      "Z": "Post-intervention selection variable: compliance with the cap (and related factors like coach trust/playing role that affect both compliance and injury risk)"
    },
    "annotations": {
      "trap_type": "Collider",
      "trap_subtype": "Conditioning on Compliance",
      "difficulty": "Easy",
      "subdomain": "Sports",
      "causal_structure": "X affects compliance Z (players are more likely to comply when the cap is enforced). Unobserved factors U (e.g., baseline injury-proneness, professionalism, coach-managed minutes/role) affect both Z (who complies) and Y (injury absences). Conditioning on Z opens a noncausal path X -> Z <- U -> Y, biasing the estimated effect of X on Y.",
      "key_insight": "Comparing only compliers vs non-compliers is not a valid estimate of the intervention effect because compliance is a post-intervention collider influenced by both the intervention and player characteristics tied to injury risk.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: Club enforces cap X. t1: Players exhibit compliance level Z during training weeks. t2: Injuries accumulate and produce match absences Y in subsequent weeks.",
    "conditional_answers": "Answer if you analyze everyone assigned to the cap regardless of compliance (intention-to-treat): the estimate is closer to the causal effect of implementing the policy. Answer if you restrict to compliers: the association can be biased in either direction because conditioning on Z opens a backdoor path through unobserved traits.",
    "label": "No",
    "correct_reasoning": "The claim treats the observed difference in Y between compliant and non-compliant players as the causal effect of enforcing the cap X. But the analysis conditions on Z = compliance, which is downstream of X (X -> Z). Compliance is also affected by unmeasured player/coach factors U (e.g., injury-proneness, professionalism, role and minute management) that also affect injury absences Y (U -> Y). Therefore Z is a collider on the path X -> Z <- U. Conditioning on Z opens this otherwise blocked path, inducing a spurious association between X and Y even if X had no effect. Hence the comparison among compliers does not identify the causal effect of the intervention; it is a biased post-intervention selection estimate. A valid L2 estimate would avoid conditioning on Z and instead use an intention-to-treat comparison (assigned/enforced vs not) or an identification strategy that accounts for noncompliance without opening collider bias."
  },
  {
    "id": "T3-BucketD-020",
    "pearl_level": "L3",
    "domain": "Sports",
    "scenario": "An NBA team’s analytics department reviews a playoff series where the coach benched a young guard (Player G) in the 4th quarter of Games 5–7. In the actual world, the team won the series. The coach argues the benching was decisive because, in the games where G stayed on the floor late during the regular season, the team often gave up leads. A counterfactual question is posed: 'If the coach had NOT benched G in those playoff 4th quarters, would the team still have won the series?' The department tries to answer by comparing late-game defensive rating only among games where G was not benched and the team kept the lead, then extrapolating that to the playoff games.",
    "claim": "Because the team’s late-game defensive rating is much worse in games where Player G plays the 4th quarter, the team would have lost the series if the coach had kept G in (i.e., benching G caused the series win).",
    "variables": {
      "X": "Benching Player G in the 4th quarter (coach decision: bench vs keep on court)",
      "Y": "Winning the playoff series",
      "Z": "Late-game game-state and opponent response (lead size, foul trouble, matchup targeting, and lineup adjustments) that both influence the benching decision and are affected by earlier events in the game/series"
    },
    "annotations": {
      "trap_type": "Selection Bias",
      "trap_subtype": "Counterfactual Conditioning",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "Dynamic series with feedback: earlier possessions and opponent adjustments affect Z (late-game state), Z influences X (benching), and both Z and X influence Y (series win). The analysis conditions on a post-treatment-like event (survival/keeping the lead) when inferring the counterfactual outcome under do(X=keep).",
      "key_insight": "You cannot answer 'Would they still win if G played?' by restricting to worlds/games where the team 'kept the lead' (a downstream consequence of many factors intertwined with X). Conditioning on survival/lead-holding induces counterfactual selection bias and breaks cross-world comparability.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: Early-game performance and opponent scouting updates shift late-game state Z (lead size, foul trouble, matchup). t1: Coach chooses X (bench/keep) based on Z. t2: Late possessions (also influenced by opponent counter-adjustments triggered by X) determine game outcomes, which aggregate to Y (series win).",
    "conditional_answers": "Answer if you (incorrectly) condition on games where the team kept the lead: keeping G in appears to 'cause' losses because you select a subset of trajectories where many unobserved favorable factors are already present. Answer if you instead define the counterfactual without conditioning on post-decision survival and model the dynamic policy/response: the effect of benching is not identified from these comparisons and could even reverse depending on opponent adaptation.",
    "label": "No",
    "correct_reasoning": "The claim is flawed because it answers a counterfactual query, Y_{x=keep} vs Y_{x=bench}, using comparisons that condition on an event that is not pre-treatment and not cross-world stable. In the actual series, the decision X is made in response to Z (lead size, foul trouble, matchup targeting, and opponent adjustments). Z is itself shaped by earlier within-game and within-series dynamics, and crucially, the department’s filter 'games where G was not benched and the team kept the lead' conditions on a downstream consequence of the same causal system that produces Y. This is counterfactual conditioning: it selects trajectories where the team already survived late-game variance, and that survival is influenced by both Z and factors correlated with X (e.g., opponent choosing to hunt G on switches, foul accumulation, or the coach shortening the rotation). Conditioning on such survival/lead-holding opens selection paths that distort the relationship between X and Y across worlds, so the observed association among the selected subset does not equal the causal effect of intervening to keep G in. Formally, the comparison mixes different underlying trajectories: P(Y|X=keep, survive/keep-lead) is not a valid estimator of P(Y|do(X=keep)) nor of the counterfactual Y_{x=keep} in the specific playoff games. Therefore, the data described cannot support the conclusion that benching G caused the series win, and the claimed counterfactual is not justified."
  },
  {
    "id": "T3-BucketD-021",
    "pearl_level": "L3",
    "domain": "Sports",
    "scenario": "An NBA team evaluates whether giving a star player a scheduled rest game (a 'load management' night off) prevents injury later in the season. Analysts look at games where the player was listed as 'questionable' and either played or sat. They then ask a counterfactual question: for the games the player actually sat, would he have stayed healthy over the next 10 games if he had played instead? A report claims the answer is yes because, among the 'questionable' rest games, players who sat had fewer injuries afterward than players who played.",
    "claim": "If the star had played instead of resting on his 'questionable' night, he would still have remained uninjured over the next 10 games; therefore, resting did not causally prevent injury in those cases.",
    "variables": {
      "X": "Playing the 'questionable' game (1=played, 0=rested)",
      "Y": "Injury occurrence within the next 10 games (1=injured, 0=not injured)",
      "Z": "Latent short-term physical fragility at t0 (e.g., micro-tears/fatigue level) that influences both the decision to rest and the chance of injury"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Cross-world Confounder",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z -> X and Z -> Y, with the counterfactual query comparing Y_{X=1} vs Y_{X=0} for the same individual; but Z is not fully observed and differs across the actual world (where X=0 occurred) and the hypothetical world (where X=1 is imposed).",
      "key_insight": "The counterfactual claim implicitly assumes the same underlying fragility Z would hold under both 'rest' and 'play' worlds, yet Z is precisely what drives both the rest decision and injury risk; without a model that pins down Z across worlds, the individual-level counterfactual is not identified from the observed comparison.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: staff observes signals of fragility Z and chooses X (play vs rest). t1..t10: accumulated load plus Z determines Y (injury/no injury). The counterfactual asks about Y in t1..t10 under the alternate X at t0 while holding the same player fixed.",
    "conditional_answers": "Answer is 'No' if the rest decision is driven by unmeasured fragility (Z) that also affects subsequent injury risk; the observed post-rest injury rate cannot be interpreted as the player's counterfactual injury risk had he played. Answer could change only if Z were fully measured and a valid counterfactual model (e.g., structural equations or randomized rest assignment) justified transporting Z across worlds.",
    "label": "No",
    "correct_reasoning": "The claim is a Level-3 statement about an individual counterfactual: it asserts a value of Y_{X=1} for cases where X=0 actually occurred. However, treatment assignment X is not exogenous: the medical/coaching staff uses information about latent fragility Z (micro-injury, fatigue) to decide rest, so Z is a common cause of X and Y. In the observed world where the player rested (X=0), we learn that staff likely perceived high Z. The report then compares those rested cases to played cases, but played cases tend to have lower Z. This mixes different underlying states and does not identify Y_{X=1} for the rested individuals. Moreover, the counterfactual requires a cross-world linkage: it assumes the same Z relevant to injury risk would persist under the hypothetical intervention X=1, yet Z is precisely the variable that is partially revealed by the actual decision and may evolve differently if the player had played (additional load could amplify the fragility state). Therefore the inference from observed associations to the stated counterfactual is invalid; the conclusion that 'resting did not causally prevent injury in those cases' is not warranted."
  },
  {
    "id": "T3-BucketD-022",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A rugby team notices an increase in missed tackles. The coach implements a 'remedial tackling school' (extra practice) for any player who misses more than 2 tackles in a game. At the end of the season, data shows that players who attended tackling school had a higher missed-tackle rate in subsequent games than those who never attended. The coach concludes the school is useless.",
    "claim": "Sending players to remedial tackling school (X) causes them to miss more tackles (Y).",
    "variables": {
      "X": "Assignment to Remedial Tackling School",
      "Y": "Missed Tackles in subsequent games",
      "Z": "Player defensive ability / poor form"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z (Poor ability) causes X (Assignment to school) and Z causes Y (Continued missed tackles). X is assigned based on prior Y (indication of Z).",
      "key_insight": "This is confounding by indication. The 'treatment' is assigned exclusively to the 'sick' (bad defenders). Comparing them to the 'healthy' (good defenders) will always make the treatment look bad unless you adjust for baseline ability.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Y(t-1) -> Z -> X(t) -> Y(t+1). Feedback loop.",
    "conditional_answers": "No. The players sent to school are the ones who are bad at tackling. They would likely have missed *even more* without the school. The proper comparison is their performance vs. their own baseline, or vs. bad tacklers who were NOT sent to school.",
    "label": "No",
    "correct_reasoning": "The claim fails due to Confounding by Indication (or Time-Varying Confounding). The assignment mechanism for X is dependent on Z (poor prior performance). Thus, the group X=1 is inherently comprised of weaker defenders than the group X=0. The observed higher error rate in Y is a reflection of Z, not the causal effect of X. To identify the effect, one must control for prior missed tackle rates."
  },
  {
    "id": "T3-BucketD-023",
    "pearl_level": "L1",
    "domain": "Sports",
    "scenario": "An NBA analytics intern analyzes one season of play-by-play data and finds that in-game scoring runs (e.g., 10–0 stretches) are strongly associated with the next two minutes of improved defensive performance by the team on the run (lower opponent field-goal percentage and fewer paint touches). The intern concludes that “momentum” from a scoring run causes better defense immediately afterward.",
    "claim": "The observed link between a team going on a scoring run and better defense in the next two minutes is not necessarily causal; it can be explained by a shared underlying factor like lineup/energy changes that drive both the run and the subsequent defensive metrics.",
    "variables": {
      "X": "Occurrence of a scoring run by a team (e.g., a 10–0 run within a short window)",
      "Y": "Defensive performance in the following two minutes (e.g., opponent FG% allowed, opponent paint touches, forced turnovers)",
      "Z": "Lineup/energy shift (e.g., a key defensive substitution, opponent fatigue, or a tactical change) that affects both the chance of a run and subsequent defense"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Omitted Variable",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z -> X and Z -> Y, creating an association between X and Y even if X has no direct causal effect on Y.",
      "key_insight": "At Pearl L1, association alone cannot distinguish 'momentum causes defense' from a backdoor path where a hidden tactical/lineup factor causes both the run and better defense.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z at t0 (substitution/tactical adjustment/opponent fatigue) increases the probability of X during t0–t1 (scoring run) and also improves Y during t1–t2 (next two minutes defense).",
    "conditional_answers": "Answer if the analyst only has observational play-by-play and does not measure lineup/tactics/fatigue: treat the claim as valid skepticism about causation at L1 due to omitted-variable confounding.",
    "label": "Yes",
    "correct_reasoning": "We are at Pearl Level 1 (association), so we are only licensed to talk about statistical dependence, not effects of interventions. The data show an association between X (a scoring run) and Y (better defense afterward). However, a plausible causal graph is Z -> X and Z -> Y, where Z is an omitted factor such as a defensive lineup change, a timeout adjustment, or opponent fatigue. Under this structure, the X–Y association can arise entirely from the open backdoor path X <- Z -> Y, even if there is no direct causal arrow X -> Y. Therefore, the intern’s causal story ('momentum causes better defense') is not justified from association alone, and it is valid to conclude that the observed relationship is not necessarily causal and may be confounded by Z."
  },
  {
    "id": "T3-BucketD-024",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "An NBA team pilots a new 'high-intensity closeout' defensive scheme for part of the season. The coaching staff evaluates the scheme by comparing opponents' 3-point percentage in games where the scheme was used versus games where it was not. They then run a regression that also controls for the team's recorded 'defensive effort score' (a wearable/vision-based metric capturing sprint distance, closeout speed, and contest frequency during the game). The regression shows the scheme has no effect (or even a slightly harmful effect) on opponents' 3P%, so the staff concludes the scheme doesn't work.",
    "claim": "Because the scheme's coefficient becomes near zero (or positive) after controlling for defensive effort score, implementing the high-intensity closeout scheme does not reduce opponents' 3-point percentage.",
    "variables": {
      "X": "Implementing the high-intensity closeout defensive scheme in a game (yes/no)",
      "Y": "Opponents' 3-point shooting percentage in that game",
      "Z": "Defensive effort score during the game (wearable/vision-based intensity metric)"
    },
    "annotations": {
      "trap_type": "Confounder–Mediator Error",
      "trap_subtype": "Mediator Adjustment Error",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "X affects Z (scheme increases defensive effort/closeout intensity), and Z affects Y (higher effort reduces opponents' 3P%). There may also be additional backdoor paths into X (e.g., opponent strength or schedule), but the key mistake is conditioning on Z, a mediator on the causal path from X to Y.",
      "key_insight": "Controlling for a mediator (defensive effort) blocks part (or all) of the causal effect of the scheme, so the adjusted regression estimates a 'direct effect' that is not the total effect and can be misleading.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: Coach chooses scheme X for the game plan. t1: Scheme changes in-game behavior and intensity Z (more closeouts/contests). t2: Opponent shot quality and makes change, producing Y (3P%).",
    "conditional_answers": "Answer if the goal is the total effect of adopting the scheme in real games: do NOT adjust for Z; instead adjust for true pre-treatment confounders (e.g., opponent shooting quality, lineup health, rest, home/away). Answer if the goal is the controlled direct effect of the scheme holding effort fixed: then adjusting for Z is relevant, but that is a different estimand than 'does the scheme work overall?'.",
    "label": "No",
    "correct_reasoning": "The claim is flawed because it treats an estimate conditioned on Z as evidence about the causal effect of X on Y. In the assumed data-generating process, Z is downstream of X: the scheme X is designed precisely to increase closeout intensity and contest frequency Z, which in turn reduces opponents' 3P% Y. Conditioning on Z blocks the mediated pathway X -> Z -> Y, removing the very mechanism through which X is expected to work. Therefore, the regression coefficient of X after adjusting for Z does not identify the total causal effect of intervening on X; it targets a direct effect of X not through Z (and may even flip sign depending on residual pathways and measurement noise). To evaluate whether implementing the scheme reduces opponents' 3P% in practice, one must estimate the total effect of do(X), which requires avoiding mediator adjustment and instead blocking only pre-treatment backdoor confounding into X and Y. Hence, concluding 'the scheme doesn't work' from a model that controls for defensive effort is a mediator adjustment error at Pearl Level 2."
  },
  {
    "id": "T3-BucketD-025",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A professional soccer club considers introducing a high-intensity interval training (HIIT) block during preseason. Analysts compare players who were assigned to HIIT versus those kept on a moderate conditioning plan and find that HIIT-assigned players have higher in-season injury rates. The head coach concludes HIIT causes injuries and wants to ban it. However, the club’s performance staff note that assignment to HIIT was not random: players with lower baseline aerobic fitness and higher body-fat percentage were preferentially assigned to HIIT to catch them up.",
    "claim": "If the club intervenes to assign all players to the HIIT preseason block (instead of the moderate plan), the injury rate will increase.",
    "variables": {
      "X": "Preseason conditioning assignment (HIIT block vs moderate conditioning plan)",
      "Y": "In-season soft-tissue injury incidence (e.g., hamstring/groin strains within first 12 matchweeks)",
      "Z": "Baseline fitness/risk profile used for assignment (e.g., VO2max, body-fat %, prior soft-tissue injury history)"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Unblocked Backdoor",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z affects both X and Y: baseline fitness/risk (Z) influences assignment to HIIT (X) and independently increases injury risk (Y). There may also be a direct effect X->Y, but the observational association is biased unless the backdoor path X<-Z->Y is blocked.",
      "key_insight": "The observed higher injury rate among HIIT-assigned players is driven by their worse baseline risk profile; after blocking the backdoor via Z, the causal effect of assigning HIIT to everyone can be estimated and need not be harmful.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z measured at t0 (start of preseason) influences X at t1 (conditioning assignment). X at t1 affects load exposure through t2 (preseason). Y realized at t3 (in-season weeks 1–12).",
    "conditional_answers": "Answer is Yes if Z is fully measured and adjusted (or assignment is randomized) such that the backdoor path X<-Z->Y is blocked; otherwise the causal claim cannot be supported from the raw association.",
    "label": "Yes",
    "correct_reasoning": "We are asked about an intervention: do(X=HIIT for all) versus do(X=moderate). The naive comparison P(Y|X=HIIT) vs P(Y|X=moderate) is not causal because X is confounded by Z: players with poorer baseline fitness and higher prior-injury risk are more likely to be assigned HIIT (X<-Z), and the same Z increases injury risk (Z->Y). This opens an unblocked backdoor path X<-Z->Y, so the observational association can show higher injuries under HIIT even if HIIT is neutral or beneficial. Under Pearl Level 2, the causal estimand is P(Y|do(X=x)), which can be identified by blocking the backdoor with Z (assuming Z is pre-treatment and sufficiently captures the assignment drivers): P(Y|do(X=x)) = sum_z P(Y|X=x, Z=z)P(Z=z). If, after proper adjustment for Z (or randomization), the estimated interventional risk is higher under HIIT for the same Z-distribution, then the claim 'assigning HIIT to all increases injuries' is valid. Thus the correct causal reasoning supports the claim under the stated backdoor-blocking condition, making the claim a valid L2 intervention statement rather than an association-based mistake."
  },
  {
    "id": "T3-BucketD-026",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "An NBA analytics staff evaluates a new in-game “momentum timeout” rule: whenever the opponent goes on an 8–0 run, the coach must call a timeout immediately. The team piloted this rule for half a season. In retrospective data, games in which the coach called a momentum timeout show worse point differential over the next 5 possessions than games with no momentum timeout. The staff concludes the rule is harmful and recommends abandoning it.",
    "claim": "Calling a momentum timeout (X) causes the team to perform worse in the next 5 possessions (Y), so the momentum-timeout rule should be scrapped.",
    "variables": {
      "X": "Calling a momentum timeout immediately after an opponent 8–0 run (pilot rule applied in-game)",
      "Y": "Team point differential over the next 5 possessions after the run/timeout window",
      "Z": "Severity of the negative game state that triggers the timeout: underlying opponent surge intensity (e.g., defensive breakdowns, fatigue, foul trouble, hot shooting) that both prompts the timeout and predicts continued short-term underperformance"
    },
    "annotations": {
      "trap_type": "Reverse Causation",
      "trap_subtype": "Reactive Intervention",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "Z (surge severity) increases the likelihood of X (timeout is called) and independently worsens Y (next-possessions differential). Observed association between X and Y is driven by the fact that X is deployed in response to deteriorating outcomes already in motion (incipient Y).",
      "key_insight": "The timeout is not assigned exogenously; it is a reactive intervention triggered by an ongoing collapse. Without modeling the trigger process (Z) and the pre-timeout trajectory, the post-timeout comparison conflates the effect of the timeout with the effect of the underlying surge that caused it.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: Opponent run begins and underlying surge severity Z intensifies; t1: Coach calls momentum timeout X because the run is occurring; t2: Next 5 possessions outcome Y reflects both the lingering effect of Z and any true causal effect of X.",
    "conditional_answers": "If timeouts were randomly mandated at the same game states (same score margin, time, lineup, foul trouble, and pre-run trajectory) regardless of surge severity, then a causal estimate of X on Y could be identified; under the observational pilot, the negative association is not evidence of harm.",
    "label": "No",
    "correct_reasoning": "The claim treats the observed post-timeout underperformance as the causal effect of calling the timeout. But X is a reactive intervention: it is triggered by an adverse, fast-moving game process. Formally, the trigger severity Z is a common cause of both X and Y: Z -> X (coaches call timeouts when the run is severe) and Z -> Y (severe runs tend to persist because they reflect fatigue, matchup problems, foul trouble, or opponent hot shooting). Therefore the backdoor path X <- Z -> Y is open, so P(Y|do(X)) is not identified by P(Y|X) in the pilot data. Moreover, because the run is already underway at t0, part of what is measured in Y is the continuation of that same deterioration that caused X, making the naive comparison especially biased against timeouts. The correct conclusion is only that timeouts are more likely to be called in situations that are already going badly, not that calling a timeout causes worse subsequent performance."
  },
  {
    "id": "T3-BucketD-027",
    "pearl_level": "L1",
    "domain": "Sports",
    "scenario": "A basketball analytics blog analyzes 200 NBA games and reports that teams that call an early timeout (within the first 6 minutes) have a higher probability of winning than teams that do not. The blog concludes that taking an early timeout is a winning strategy and recommends coaches “burn one early” after any small run by the opponent.",
    "claim": "Calling an early timeout increases a team's chance of winning the game.",
    "variables": {
      "X": "Calling an early timeout within the first 6 minutes of the game",
      "Y": "Winning the game (binary win/loss)",
      "Z": "Early-game latent game state (e.g., unexpected opponent run, foul trouble, injury scare, matchup exploit discovered, pregame plan mismatch) that both triggers the timeout decision and predicts eventual win probability"
    },
    "annotations": {
      "trap_type": "Reverse Causation",
      "trap_subtype": "Outcome-driven Selection",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z (early latent game state) influences X (early timeout) and also influences Y (win probability); additionally, coaches' expectations about Y based on early signals feed into the decision to call X, creating outcome-driven selection into the 'early timeout' group.",
      "key_insight": "The timeout is not randomly assigned; it is chosen in response to early signals that already change the expected likelihood of winning, so the observed association X–Y can reflect reactive decision-making rather than a causal effect of timeouts.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z at t0 (first few minutes: runs, foul trouble, matchup reads) affects X at t0 (timeout called) and also affects Y at t1 (final result). Coaches also form an updated belief about Y at t0 from Z, and that belief helps determine X at t0.",
    "conditional_answers": "If early timeouts were effectively randomized conditional on the early-game state Z (or if Z were fully measured and adjusted for), then a remaining positive association could support the claim. If Z is unmeasured or only partially captured (score margin alone), the association is consistent with reverse causation/outcome-driven selection and does not identify a causal effect.",
    "label": "Ambiguous",
    "correct_reasoning": "At Pearl Level 1 we are only given an association between X (early timeout) and Y (winning). The claim is causal, but the observed correlation can be generated by a reverse-causation/selection story: coaches call X because early information Z makes them update expectations about Y (e.g., they see a dangerous mismatch, foul trouble, or a tactical error) and react. Since Z also affects Y directly (those early conditions change win probability), the group with X=1 is not comparable to the group with X=0. Without knowing whether Z is fully observed and whether the comparison is made within levels of Z (or a valid design that breaks the dependence between X and Z), the direction and magnitude of the causal effect of X on Y are not identifiable from the association alone. Therefore the causal conclusion may be true or false, but the evidence described is insufficient, so the correct label is Ambiguous."
  },
  {
    "id": "T3-BucketD-028",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A soccer club pilots an AI-driven training-load system. The system flags players as 'high risk' based on recent fatigue markers and micro-injury reports, and the coaching staff responds by reducing those players' weekly high-intensity running (HIR) volume and giving them extra recovery sessions. At season’s end, the performance department compares injury rates between players who received load reductions versus those who did not, and finds the load-reduction group had more soft-tissue injuries. The club concludes the AI load-reduction policy causes injuries and considers abandoning it.",
    "claim": "Reducing high-intensity running volume for flagged players (X) increases the probability of soft-tissue injury (Y), so the AI-driven load-reduction policy is harmful.",
    "variables": {
      "X": "Intervention: coach-imposed reduction in weekly high-intensity running volume / extra recovery assigned after the AI flags a player",
      "Y": "Outcome: subsequent soft-tissue injury incidence over the next 4–8 weeks (e.g., hamstring strain)",
      "Z": "Time-varying confounder: evolving latent injury risk/fatigue status (captured partially by soreness, prior minor strains, sleep debt, match congestion) that both triggers load reduction and independently increases injury risk"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "Z(t) (fatigue/latent injury risk) influences both X(t) (load reduction decision) and Y(t+1) (injury). Past Y(t) and micro-injuries feed into future Z(t+1) and also into future X(t+1). Thus treatment assignment is reactive to a time-evolving state that is itself affected by prior outcomes and prior training exposure.",
      "key_insight": "Because coaches intervene more when risk is already high, naive comparisons of treated vs untreated conflate the effect of the intervention with the underlying escalating risk process; standard adjustment can also fail if it conditions on post-treatment risk states affected by earlier treatment.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: baseline fitness/history -> Z0. t1: match congestion/soreness updates Z1; staff applies X1 (reduce HIR) in response to Z1. t2: micro-injury or recovery updates Z2 (partly affected by X1); staff applies X2 based on Z2. t3: injury Y3 occurs depending on Z2, X1, X2, and exposures.",
    "conditional_answers": "Answer if you (incorrectly) treat the observed treated-vs-untreated difference as causal: you would say X increases Y. Answer if you properly account for time-varying confounding (e.g., with a marginal structural model / g-formula using correct treatment and censoring models): the harmful conclusion is not supported; the direction could reverse or become null once Z(t) is handled appropriately.",
    "label": "No",
    "correct_reasoning": "The claim is flawed because it treats an observed association under a reactive policy as the causal effect of an intervention. Here X is not randomly assigned: coaches reduce load precisely when Z is high. Z is a time-varying confounder that both (i) causes X at each decision point (high-risk players are more likely to be assigned load reduction) and (ii) causes Y (high-risk players are more likely to be injured regardless of what the staff does). Therefore the backdoor path X <- Z -> Y is open, and the treated group is selected to be intrinsically higher risk even before considering any effect of X. Moreover, Z evolves over time and is itself influenced by prior training and minor injury events; past outcomes and exposures affect future treatment decisions, creating treatment-confounder feedback. Naively comparing injury rates between those who received load reduction and those who did not estimates a mixture of (a) baseline and evolving risk differences and (b) any causal effect of X, so the sign of the difference cannot be interpreted as the sign of the causal effect. To identify the causal effect of implementing the load-reduction policy, one must model the sequential decision process and appropriately adjust for Z(t) without inducing bias from conditioning on post-treatment variables (e.g., via g-methods). Hence the conclusion that the policy is harmful does not follow from the reported comparison."
  },
  {
    "id": "T3-BucketD-029",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "An NBA team pilots an AI-driven in-game substitution policy. The model recommends earlier substitutions (shorter stints) when a player’s real-time fatigue score crosses a threshold. Coaches follow the policy, and the analytics department reports that games with earlier substitutions have a lower late-game defensive rating (better defense) than games with longer stints. A skeptic argues this is just because coaches substitute early when the opponent is weaker or when the team is already controlling the game. The team proposes a causal estimate: what would happen to late-game defense if they intervened to enforce earlier substitutions, regardless of game context?",
    "claim": "If the team intervenes to enforce earlier substitutions (shorter stints) for starters, late-game defensive performance will improve on average, even after properly adjusting for pre-substitution game state and player quality.",
    "variables": {
      "X": "Intervention: enforce earlier substitutions / shorter stints for starters (e.g., cap continuous minutes per stint, triggered by fatigue threshold) during the first three quarters",
      "Y": "Outcome: late-game defensive performance (e.g., opponent points per 100 possessions in the last 6 minutes, or late-game defensive rating)",
      "Z": "Pre-intervention confounders: baseline defender quality and matchup difficulty; plus time-varying game state measured before the substitution decision (score margin, opponent lineup strength, pace, foul trouble, and pre-substitution fatigue score)"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "Z (player quality, matchup difficulty, and pre-substitution game state/fatigue) affects both X (coach chooses earlier substitutions) and Y (late-game defense). Additionally, past fatigue and game state influence substitution timing, and substitution timing influences subsequent fatigue and later game state, creating time-varying confounding that must be handled with a sequential (g-formula / MSM) adjustment rather than a single regression.",
      "key_insight": "The causal effect of enforcing earlier substitutions is identifiable at L2 if we adjust only for pre-decision (history) variables that jointly drive substitution choices and late-game defense, using a longitudinal causal approach that respects time order; doing so blocks the backdoor paths without conditioning on post-treatment variables.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: baseline player quality/matchup difficulty set; t1: early-game possessions generate fatigue and game state; t2: substitution decision X made using fatigue/game state history; t3: substitution changes subsequent fatigue and lineup continuity; t4: late-game defense Y realized.",
    "conditional_answers": "Answer is Yes if the analysis uses only pre-substitution history (including time-varying fatigue and score/matchup before each decision) and applies an appropriate longitudinal adjustment (e.g., g-computation or marginal structural models) to address time-varying confounding; the claim would become Ambiguous/No if it instead controls for post-substitution mediators like minutes played after the decision, fourth-quarter fatigue after the policy, or lineup continuity that are themselves affected by X.",
    "label": "Yes",
    "correct_reasoning": "We are asked about an L2 interventional quantity: the average change in late-game defense Y under an enforced substitution policy do(X=earlier stints) versus do(X=longer stints). In the observational data, X is not randomized: coaches choose substitution timing based on a history of variables Z that include baseline defender quality/matchup difficulty and time-varying pre-decision game state and fatigue. Those same Z variables also causally influence Y, so the naive association between X and Y mixes the causal effect with backdoor paths X <- Z -> Y. However, the claim is that the causal effect remains after properly adjusting for pre-decision Z. Under the stated causal structure, if we condition (sequentially) on the full pre-substitution history at each decision point—i.e., the variables that the coach used and that also predict late-game defense—then the backdoor paths from X to Y are blocked without conditioning on variables caused by X. Because fatigue and game state are time-varying confounders affected by earlier play and affecting later substitution decisions, a single cross-sectional adjustment can be biased; but a longitudinal identification strategy (g-formula/MSM with inverse probability weights) correctly accounts for this time-varying confounding. Given that the claim explicitly requires such proper adjustment and respects temporal ordering (only pre-decision Z), the interventional effect of enforcing earlier substitutions is identifiable and the conclusion that do(X) improves Y is a valid causal claim in this setup."
  },
  {
    "id": "T3-BucketD-030",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A baseball team instructs hitters to increase their 'launch angle' (swing uppercut) to hit more home runs. Analytics compares hitters who adopted the new swing vs. those who didn't. They run a regression controlling for 'Exit Velocity' (how hard the ball is hit) to isolate the effect of the angle. They find that after controlling for Exit Velocity, the new swing results in *fewer* hits. They recommend scrapping the swing change.",
    "claim": "Increasing launch angle (X) causes worse batting performance (Y) because the effect is negative when controlling for Exit Velocity (Z).",
    "variables": {
      "X": "Adopting High Launch Angle Swing",
      "Y": "Batting Performance (Home Runs/Hits)",
      "Z": "Exit Velocity (Speed of ball off bat)"
    },
    "annotations": {
      "trap_type": "Confounder–Mediator Error",
      "trap_subtype": "Mediator Adjustment Error",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "X (Swing change) -> Z (Exit Velocity) -> Y (Home Runs). Mechanics changes often sacrifice contact quality (Z) to get angle (X). Z is a mediator.",
      "key_insight": "If the new swing causes players to hit the ball softer (lowers Z), that is part of the causal effect. Controlling for Z asks 'What is the effect of the angle if they hit it just as hard?', which ignores the trade-off inherent in the mechanics.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "X adopted t0 -> Z observed on hits -> Y recorded.",
    "conditional_answers": "No. The total effect of X on Y must allow Z to vary. If X lowers Z, and low Z lowers Y, then X lowers Y *through* Z. Controlling for Z blocks the mechanism.",
    "label": "No",
    "correct_reasoning": "This is a Mediator Adjustment Error. The swing change (X) likely affects how hard the ball is hit (Z). Z is on the causal path X -> Z -> Y. By controlling for Z, the analysts are estimating the Direct Effect (effect of angle holding power constant). However, if the new swing mechanically reduces power, the Total Effect (which includes the loss of power) is the relevant metric for the policy decision. The analysis blocks the negative pathway, potentially misrepresenting the real-world outcome, or finding a 'direct' effect that doesn't matter if the power loss is inevitable."
  },
  {
    "id": "T3-BucketD-031",
    "pearl_level": "L3",
    "domain": "Sports",
    "scenario": "A tennis player develops mild wrist soreness during a tournament week. The coach decides to skip the optional pre-match heavy topspin practice session and instead does only light hitting and mobility work. The player wins the match but later that night the wrist pain flares and the player withdraws from the next round. A commentator claims the coach's decision to skip heavy topspin practice caused the withdrawal because the wrist 'was going to flare anyway' and the player 'should have kept the usual routine' to maintain match sharpness. The team asks a performance analyst a counterfactual question: for this specific player and week, would the player still have withdrawn if the coach had not skipped the heavy topspin practice session?",
    "claim": "If the coach had not skipped heavy topspin practice (X=1 instead of X=0), the player would not have withdrawn the next day (Y would have been 0).",
    "variables": {
      "X": "Coach decision to skip heavy topspin practice before the match (X=0 skip; X=1 do the session as usual)",
      "Y": "Player withdraws from the next-round match due to wrist pain flare (Y=1 withdraw; Y=0 does not withdraw)",
      "Z": "Latent wrist tissue vulnerability/inflammation trajectory and pain tolerance that week (unobserved, affects both the coach's decision and the probability of next-day flare/withdrawal)"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Cross-world Confounder",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z influences X (coach reacts to perceived soreness/vulnerability) and Z influences Y (underlying inflammation drives flare/withdrawal). The counterfactual query compares Y under X=1 vs X=0 for the same individual, but Z is not held fixed across worlds because Z itself is partially inferred/selected based on observed actions and symptoms.",
      "key_insight": "For an individual-level counterfactual, you cannot conclude the effect of changing X without a model of how the unobserved vulnerability Z would have been in the alternative world; using observed soreness/decision as evidence about Z creates cross-world confounding.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: underlying wrist vulnerability/inflammation Z develops and is partially observed as soreness; t1: coach chooses X (skip or not) based on perceived risk; t2: player competes; t3: wrist flare evolves overnight; t4: withdrawal Y is decided next day.",
    "conditional_answers": "Answer is identifiable only if (i) Z is measured well enough (e.g., imaging/biomarkers + standardized pain reports) to be conditioned on, or (ii) there is a credible exogenous source of variation in X (e.g., random assignment of practice protocol, or a scheduling shock unrelated to Z), or (iii) a validated structural model links practice load to next-day flare while specifying how Z evolves under each X.",
    "label": "Ambiguous",
    "correct_reasoning": "The claim is a counterfactual statement about the same player in two possible worlds: one where X=0 (skip practice, observed) and one where X=1 (do practice, unobserved). The problem is that the coach's action X is not assigned independently; it is chosen in response to perceived soreness and risk, which are manifestations of an underlying vulnerability Z. That same Z also causally increases the probability of a next-day flare and withdrawal Y. Therefore, observing X=0 provides evidence that Z was high in the actual world (the coach skipped because risk seemed elevated). When we ask what would have happened under X=1, we implicitly need to know what Z would have been in that alternative world, but Z is unobserved and also partly 'diagnosed' from the very decision X and symptoms that occurred. This is cross-world confounding: the distribution of Z relevant to the counterfactual world cannot be recovered from the factual world without additional assumptions or measurements. Consequently, we cannot logically determine whether Y would have been 0 under X=1; it could be that doing heavy topspin practice would have worsened the flare (increasing Y), or that maintaining routine would have reduced stiffness and prevented withdrawal (decreasing Y), or that Z was so severe that Y would occur regardless. Without identifiability conditions (measured Z, exogenous variation in X, or a structural model), the counterfactual claim is not warranted, hence the correct label is Ambiguous."
  },
  {
    "id": "T3-BucketD-032",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "An NBA team introduces an in-game tablet-based shot-selection assistant that recommends taking more corner 3s and fewer mid-range pull-ups. The assistant is rolled out mid-season and is used more heavily when the team is trailing late in games. The analytics department estimates the assistant's causal effect by comparing points per possession (PPP) in possessions where the assistant was used vs. not used, controlling for the current score margin and time remaining. They find that assistant use is associated with lower PPP and conclude the tool hurts offense, recommending it be abandoned.",
    "claim": "If the team forces players to use the shot-selection assistant (X) on possessions, it will reduce points per possession (Y), so the assistant should be discontinued.",
    "variables": {
      "X": "Mandated use of the in-game shot-selection assistant on a possession",
      "Y": "Offensive points per possession on that possession (or the next set of possessions in the same late-game segment)",
      "Z": "Game state and coaching response dynamics: trailing/clock pressure and defensive intensity that both increase assistant use and reduce scoring efficiency"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "Time-varying game state Z_t (score margin, time remaining, opponent defensive pressure) affects both X_t (assistant use) and Y_t (PPP). Also, past outcomes Y_{t-1} and past choices X_{t-1} update Z_t (teams trail more after missed shots; opponents adjust coverage after observed shot mix), creating treatment-confounder feedback where Z_t is itself affected by prior X and Y.",
      "key_insight": "Controlling for a time-varying game state that is simultaneously a confounder and is influenced by prior outcomes/treatments can bias L2 causal effect estimates; without a properly specified dynamic causal model (e.g., g-methods), the sign of the estimated effect is not identified from the described analysis.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: Early possessions yield outcomes Y_{t0} that influence score margin/urgency Z_{t1}. t1: Z_{t1} increases likelihood of assistant use X_{t1} (coach uses it more when trailing). t1: Z_{t1} also directly depresses Y_{t1} via opponent defensive intensity and end-of-clock shot quality. t2: Observed shot mix under X_{t1} changes opponent adjustments, affecting Z_{t2} and subsequent Y_{t2}.",
    "conditional_answers": "Ambiguous: If assistant use were randomized within comparable game states (or identified via a valid instrument or a correct longitudinal causal method with measured Z over time), the causal effect could be estimated; under the current observational comparison with naive adjustment for score/time, the direction and magnitude of the intervention effect remain unidentified.",
    "label": "Ambiguous",
    "correct_reasoning": "We are asked to evaluate an interventional claim: what would happen to Y if we set X=1 (mandated assistant use) versus X=0. The observed association between X and Y is not sufficient because X is assigned adaptively in response to the evolving game state. Specifically, Z_t (trailing, clock pressure, opponent defensive intensity) is a backdoor confounder for the effect of X_t on Y_t because it causally influences both assistant use and scoring efficiency. However, Z_t is not a baseline confounder: it is updated by prior outcomes and prior treatments (missed shots and earlier assistant-driven shot mix change the score margin and defensive adjustments). Therefore, conditioning on Z_t in a standard regression can either (i) fail to block the relevant backdoor paths created by treatment-confounder feedback, or (ii) introduce bias by adjusting for a variable on a causal pathway from earlier X to later Y (and by opening paths through variables affected by prior treatment). Because the described analysis does not specify a correct longitudinal identification strategy (e.g., sequential ignorability with full measurement of Z history and appropriate g-computation/IPW/MSMs), we cannot deduce the sign of E[Y|do(X=1)]-E[Y|do(X=0)] from the reported negative association. Hence the conclusion that the assistant 'hurts offense' under intervention is not warranted, but neither can we assert the opposite without additional design/assumptions; the correct label is Ambiguous."
  },
  {
    "id": "T3-BucketD-033",
    "pearl_level": "L3",
    "domain": "Sports",
    "scenario": "An NBA analytics intern claims that a veteran guard's late-game three-point percentage is lower in games where the coach \"shortens the rotation\" (plays starters heavier minutes). The intern concludes the heavy-minutes strategy causes the veteran to shoot worse late. As supporting evidence, they point to games where the coach shortened the rotation and the veteran shot poorly in the last 5 minutes. They then make a counterfactual statement: in those same games, if the coach had not shortened the rotation, the veteran would have shot better late.",
    "claim": "In the games where the coach shortened the rotation, the veteran guard would have had a higher late-game three-point percentage if the coach had not shortened the rotation.",
    "variables": {
      "X": "Coach shortens the rotation (starters play heavier minutes) in a given game",
      "Y": "Veteran guard's last-5-minutes three-point percentage in that game",
      "Z": "Game state pressure and opponent strength in that game (e.g., close score, elite defense, high leverage possessions), which affects both the coach's decision and shot difficulty"
    },
    "annotations": {
      "trap_type": "Selection Bias",
      "trap_subtype": "Counterfactual Conditioning",
      "difficulty": "Easy",
      "subdomain": "Sports",
      "causal_structure": "Z -> X and Z -> Y; additionally, analysts implicitly condition on high-leverage late-game situations where the veteran is on the floor (a post-treatment selection linked to both X and Y). The counterfactual compares worlds while holding fixed a selected subset of possessions that would differ under do(X).",
      "key_insight": "The counterfactual is conditioned on a post-selection event (observed late-game possessions with the veteran taking threes) that would not be the same if the rotation were different, so the comparison mixes different sets of games/possessions across worlds.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: Z (close game/strong opponent) realized -> t1: coach chooses X (shorten rotation) -> t2: fatigue/shot difficulty and lineup context determine which late possessions occur -> t3: Y (late-game 3P%) observed only on the realized set of late possessions.",
    "conditional_answers": "Answer is No if the counterfactual is meant within the same observed late-game possessions (conditioning on them). It could become Ambiguous/estimable only if we redefine Y as a well-defined game-level outcome under both policies (e.g., expected late-game 3P% over all possible possessions under each policy) and measure/adjust for Z with a valid causal model.",
    "label": "No",
    "correct_reasoning": "This is an L3 counterfactual claim: it asserts Y would be higher in the same games under do(X=0) than under the factual X=1. The reasoning fails because it conditions on a post-treatment selection: the observed late-game threes (and even the existence/number of such attempts) are partly downstream of X via minute allocation, fatigue, and lineup/possession structure. Under do(X=0), the set of late-game possessions in which the veteran attempts threes would generally change (different substitution patterns, different matchups, possibly different game leverage), so 'the veteran's last-5-minutes 3P% in those games' is not being compared on the same underlying sample across worlds. Formally, the claim implicitly compares Y in the factual world given S=1 (selected late-game attempt set) to Y in the counterfactual world while holding S fixed, i.e., a cross-world conditioning on a variable affected by X. That is counterfactual conditioning/selection bias: the event we condition on (the realized late-game shot set) is not invariant to the intervention. Therefore the stated counterfactual conclusion is not justified from the observed association, and the claim is flawed."
  },
  {
    "id": "T3-BucketD-034",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A Tour de France cycling team implements a power-output cap. Riders are told not to exceed 400 watts on climbs to preserve energy for the final week. Analysts find that on days where riders adhered to the cap, their climb times were slower than on days they exceeded the cap. They conclude the cap makes riders slower.",
    "claim": "Enforcing the power cap (X) causes slower climb times (Y) compared to letting riders push as hard as they want.",
    "variables": {
      "X": "Adherence to power cap (riding < 400W)",
      "Y": "Climb time",
      "Z": "Rider Fatigue / Illness (Time-varying)"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z (Fatigue) influences X (Riders adhere to the cap easily when they are too tired to push hard) and Z influences Y (Fatigue makes them slow). Conversely, when Z is low (fresh), riders ignore the cap (X=0) and go fast (Y low).",
      "key_insight": "Compliance with the cap is often involuntary; tired riders fall under the cap naturally. Comparing cap-adherent days to non-adherent days conflates strategy with physical capability.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z (fatigue) varies day to day. Z affects ability to exceed X.",
    "conditional_answers": "Ambiguous. Unless we know if the rider was *holding back* (active compliance) vs. *unable to push* (passive compliance due to fatigue), we cannot judge the policy.",
    "label": "Ambiguous",
    "correct_reasoning": "The observational comparison is confounded by Z (physical capacity). Riders are more likely to record 'capped' wattage numbers when they physically cannot push harder (high Z). High Z also causes slow times. Therefore, the data mixes 'strategic capping' with 'exhaustion.' To evaluate the cap, one must compare days where the rider *could* have pushed harder but didn't (do(X)) against days where they did push harder."
  },
  {
    "id": "T3-BucketD-035",
    "pearl_level": "L3",
    "domain": "Sports",
    "scenario": "An NBA analyst argues that a coach's mid-game timeout 'caused' a scoring run. In the actual game, the team was down 14, called a timeout, and then went on a 12–0 run. The analyst claims: 'If the coach had not called the timeout, the run would not have happened.' However, the coach tends to call timeouts precisely when the team is playing poorly and the opponent's momentum is high. The same underlying game state (fatigue, defensive breakdowns, opponent hot shooting) also predicts both the timeout and what would have happened next even without the timeout (mean reversion and opponent shot cooling).",
    "claim": "The timeout caused the 12–0 run; if the coach had not called the timeout, the run would not have happened.",
    "variables": {
      "X": "Calling a timeout at that moment (yes/no)",
      "Y": "Subsequent scoring run in the next ~3 minutes (e.g., net points in that window)",
      "Z": "Underlying game state at the moment of the timeout (opponent hot streak, defensive miscommunications, player fatigue, lineup matchups, and latent momentum/mean-reversion forces)"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Cross-world Confounder",
      "difficulty": "Easy",
      "subdomain": "Sports",
      "causal_structure": "Z influences both X (coach calls timeout when Z is bad) and Y (Z also drives near-future scoring dynamics/mean reversion). The claim implicitly compares Y under X=1 vs Y under X=0 while letting Z differ across those worlds.",
      "key_insight": "The counterfactual 'no timeout' world is not identical in Z to the actual world; Z is a cross-world confounder because the same latent game state that triggered the timeout also affects what would have happened next.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: Z (bad game state) realized; t0: coach chooses X=1 (timeout) because of Z; t1: Y (run in next minutes) occurs, partly because Z would have tended to revert regardless of X.",
    "conditional_answers": "If we could hold Z fixed at the same values across the X=1 and X=0 worlds (same fatigue, matchups, opponent shot quality) and randomize timeout timing, then we could estimate whether the timeout changes Y; without that, the observed run after timeouts is not evidence of causation.",
    "label": "No",
    "correct_reasoning": "The claim is a counterfactual statement about Y(X=1) versus Y(X=0) for the same game situation, but it treats the actual post-timeout run as if it identifies Y(X=0) by simple imagination. In the data-generating story, Z causes X (timeouts are called when Z is unfavorable) and Z also causes Y (the same unfavorable state and its natural dynamics, including regression/mean reversion, affect subsequent scoring). Therefore Z is a confounder for the causal effect of X on Y. At Pearl Level 3, the key error is cross-world confounding: the analyst compares the observed Y under X=1 in a world where Z was severe enough to trigger a timeout to an implicit Y under X=0 in a different world where Z would not have been the same. Because Z is not held fixed across these worlds, the statement 'without the timeout, the run would not have happened' does not follow. The run could have occurred even under X=0 due to Z-driven reversion, so the causal conclusion is invalid."
  },
  {
    "id": "T3-BucketD-036",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "An NBA team introduces a 'no mid-range shots' policy for its offense, instructing players to take only 3-pointers or shots at the rim. A front-office analyst estimates the policy effect by comparing points per possession (PPP) before vs. after the policy but also controls for 'average shot distance' in the regression to 'account for shot selection.' The analyst concludes the policy has no effect once shot distance is controlled.",
    "claim": "Controlling for average shot distance is inappropriate because it is a mediator caused by the no-mid-range policy; the correct estimate of the policy's total causal effect on PPP should not adjust for shot distance.",
    "variables": {
      "X": "Implementing a 'no mid-range shots' offensive policy (coach-mandated shot selection constraint)",
      "Y": "Team offensive efficiency (points per possession) over subsequent games",
      "Z": "Average shot distance / shot mix (share of 3PA and rim attempts), which is directly changed by the policy and transmits its effect to efficiency"
    },
    "annotations": {
      "trap_type": "Confounder–Mediator Error",
      "trap_subtype": "Mediator Adjustment Error",
      "difficulty": "Easy",
      "subdomain": "Sports",
      "causal_structure": "X -> Z -> Y (policy changes shot mix/shot distance, which affects PPP). Potential baseline team quality can affect both Z and Y, but Z is also downstream of X once the policy is implemented.",
      "key_insight": "If the estimand is the total effect of the policy on PPP, adjusting for a post-treatment mediator (shot distance/shot mix) blocks the causal pathway and can bias the estimated effect toward zero or even flip its sign.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: Team adopts policy X. t1: Players change shot mix/average shot distance Z. t2: Changed shot mix alters PPP Y over games following adoption.",
    "conditional_answers": "Answer if the goal is total effect: do NOT control for Z. Answer if the goal is a controlled direct effect (holding shot mix fixed): then controlling/fixing Z is relevant, but that is a different causal question than 'Does the policy improve PPP?'.",
    "label": "Yes",
    "correct_reasoning": "The claim is valid because the question at Pearl Level 2 is an interventional one: compare Y under do(X=policy) versus do(X=no policy). In the causal graph, Z (average shot distance/shot mix) lies on the directed path from X to Y (X -> Z -> Y). Conditioning on Z when estimating the effect of X blocks this mediating path and therefore does not identify the total causal effect of the intervention; it instead targets something closer to a direct effect that excludes the mechanism through shot selection. Since the policy’s purpose is precisely to change shot selection, adjusting for Z removes the very channel through which X is expected to influence Y, producing an attenuated or null estimate even if the policy truly increases PPP. Therefore, to estimate the total effect of implementing the policy, one should not adjust for Z (a post-treatment mediator)."
  },
  {
    "id": "T3-BucketD-037",
    "pearl_level": "L3",
    "domain": "Sports",
    "scenario": "A tennis player tweaks their ankle in the second set. The coach considers retiring the player immediately versus letting them finish the match. Post-match, analysts argue about whether the player would have won if they had not retired, noting that the player retired only when the pain became severe.",
    "claim": "For this player, in the counterfactual world where they do not retire at that moment (X=play on), they would have been more likely to lose the match (Y=loss) than in the actual world where they retired (Y=recorded retirement), because playing on with a severe ankle tweak causally reduces performance.",
    "variables": {
      "X": "Decision at the retirement moment: play on instead of retiring (counterfactual intervention)",
      "Y": "Match result (win vs loss; with retirement treated as not winning the match)",
      "Z": "Ankle injury severity/pain level at the retirement moment (mechanism affecting both feasibility of playing and performance)"
    },
    "annotations": {
      "trap_type": "Selection Bias",
      "trap_subtype": "Counterfactual Conditioning",
      "difficulty": "Easy",
      "subdomain": "Sports",
      "causal_structure": "Z (injury severity) affects both X (whether the player can/chooses to continue) and Y (probability of winning). Conditioning the counterfactual question on the observed fact of retirement selects high-Z cases, which would bias naive comparisons between 'retired' and 'played on' worlds.",
      "key_insight": "You cannot infer the counterfactual 'would have won if they played on' by looking at outcomes among players who did play on, because the observed retirement event is itself selection on severe injury; however, within this specific case, severe injury provides a mechanistic reason that forcing X=play on would decrease performance and thus increase loss probability.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: ankle tweak occurs; t1: pain/severity Z escalates; t2: retirement decision X is made; t3: if X=play on, performance deteriorates leading to higher chance of Y=loss; if X=retire, match ends immediately as not a win.",
    "conditional_answers": "Answer if you condition on 'the player retired': you are selecting on high Z, so comparing to players who continued is invalid. Answer if you ask the individual counterfactual with Z fixed at its observed severe level: intervening to force X=play on would (via Z→performance) raise the chance of losing relative to the actual retired outcome.",
    "label": "Yes",
    "correct_reasoning": "This is a Level-3 (counterfactual) claim about the same player: compare Y under the actual world (retire at t2) versus Y under the counterfactual intervention do(X=play on) at t2. The main trap is counterfactual conditioning: the fact that the player retired is not an exogenous label but a selection event driven by Z (injury severity), and Z also causally affects Y through impaired movement and shot quality. Therefore, population-level comparisons like 'players who retire would have lost anyway' are biased. However, the claim here is an individual counterfactual grounded in the observed mechanism: given the player’s severe Z at t2, forcing X=play on keeps the severe impairment in place and extends exposure to it, which causally reduces performance and increases the probability of Y=loss relative to the actual world where the match ends immediately without a win. Thus, under the stated causal structure (Z→X and Z→Y, and X affects Y through continued play under severe Z), the claim is valid."
  },
  {
    "id": "T3-BucketD-038",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A professional soccer club is considering an intervention: mandating that all players complete a standardized 12-minute post-match cold-water immersion (CWI) protocol after every match for the next 10 weeks. The performance staff has observational data showing that players who used CWI in the past had fewer missed training sessions the following week. However, CWI use was not randomly assigned: staff were more likely to recommend CWI to players who reported high muscle soreness and had high recent match load. The club proposes a causal estimate of the policy by comparing weeks with mandated CWI vs weeks without mandated CWI, using their historical monitoring data. They also plan to adjust for prior-week soreness and prior-week match load when estimating the effect of the mandate on missed training sessions.",
    "claim": "If the club mandates cold-water immersion after matches (X), it will causally reduce missed training sessions the next week (Y), provided we adjust for prior-week soreness and prior-week match load (Z) to block the backdoor paths.",
    "variables": {
      "X": "Mandated post-match cold-water immersion protocol (policy intervention applied to all players after each match)",
      "Y": "Number of missed training sessions in the subsequent 7 days (availability/short-term injury or recovery-related absence)",
      "Z": "Prior-week muscle soreness and prior-week match load (pre-intervention covariates that influence both the decision to use recovery modalities and subsequent missed sessions)"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Unblocked Backdoor",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z -> X and Z -> Y; X -> Y. Historically, staff recommendation (and player uptake) of CWI was influenced by prior soreness/load (Z), which also predicts missed sessions (Y). Under a mandate, X is set externally, and adjusting for pre-intervention Z blocks the backdoor path X <- Z -> Y.",
      "key_insight": "To estimate the causal effect of an intervention, you must block backdoor confounding using variables that precede the intervention; here, prior soreness/load are valid adjustment variables because they cause both treatment assignment and the outcome but are not caused by the mandate.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z measured at t0 (prior week) influences both the probability of applying/complying with recovery modalities (X at t1, post-match) and missed training sessions (Y at t2, following week). The mandate sets X at t1 irrespective of Z, but Z still predicts Y at t2 and must be adjusted for when using non-randomized historical comparisons.",
    "conditional_answers": "Answer if the adjustment set includes only pre-intervention variables (e.g., prior soreness/load) and excludes post-intervention variables (e.g., next-day soreness): then the causal claim is supported. If the analysis instead adjusts for post-match next-day soreness (a mediator) or conditions on compliance (only players who actually completed CWI), the causal claim would no longer be guaranteed.",
    "label": "Yes",
    "correct_reasoning": "We are asked about an interventional claim: the effect of setting X (mandating CWI) on Y (missed training sessions). In the historical data, X is confounded because Z (prior-week soreness and match load) causally affects both X (staff recommend/players choose CWI more when Z is high) and Y (high Z increases risk of fatigue-related absence). This creates a backdoor path X <- Z -> Y that would bias any naive association between X and Y. However, Z is measured before the intervention and is not caused by X, so conditioning on Z is a valid backdoor adjustment. Under the causal graph Z -> X, Z -> Y, and X -> Y, adjusting for Z blocks the only backdoor path while leaving the causal path X -> Y intact. Therefore, the postulated comparison approximates the interventional quantity E[Y|do(X=1)] - E[Y|do(X=0)] (within the assumptions of no unmeasured confounding beyond Z and correct measurement), making the claim that mandating CWI causally reduces missed sessions valid in this setup."
  },
  {
    "id": "T3-BucketD-039",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A soccer club reviews last season and notices that matches where the head coach made an early substitution (before the 60th minute) had a lower win rate than matches with no early substitution. An analyst proposes a policy: \"Stop making early subs; early subs cause losses.\" The club wants to treat this as an intervention rule for next season.",
    "claim": "If the coach intervenes to avoid early substitutions, the team will win more matches.",
    "variables": {
      "X": "Coach makes an early substitution (before minute 60) vs. does not",
      "Y": "Match outcome (win vs. not win)",
      "Z": "In-game adversity prior to minute 60 (e.g., conceding first, red card, key player injury, being tactically outmatched/low expected goals early)"
    },
    "annotations": {
      "trap_type": "Reverse Causation",
      "trap_subtype": "Reactive Intervention",
      "difficulty": "Easy",
      "subdomain": "Sports",
      "causal_structure": "Z worsens early match state and simultaneously triggers the coach to make an early substitution (Z -> X) and also directly reduces the chance of winning (Z -> Y). The observed association X -> Y is largely due to the coach reacting to Z, not X causing Y.",
      "key_insight": "The substitution is often a response to already-bad conditions; intervening to prevent the response does not remove the underlying adversity that drives losses.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z at t0–t1 (first 60 minutes: conceding, red card, injury) increases likelihood of X at t1 (early sub), while Z also decreases Y at t2 (final result).",
    "conditional_answers": "Answer if the question is purely observational: Early substitutions are associated with lower win rates. Answer if the question is interventional (do(X=0)): Not enough evidence; the naive claim that do(X=0) increases wins is not justified because X is reactive to Z.",
    "label": "No",
    "correct_reasoning": "The claim is a causal statement about an intervention: it asserts that setting X=0 (no early substitutions) will increase Y (wins). But the data pattern described is compatible with a reactive-intervention structure where Z (early adversity) causes both X and Y: Z -> X and Z -> Y. In that case, the observed P(Y|X=1) < P(Y|X=0) does not identify the causal effect P(Y|do(X=1)) vs P(Y|do(X=0)). When the coach makes an early substitution, it is typically because Z has already made the match harder to win; thus X is a symptom/response to Z rather than the root cause of losing. Intervening to prevent early substitutions (do(X=0)) would not eliminate Z, so it need not improve Y and could even worsen it by removing a corrective action. Therefore the conclusion that avoiding early substitutions will cause more wins is flawed under this causal structure, so the label is No."
  },
  {
    "id": "T3-BucketD-040",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "An NBA team considers a policy change: mandate that every player completes a 15-minute dynamic warm-up routine immediately before entering the game. In prior seasons, players who reported doing dynamic warm-ups tended to have fewer soft-tissue injuries, but those players were also generally more disciplined and less injury-prone. The performance staff proposes evaluating the causal effect of the mandate using a randomized rollout: on randomly selected game-days, the team enforces the warm-up mandate for all active players; on other game-days, players follow the usual optional routine. The staff then compares next-day soft-tissue injury incidence between mandate days and non-mandate days.",
    "claim": "Because the warm-up mandate is randomly assigned by game-day, comparing injury rates between mandate days and non-mandate days identifies the causal effect of the mandate on next-day soft-tissue injuries (for the roster under this policy).",
    "variables": {
      "X": "Mandatory pre-entry 15-minute dynamic warm-up on a given game-day (enforced vs not enforced)",
      "Y": "Next-day soft-tissue injury occurrence (e.g., hamstring/calf strain) among active players",
      "Z": "Player baseline injury risk / discipline / conditioning that previously confounded observational warm-up–injury associations"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Unblocked Backdoor",
      "difficulty": "Easy",
      "subdomain": "Sports",
      "causal_structure": "Previously, Z -> X and Z -> Y created a backdoor path X <- Z -> Y in observational data. The randomized game-day rollout makes X independent of Z, blocking the backdoor without needing to measure Z.",
      "key_insight": "At L2, the question is about the effect of doing X (an intervention). Random assignment of X breaks the confounding link from Z, so the simple difference in outcomes estimates the causal effect under the rollout.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z (baseline risk) is set before the season (t-1). X (mandate enforced) is assigned at game-day t0. Y (soft-tissue injury) is measured at t1 (next day).",
    "conditional_answers": "Answer is valid if (i) the game-day assignment of X is truly random and enforced for all active players, (ii) injuries are measured consistently on mandate and non-mandate days, and (iii) there is no systematic interference across days that changes exposure classification (e.g., players secretly doing the routine on non-mandate days in a way correlated with injury risk).",
    "label": "Yes",
    "correct_reasoning": "We want the causal estimand E[Y | do(X=1)] - E[Y | do(X=0)]. In observational data, the association E[Y | X=1] - E[Y | X=0] is biased because Z (baseline injury risk/discipline) affects both X and Y, leaving the backdoor path X <- Z -> Y open. Under the proposed design, X is assigned by random game-day rollout, so X ⟂ Z by design; equivalently, the intervention severs any arrow into X from Z. Therefore the backdoor path is blocked, and the post-intervention comparison of Y between mandate and non-mandate days identifies the causal effect of X on Y for this team under the rollout conditions (up to standard assumptions like consistent measurement and adherence). Hence the claim is valid."
  },
  {
    "id": "T3-BucketD-041",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A soccer club introduces an AI-driven hydration protocol during preseason: players must drink a prescribed electrolyte mix before and after every training session, enforced by staff check-ins. The club wants to know if implementing this protocol reduces soft-tissue injuries during the first half of the season. Analysts compare injury rates between the season with the protocol and the previous season, and they also consider adjusting for 'training load' (GPS distance and high-speed runs) because load strongly predicts injury.",
    "claim": "To estimate the causal effect of implementing the hydration protocol on soft-tissue injury risk, we should NOT adjust for training load if the protocol changes training load; instead, estimate the total effect of the protocol on injuries without conditioning on training load (or use mediation methods if decomposing pathways).",
    "variables": {
      "X": "Implementation of the enforced AI-driven hydration protocol (club policy: on vs off)",
      "Y": "Soft-tissue injury incidence in the first half of the season (e.g., hamstring/quad/calf strains per player-month)",
      "Z": "Training load during the season (GPS-based volume/intensity), which can be affected by the protocol and also affects injury risk"
    },
    "annotations": {
      "trap_type": "Confounder–Mediator Error",
      "trap_subtype": "Mediator Adjustment Error",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "X -> Z -> Y, and X -> Y (possible direct pathway). Z is a mediator (post-policy) rather than a pre-policy confounder; conditioning on Z blocks part of the causal effect and can also open bias if Z has unmeasured causes that also affect Y.",
      "key_insight": "At Pearl L2, we ask about an intervention do(X). If Z is downstream of X, adjusting for Z changes the estimand from the total effect to a controlled direct effect and can introduce post-treatment bias; thus, 'controlling for everything predictive' is not valid for causal estimation.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: club sets hydration policy X. t1: hydration affects recovery/readiness, altering training load Z (players tolerate more/less load). t2: accumulated load influences injury occurrence Y during the half-season.",
    "conditional_answers": "Answer if the goal is the total effect of X on Y: do not adjust for Z. Answer if the goal is the direct effect of X not mediated by load: then a mediation framework is required, and simply regressing Y on X and Z is generally insufficient without additional assumptions about unmeasured causes of Z and Y.",
    "label": "Yes",
    "correct_reasoning": "We are asked for the causal effect of an intervention, i.e., the contrast between Y under do(X=1) (hydration protocol implemented) and Y under do(X=0) (no protocol). In the stated structure, training load Z occurs after the policy is enacted and is causally influenced by X (X -> Z). Therefore Z is a mediator on at least one causal path from X to Y (X -> Z -> Y). Conditioning on Z would block this mediated path and thus would not identify the total causal effect of X on Y; it would instead target a different estimand (a controlled direct effect, holding Z fixed), which is not what the club asked for. Moreover, because Z is post-treatment, adjusting for it can induce post-treatment bias if there exist unmeasured determinants of Z that also affect Y (common in sports: coaching intensity, player fitness, tactical changes), which would create a backdoor path X -> Z <- U -> Y once we condition on Z. Hence, for estimating the total effect of implementing the hydration protocol on injuries, Z should not be adjusted for; if decomposition into mediated vs direct pathways is desired, one must use appropriate causal mediation assumptions and methods rather than naive adjustment."
  },
  {
    "id": "T3-BucketD-042",
    "pearl_level": "L3",
    "domain": "Sports",
    "scenario": "A tennis player rolls an ankle in the first set. The on-court physio applies a tight ankle tape job and the player finishes the match, but later aggravates the injury and misses the next tournament. Commentators argue about the counterfactual: if the physio had not taped the ankle, would the player have avoided the later aggravation? The complication is that without taping, the player might have retired immediately, which would have changed the amount of continued load on the joint and the subsequent rehab timeline.",
    "claim": "If the physio had not taped the ankle (X=0), the player would not have aggravated the injury later (Y=0).",
    "variables": {
      "X": "Ankle taping by the physio after the initial ankle roll (treatment at t0)",
      "Y": "Later injury aggravation leading to missed next tournament (outcome at t2)",
      "Z": "Match continuation/playing time after the ankle roll (mediator affected by X) and underlying injury severity/pain tolerance (latent factor affecting both continuation and aggravation)"
    },
    "annotations": {
      "trap_type": "Confounder–Mediator Error",
      "trap_subtype": "Mediator Fixing Error",
      "difficulty": "Easy",
      "subdomain": "Sports",
      "causal_structure": "X influences Z (taping affects whether/how long the player continues and how they move). Z influences Y (more play on an injured ankle increases aggravation risk). Latent severity/pain tolerance also influences Z and Y, and may influence whether taping is attempted/accepted.",
      "key_insight": "The counterfactual mixes worlds by implicitly holding the match course (continued play) fixed while changing taping; but continuation is itself causally downstream of taping, so the claim cannot be evaluated without specifying what happens to Z under X=0.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: ankle roll occurs; X (taping) applied immediately after. t1: decision/ability to continue and total playing time Z realized during the match. t2: aggravation and tournament withdrawal Y realized days later.",
    "conditional_answers": "Answer if we assume the player would have continued for the same duration and intensity even without taping (i.e., fix Z to its observed value): then removing taping could plausibly reduce stability and increase aggravation risk, making the claim likely false. Answer if we assume without taping the player would have retired early (Z would drop substantially): then removing taping could reduce load and plausibly lower aggravation risk, making the claim possibly true. Without specifying Z under X=0, the counterfactual is not identified.",
    "label": "Ambiguous",
    "correct_reasoning": "This is a Level-3 counterfactual query about Y under the intervention do(X=0) for the same individual who was actually taped (X=1) and later aggravated (Y=1). The claim implicitly compares the actual world (X=1, Z=z1, Y=1) to a hypothetical world where X=0 while leaving unstated what happens to Z. But Z is a mediator: X -> Z -> Y. In counterfactual terms, asserting 'no taping implies no aggravation' often smuggles in a cross-world requirement like Y_{X=0, Z=z1}=0, which fixes the downstream mediator Z to its observed value from the X=1 world. That is a mediator-fixing error because the match continuation/playing time would generally change when taping is removed. Since Y depends strongly on Z (continued load) and Z itself would differ under X=0, the sign of Y_{X=0} relative to Y_{X=1} is not determined from the description. Additional information (e.g., the player’s likely retirement behavior without taping, severity, pain tolerance, and how taping changes gait/instability) is required to specify Z_{X=0} and thus identify Y_{X=0}. Therefore the claim cannot be judged true or false from the given scenario and is labeled Ambiguous."
  },
  {
    "id": "T3-BucketD-043",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A soccer club tests a new in-game hydration protocol: at the 60th minute, the staff mandates that any winger who has covered at least 6.8 km by that time must take a 90-second sideline hydration break (a planned stoppage during a substitution window). Analysts want the causal effect of mandating this hydration break on late-game hamstring injuries in the final 30 minutes. A naive analysis that compares players who did vs. did not take the break is misleading because the break is triggered by how hard the player has already worked, and prior workload also raises injury risk. The club instead randomizes the mandate among eligible wingers (those who meet the 6.8 km threshold) on each match: half are assigned the hydration break and half are told to continue. The club still uses the threshold for eligibility (for practical reasons), but within eligibility the assignment is randomized.",
    "claim": "Among eligible wingers (those who have covered at least 6.8 km by minute 60), mandating a 90-second hydration break at minute 60 reduces the probability of a hamstring injury in minutes 60–90, and this causal effect can be identified by comparing injury rates between randomized mandate vs. no-mandate groups within the eligible set.",
    "variables": {
      "X": "Mandated hydration break at minute 60 (assigned vs. not assigned) among eligible wingers",
      "Y": "Hamstring injury occurrence during minutes 60–90 of the match",
      "Z": "Pre-60-minute workload/intensity (e.g., distance covered, high-speed runs) which determines eligibility and directly affects late-game injury risk"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "Z (pre-60 workload) increases Y (late injury risk) and also influences treatment assignment in observational data via eligibility/coach decisions; by restricting to eligibility and randomizing X within that stratum, the backdoor path X <- Z -> Y is blocked within the eligible set, permitting identification of the causal effect of X on Y for eligibles.",
      "key_insight": "When treatment assignment is driven by a time-varying predictor that is itself affected by earlier play and predicts the outcome, naive comparisons are confounded; randomization (or otherwise blocking the backdoor) within the risk-set at the decision time turns the question into a valid L2 intervention effect for the eligible population.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z at t0–t60 (workload accrued) affects both (i) eligibility/assignment mechanism for X at t60 and (ii) injury risk Y at t60–t90; X occurs at t60 and can causally affect Y at t60–t90 by reducing dehydration/fatigue accumulation after t60.",
    "conditional_answers": "Answer is valid if: (i) assignment of X is truly randomized within the eligible set and not overridden by coaches/players, (ii) injuries are measured the same way in both arms, and (iii) analysis conditions on eligibility defined strictly by pre-t60 data. If assignment is not randomized (e.g., staff selectively mandates breaks for players who look strained), the claim would become flawed due to unblocked backdoor confounding by Z and other latent fatigue indicators.",
    "label": "Yes",
    "correct_reasoning": "We are asked an L2 question: the effect of intervening to mandate a hydration break (X) on late-game hamstring injury (Y). In observational comparisons, X is confounded because pre-60 workload (Z) both raises injury risk and makes the break more likely (via the eligibility rule and/or staff discretion), creating an open backdoor path X <- Z -> Y. However, the club’s design explicitly intervenes by randomizing X among players who are eligible, i.e., after conditioning on the risk-set defined by Z>=threshold using only pre-intervention information. Within this eligible stratum, randomization makes X independent of Z (and of other pre-t60 causes of Y), so the backdoor path is blocked and P(Y|do(X), eligible) is identified by the difference in observed injury rates between randomized arms. Therefore the claim is valid as a causal conclusion for the eligible population, because the intervention assignment mechanism severs the dependence between X and the time-varying confounder Z at the decision time."
  },
  {
    "id": "T3-BucketD-044",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "An MMA gym prescribes a strict 'ketogenic cut' diet to all fighters 4 weeks before a fight. An internal study shows that fighters who successfully adhered to the diet until weigh-in day won 65% of their fights, while those who broke the diet won only 40%. The gym mandates the diet for everyone, claiming it causes wins.",
    "claim": "Adhering to the ketogenic diet (X) causes a higher win probability (Y).",
    "variables": {
      "X": "Prescription of Ketogenic Diet",
      "Y": "Winning the fight",
      "Z": "Adherence/Compliance to the diet (The variable actually measured)"
    },
    "annotations": {
      "trap_type": "Collider",
      "trap_subtype": "Conditioning on Compliance",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "X (Prescription) -> Z (Adherence). U (Self-discipline/Mental toughness) -> Z and U -> Y. Conditioning on Z (comparing adherers vs non-adherers) selects for U.",
      "key_insight": "Fighters who stick to a miserable diet (Z) likely possess high discipline (U). Discipline also helps them train harder and win (Y). The diet might be useless, but the 'adherer' group is full of disciplined fighters.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "X at t0. Z measured over t0-t30. Y at t31.",
    "conditional_answers": "No. The intention-to-treat (ITT) effect (comparing everyone assigned the diet vs everyone assigned a normal diet) is the only valid metric. The complier analysis is biased by the 'discipline' confounder.",
    "label": "No",
    "correct_reasoning": "The claim is based on a comparison of Compliers vs. Non-Compliers. Compliance (Z) is a collider. It is influenced by the assignment (X) and by unobserved traits like Discipline (U). Discipline also affects Winning (Y). By conditioning on Z, we induce a correlation between X and U. The 'Adherer' group is enriched with highly disciplined fighters, so their win rate reflects their discipline, not necessarily the biological benefit of the keto diet."
  },
  {
    "id": "T3-BucketD-045",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "An NBA team considers reducing back-to-back minutes for its star guard after a stretch of nagging hamstring tightness. The performance staff proposes an intervention: cap the player at 30 minutes on the second night of back-to-backs for the next 8 weeks. Analysts estimate the causal effect of this minutes-cap on subsequent soft-tissue injury incidence using observational game logs and medical reports, adjusting for the player's pre-cap hamstring tightness severity and recent workload. They explicitly do NOT adjust for the player's in-game peak sprint count during those capped games, because it is influenced by the minutes-cap and lies on the pathway from minutes to injury risk.",
    "claim": "If the team implements a minutes-cap (X) on back-to-back games, it will reduce the player's probability of a soft-tissue injury in the following 14 days (Y), and estimating this effect should adjust for pre-intervention injury risk/workload (Z) but not for post-cap sprint intensity, which is a mediator.",
    "variables": {
      "X": "Implementing a minutes-cap policy (e.g., max 30 minutes) on the second night of back-to-backs for the player",
      "Y": "Soft-tissue injury occurrence (or injury-days missed) within the next 14 days after a back-to-back game",
      "Z": "Pre-intervention injury risk and workload state (e.g., baseline hamstring tightness severity and cumulative minutes/acute:chronic workload ratio in the 2 weeks before the policy starts)"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z (baseline tightness/workload) affects both X (coaches choose to cap minutes when risk is high) and Y (injury). Additionally, prior workload and tightness evolve over time and influence future capping decisions; X affects in-game sprint intensity which then affects Y (mediated path).",
      "key_insight": "To answer an intervention question, block the backdoor from pre-intervention risk to both policy and injury, but do not condition on post-intervention mediators like sprint intensity; otherwise you distort the total causal effect of the minutes-cap.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z at t0 (pre-policy tightness/workload) -> X at t1 (minutes-cap decision for upcoming back-to-back) -> mediator at t1 (sprint intensity during capped game) -> Y at t2 (injury within 14 days). Also, Z at t0 influences Y at t2 directly, and evolving workload/tightness between t0 and t1 can influence both X and Y.",
    "conditional_answers": "Answer is valid if Z is measured strictly before the minutes-cap policy is applied (pre-intervention) and the analysis targets the total effect of X on Y (not a direct effect).",
    "label": "Yes",
    "correct_reasoning": "This is a Pearl L2 (intervention) question: we want the effect of doing X (imposing a minutes-cap) on Y (subsequent injury). In the underlying causal graph, Z (pre-intervention tightness/workload) is a common cause of both X and Y: coaches are more likely to cap minutes when the player is already at elevated risk, and elevated risk also increases injury probability. Therefore, without adjustment, the association between X and Y is confounded by an unblocked backdoor path X <- Z -> Y (and by time-varying versions of Z that affect future X and Y). Conditioning on appropriately pre-intervention measurements of Z blocks these backdoor paths and identifies the causal effect of the intervention. By contrast, sprint intensity during the capped game is causally downstream of X and lies on the pathway X -> (sprint intensity) -> Y; adjusting for it would remove part of the effect transmitted through that mechanism and would not estimate the total causal effect of X on Y. Hence the claim is valid: adjust for pre-intervention risk/workload (Z) to address time-varying confounding, and avoid adjusting for post-intervention mediators when the estimand is the total effect."
  },
  {
    "id": "T3-BucketD-046",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "An NBA team considers a policy change: mandate that every player completes a pregame mindfulness session (10 minutes guided breathing) to reduce turnovers. The analytics staff compares games where players actually attended the session versus games where they skipped it, and finds that attendees had fewer turnovers and higher assist-to-turnover ratios. The coach concludes the team should enforce mindfulness attendance because it causally reduces turnovers. However, attendance is not random: players are more likely to attend when they are already feeling focused and healthy, and less likely to attend when they are dealing with minor injuries, travel fatigue, or personal stress. Those same factors also directly affect turnovers.",
    "claim": "If the team mandates mindfulness attendance before games (X), turnovers will decrease (Y), because attendees historically have fewer turnovers.",
    "variables": {
      "X": "Mandated pregame mindfulness session attendance (intervention/policy to increase compliance)",
      "Y": "In-game turnovers (or assist-to-turnover ratio) during that game",
      "Z": "Player readiness state before the game (fatigue, minor injury status, stress, sleep/travel load) that affects both likelihood of attending and turnovers"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Unblocked Backdoor",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z -> X and Z -> Y, with a naive comparison of Y between X=1 (attended) and X=0 (skipped) interpreted as the causal effect of do(X).",
      "key_insight": "The observed association between mindfulness attendance and fewer turnovers is partly (or entirely) explained by pregame readiness, which both increases attendance and reduces turnovers; without blocking this backdoor path, the estimated policy effect is biased.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z at t0 (readiness before arriving at arena) influences X at t0 (whether the player attends the session) and also influences Y at t1 (turnovers during the game).",
    "conditional_answers": "Answer if (i) attendance is randomized or mandated with full compliance regardless of readiness, or (ii) Z is fully measured and appropriately adjusted for (and no other unmeasured backdoors exist): then the causal effect of do(X) on Y could be estimated; otherwise the historical attendee vs non-attendee gap is not a causal effect.",
    "label": "No",
    "correct_reasoning": "The claim confuses an observational contrast with an interventional effect. The staff computed something like E[Y|X=1] - E[Y|X=0], but the policy question is E[Y|do(X=1)] - E[Y|do(X=0)]. Because Z (pregame readiness) causally affects both X (likelihood of attending mindfulness) and Y (turnovers), there is an unblocked backdoor path X <- Z -> Y. Therefore, conditioning only on X leaves confounding: players attend more when Z is favorable, and favorable Z also lowers Y, creating a spurious benefit attributed to X. Mandating mindfulness changes X but does not, by itself, equalize Z across games; thus the observed association cannot justify the causal conclusion that enforcing mindfulness will reduce turnovers. To support the claim, one would need random assignment/encouragement or valid adjustment for Z (and other backdoor variables) to identify the effect of do(X)."
  },
  {
    "id": "T3-BucketD-047",
    "pearl_level": "L1",
    "domain": "Sports",
    "scenario": "An NFL analyst studies fourth-down decision making. They find that teams that attempt to convert on 4th-and-short (rather than punting) have a significantly higher win rate than teams that punt. A commentator argues that 'aggression wins games' and every team should go for it on 4th down regardless of context. However, teams usually only go for it when they are already in favorable field position or playing against a weak defense.",
    "claim": "Going for it on 4th-and-short causes a higher probability of winning the game.",
    "variables": {
      "X": "Attempting a 4th-down conversion (Aggressive playcalling)",
      "Y": "Winning the game",
      "Z": "Field position and score margin (Teams go for it when they are close to the endzone or desperately chasing points; context drives both X and Y)"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Confounding by Indication",
      "difficulty": "Easy",
      "subdomain": "Sports",
      "causal_structure": "Z (favorable field position) increases the probability of X (coach decides to go for it) and independently increases the probability of Y (scoring/winning). The association is confounded by the state of the game.",
      "key_insight": "Aggressive playcalling is often a luxury of good field position or a necessity of desperation; analyzing the outcome without conditioning on the game state (Z) creates a spurious association.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z at t0 (ball on opponent's 30-yard line) -> X at t0 (go for it) -> Y at t1 (win).",
    "conditional_answers": "Ambiguous. If we compare 4th-down attempts vs punts holding field position, score, and time constant, the 'aggression' advantage often shrinks or disappears.",
    "label": "Ambiguous",
    "correct_reasoning": "At L1, we observe an association between X and Y. However, the decision X is heavily influenced by Z (field position and game context). Z is a common cause: good field position makes converting easier (increasing X) and winning easier (increasing Y). Therefore, the raw positive association cannot be interpreted as a universal causal rule that 'aggression causes winning' without adjusting for Z."
  },
  {
    "id": "T3-BucketD-048",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "An NBA team pilots a new “high-intensity defensive scheme” (more full-court pressure, more aggressive closeouts). Coaches decide in-game whether to deploy it based on how the last few possessions went and who looks fatigued. The analytics department evaluates the scheme by comparing points allowed per possession in stretches when the scheme was used versus not used, then recommends using it more because the team allows fewer points during scheme-on stretches.",
    "claim": "If the team intervenes to use the high-intensity defensive scheme more often, it will causally reduce points allowed per possession.",
    "variables": {
      "X": "Deploying the high-intensity defensive scheme on a given possession/segment (scheme-on vs scheme-off)",
      "Y": "Points allowed per possession (defensive efficiency) during the subsequent possessions/segment",
      "Z": "Time-varying game state and player condition that affects both scheme choice and defense outcomes (e.g., recent opponent scoring run, current lineup matchups, foul trouble, fatigue, and prior defensive stops/allowed points)"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "Z_t (recent possessions, opponent momentum, lineup/fatigue) influences X_t (scheme deployed now) and also directly influences Y_t (points allowed next). Additionally, past outcomes Y_{t-1} feed into Z_t and into X_t (coaches react to what just happened), creating treatment-confounder feedback over time.",
      "key_insight": "Because coaches adaptively choose the scheme in response to evolving game conditions that also affect defense, the observed association between scheme-on and fewer points can be driven by time-varying confounding and feedback; a naive comparison does not identify the effect of intervening to increase scheme usage.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t-1: prior defensive outcome (Y_{t-1}) and game context update fatigue/matchups (Z_t). t: coaches choose scheme (X_t) based on Z_t and recent outcomes. t+1: points allowed realized (Y_t), which then updates the next context Z_{t+1} and future scheme decisions X_{t+1}.",
    "conditional_answers": "If X were randomized at each segment (or assigned by an exogenous rule independent of Z_t), then the observed difference in Y could be interpreted causally. If one correctly models and adjusts for the full time-varying confounding affected by prior outcomes (e.g., via marginal structural models / g-formula with appropriate history), a causal effect might be estimable; without that, the claim is not justified.",
    "label": "No",
    "correct_reasoning": "The claim is a Level-2 (interventional) statement about do(X): it asserts that increasing scheme usage would reduce points allowed. However, the evaluation compares Y between observed scheme-on and scheme-off stretches, which estimates an associational contrast P(Y|X) rather than the interventional contrast P(Y|do(X)). The key obstruction is time-varying confounding with feedback: the coaches set X_t using Z_t (fatigue, lineup matchups, opponent run, foul trouble, and the immediately preceding defensive outcomes), and Z_t also affects Y_t. Moreover, prior outcomes Y_{t-1} influence future treatment assignment through Z_t (reactive coaching), so the confounder is itself partially a function of past outcomes and past treatments. This means the backdoor path X_t <- Z_t -> Y_t is open, and naive adjustment can also fail because parts of Z_t are treatment-affected history; conditioning incorrectly can induce bias (e.g., blocking causal pathways or creating collider structures in the longitudinal graph). Therefore, the observed lower points allowed during scheme-on stretches can arise because the scheme is deployed when conditions are already favorable for defense (or withheld when the defense is compromised), not because the scheme itself causes improvement. Without randomization or a valid longitudinal identification strategy that accounts for treatment-confounder feedback, the data do not support the causal conclusion, so the claim is flawed."
  },
  {
    "id": "T3-BucketD-049",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "An NBA team is considering an in-game coaching policy: whenever the opponent goes on a 6–0 run, the coach immediately calls a timeout. Analysts compare games with many 'run-triggered timeouts' to games with few and notice that teams calling more timeouts after runs often still lose. A staff member argues that timeouts are ineffective and should be reduced. The head analyst instead proposes estimating the causal effect of a *policy intervention*: force the coach to always call a timeout immediately after any 6–0 run (versus never calling a timeout for runs), using play-by-play data and a model that accounts for the game state that triggers timeouts.",
    "claim": "If the team intervenes to always call a timeout immediately after an opponent 6–0 run (X), the probability of losing the game (Y) will decrease, because the observed association between calling run-triggered timeouts and losing is driven by reactive intervention to worsening game states (Z).",
    "variables": {
      "X": "Timeout policy intervention: automatically call a timeout immediately after any opponent 6–0 run (vs. not calling a timeout for runs).",
      "Y": "Game outcome: probability of the team losing (or negative final point differential).",
      "Z": "Worsening game state that triggers timeouts: current score margin, opponent hot-shooting streak, lineup mismatch, fatigue, foul trouble, remaining time/possessions."
    },
    "annotations": {
      "trap_type": "Reverse Causation",
      "trap_subtype": "Reactive Intervention",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z -> X and Z -> Y, with X -> Y. The coach calls a timeout (X) in reaction to a bad/declining game state (Z), and that same Z also increases the chance of losing (Y). Naive comparisons confound the effect of X with Z.",
      "key_insight": "Because timeouts are triggered by deteriorating conditions, the raw correlation between timeouts and losing is not the causal effect; the causal question requires an intervention on the timeout policy while holding the triggering game state distribution comparable (i.e., block the backdoor path through Z).",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z at t0 (opponent run + unfavorable lineup/fatigue) increases the chance the coach calls timeout X at t0 and also increases losing Y at t2; X at t0 can causally affect Y at t2 by stopping the run and enabling adjustments.",
    "conditional_answers": "Answer if (i) timeouts are primarily called in response to negative momentum/game-state deterioration rather than randomly, and (ii) the analysis targets the effect of the *policy* 'call timeout after a 6–0 run' by adjusting for/conditioning on pre-timeout game state variables Z (or using a design like within-game matched segments / g-formula with time-varying state).",
    "label": "Yes",
    "correct_reasoning": "At Pearl Level 2 we ask an interventional question: what happens to Y under do(X=always call timeout after a 6–0 run) versus do(X=never call timeout for runs). The observed association P(Y|X) is not equal to P(Y|do(X)) because X is chosen reactively. Specifically, the worsening game state Z (score margin, fatigue, foul trouble, lineup mismatch, opponent shooting) causally increases the probability of calling a timeout (Z -> X) and also causally increases the probability of losing (Z -> Y). This creates an open backdoor path X <- Z -> Y, making timeouts look harmful in observational comparisons even if they help. Under an intervention that sets the timeout policy, X is no longer a downstream response to Z; to estimate the causal effect we must block the backdoor by adjusting for pre-timeout Z (or using an equivalent identification strategy for time-varying state). Once Z is controlled, the remaining effect corresponds to X -> Y (timeouts enabling rest and tactical adjustment), so it is valid that implementing the run-triggered timeout policy can reduce losing probability even when the naive correlation suggests otherwise."
  },
  {
    "id": "T3-BucketD-050",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "An NBA team considers a new in-game substitution policy: whenever a starter’s wearable shows 'high fatigue' (a threshold on recent high-intensity movement), the coach immediately subs the player out for a 2-minute rest. Analysts compare games where the policy was used frequently vs rarely and find that teams using it more often have lower fourth-quarter net rating. A causal analyst proposes estimating the effect of implementing the policy by adjusting for in-game fatigue level at each stoppage and prior score margin, using play-by-play and tracking data to emulate a target trial of 'sub now' vs 'keep in' decisions.",
    "claim": "If we model the decision to sub (X) as an intervention at each stoppage and adjust for time-varying fatigue (Z) and prior score margin (also part of Z) that affect both the substitution decision and later performance, then the estimated effect of the substitution policy on fourth-quarter net rating (Y) can identify the causal impact of implementing the policy, even though naive comparisons suggest it is harmful.",
    "variables": {
      "X": "Coach executes a fatigue-triggered substitution at a given stoppage (sub now vs keep player in) / implementation intensity of the substitution policy across the game",
      "Y": "Team fourth-quarter net rating (points per 100 possessions in Q4) or win probability added in the last 6 minutes",
      "Z": "Time-varying confounders: current player fatigue state from wearables and tracking; recent workload (minutes played, sprint count); current score margin and game context (pace, foul trouble) that influence both substitution decisions and later team performance"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "Z_t (fatigue/workload and score context) affects X_t (substitution decision) and Y (later Q4 performance); past X_{t-1} affects future Z_t (rest reduces fatigue), creating treatment-confounder feedback. Proper g-methods (e.g., marginal structural models) are needed to estimate the causal effect of intervening on X over time.",
      "key_insight": "Because fatigue and game context both drive substitutions and also drive later performance—and are themselves affected by earlier substitutions—naive adjustment or naive comparisons are biased. But with correct time-indexing and appropriate methods that account for treatment-confounder feedback, the causal effect of the substitution policy is identifiable from observational play-by-play under standard assumptions.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "At each stoppage t: Z_t (fatigue, score margin) is observed; coach chooses X_t (sub vs keep) at t0; this affects immediate rest and rotation, changing Z_{t+1} (fatigue and lineup quality) at t1; Y is realized in Q4 at t2. Earlier X_{t-1} also changes Z_t, so Z_t is both a confounder for X_t->Y and a mediator of X_{t-1}->Y.",
    "conditional_answers": "Answer is Yes if: (i) all relevant time-varying confounders Z_t (fatigue, workload, score context, foul trouble proxies) are measured before each decision point; (ii) positivity holds (both sub and keep decisions occur across the range of Z_t); (iii) consistency/SUTVA is reasonable at the decision-unit level (the defined intervention corresponds to the observed action); and (iv) a correct g-method (e.g., inverse-probability-of-treatment weighting for a marginal structural model or sequential g-computation) is used rather than conditioning on post-decision variables like 'minutes played after the stoppage'.",
    "label": "Yes",
    "correct_reasoning": "This is an L2 question because it asks about the effect of an intervention: forcing (or implementing) a substitution rule X rather than merely observing association. The naive comparison 'more fatigue-triggered subs -> worse Q4 net rating' is not causally interpretable because Z_t (fatigue and game context) is a time-varying common cause of both X_t and Y: coaches sub more precisely when fatigue is high or the game state is adverse, and those same conditions predict worse late-game performance. Moreover, there is treatment–confounder feedback: earlier substitutions X_{t-1} change later fatigue Z_t (rest reduces fatigue), so Z_t is simultaneously (a) a confounder for the current decision X_t -> Y and (b) a mediator of earlier decisions X_{t-1} -> Y. Therefore, standard regression that 'controls for fatigue' can block parts of the causal pathway and induce bias. However, if we emulate a sequential decision process and use g-methods that appropriately adjust for the full history of pre-decision confounders (the backdoor paths from Z_t to both X_t and Y) without conditioning on post-intervention variables, then the backdoor criterion is satisfied at each decision point and the interventional distribution P(Y | do(policy on X)) is identifiable. Under the stated measurement and positivity assumptions, the claim that this approach can recover the causal impact of implementing the substitution policy is valid."
  },
  {
    "id": "T3-BucketD-051",
    "pearl_level": "L3",
    "domain": "Sports",
    "scenario": "A tennis analyst reviews match logs and notices that when a top player receives an on-court medical timeout (MTO), they often end up losing the match. The analyst then makes a counterfactual claim about what would have happened in the same match without the MTO, arguing from the observed association between MTOs and losses.",
    "claim": "If the player had not taken the medical timeout (X=0), they would have been more likely to win the match (Y=Win) in that same match.",
    "variables": {
      "X": "Taking an on-court medical timeout (MTO) during the match (yes/no)",
      "Y": "Match outcome (win/loss)",
      "Z": "Underlying injury severity / acute physical limitation at the time the MTO is requested (latent or partially observed)"
    },
    "annotations": {
      "trap_type": "Selection Bias",
      "trap_subtype": "Counterfactual Conditioning",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z (injury severity) increases the probability of X (taking an MTO) and also decreases Y (chance of winning). The counterfactual query conditions on the realized match trajectory in which the player both (i) became injured enough to request an MTO and (ii) continued playing to finish the match, which selects on post-injury survival/continuation.",
      "key_insight": "The counterfactual 'same match, but no MTO' improperly holds fixed a selected world where the player was injured enough to request an MTO and still finished the match; conditioning on that survival/continuation event biases the comparison between worlds with and without X.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: Player starts match with baseline health. t1: Acute issue worsens (Z rises) during play. t2: Player requests MTO (X=1) conditional on Z and continuation. t3: Player either finishes match or retires (selection on continuation). t4: Final outcome recorded (Y).",
    "conditional_answers": "Answer if (a) we could randomize MTO availability/usage independent of injury severity Z, and (b) define Y to include retirement as a loss and avoid conditioning on finishing: then an interventional effect of forcing X=0 could be estimable; otherwise the counterfactual claim is not justified from the observed data.",
    "label": "No",
    "correct_reasoning": "The claim is a Level-3 counterfactual statement about the same match: it asserts Y_{X=0} > Y_{X=1} for the player in the realized world where X=1 occurred. But X is not an exogenous switch; it is a response to Z (injury severity), and Z also directly affects Y. Moreover, the analyst implicitly conditions on a post-injury selection event: we only observe completed matches in which the player both became injured enough to consider treatment and still continued to a recorded outcome (i.e., did not retire before the outcome is defined). This is counterfactual conditioning on survival/continuation, which is affected by Z and potentially by X (an MTO can enable continuation). Therefore, comparing the realized world (injured, took MTO, finished) to a hypothetical world where the player is held in the same realized match state but with X set to 0 is ill-posed: without the MTO the player might have retired earlier, changed effort, or altered subsequent points, so the conditioning event differs across worlds. Because the counterfactual is evaluated within a selected stratum that is not invariant under the intervention on X, the observed association between MTO and losing cannot support the conclusion that withholding the MTO would have increased win probability. The correct conclusion is that the data conflate injury-driven selection and treatment usage, so the counterfactual claim is not causally warranted."
  },
  {
    "id": "T3-BucketD-052",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A soccer club introduces a new high-intensity pressing scheme mid-season. The coaching staff compares matches where the team executed the scheme (high pressing intensity) versus matches where they did not (lower intensity), and finds that high pressing is associated with fewer goals conceded. They propose mandating the scheme in all matches to reduce goals conceded.",
    "claim": "Mandating the high-intensity pressing scheme (X) will causally reduce goals conceded (Y).",
    "variables": {
      "X": "Implementing/mandating a high-intensity pressing scheme (e.g., high PPDA pressure, high press triggers) in a match",
      "Y": "Goals conceded in the match (or expected goals against, xGA)",
      "Z": "Opponent strength and match state (e.g., facing weaker opponents and/or leading early), which influences both the likelihood of using high press and the goals conceded"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z (opponent strength/match state) affects X (pressing intensity choice) and Y (goals conceded). Additionally, early match events (part of Z) are affected by prior X and then feed back to future X and Y within the same match/season, creating time-varying confounding.",
      "key_insight": "Pressing intensity is often chosen reactively based on evolving match state and opponent quality; naive comparisons of matches (or periods) with high vs low press do not identify the effect of forcing the press because Z both drives the decision and predicts defensive outcomes.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: Pre-match opponent strength influences planned press intensity. t1: Early goal or red card changes match state (Z) and triggers adjustments in press intensity (X). t2: Adjusted press intensity affects chance creation against (Y) and also alters future match state (Z) via fatigue and transitions.",
    "conditional_answers": "Ambiguous: If pressing intensity were randomized (or assigned by an external rule) independent of opponent strength and evolving match state, the claim could be evaluated and might be true. If pressing is chosen more often when already leading or versus weaker opponents, the observed association likely overstates the causal benefit.",
    "label": "Ambiguous",
    "correct_reasoning": "At Pearl Level 2 we must evaluate the interventional claim do(X=high press) -> Y, not merely the association between X and Y in observed matches. Here, Z (opponent strength and match state) is a time-varying confounder: it causally affects the coach's decision to press (X) and also causally affects goals conceded (Y). Moreover, match state evolves during the match and is itself partially downstream of earlier pressing decisions, creating feedback where past X changes Z, and Z then changes future X and future Y. Because Z is not fully blocked by a valid adjustment set that respects time order (and because naive adjustment for post-treatment components of Z can induce bias), the observational comparison of high-press matches/periods to low-press matches/periods does not identify the causal effect of mandating the press. Therefore, with the information given, we cannot conclude the intervention will reduce goals conceded; the claim may be true or false depending on how pressing would be assigned under intervention and how Z is handled (e.g., via proper longitudinal methods like g-methods)."
  },
  {
    "id": "T3-BucketD-053",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A soccer club introduces a new “high-intensity pressing” training block during preseason. The performance analyst evaluates the program by comparing match results only among players who fully completed the block (attended >90% of sessions) versus players who did not complete it. The analyst reports that the program caused better match performance because the completers had higher average distance covered and a higher win rate in matches they started.",
    "claim": "Implementing the high-intensity pressing training block causes better match performance, since players who completed the block had higher distance covered and higher win rates than those who did not complete it.",
    "variables": {
      "X": "Assignment to the new high-intensity pressing training block (club implements it as the intended training intervention)",
      "Y": "Match performance (e.g., win rate in matches started, distance covered per 90, pressing actions per 90)",
      "Z": "Training completion/compliance status (whether the player attended >90% of sessions), which is influenced by both baseline fitness/motivation and early injury/fatigue"
    },
    "annotations": {
      "trap_type": "Collider",
      "trap_subtype": "Conditioning on Compliance",
      "difficulty": "Easy",
      "subdomain": "Sports",
      "causal_structure": "X affects Z (the intervention influences who can/does comply). Baseline fitness/motivation and early injury/fatigue also affect Z and directly affect Y. Conditioning on Z opens a non-causal path between X and Y via Z.",
      "key_insight": "Comparing outcomes only among compliers is not the same as estimating the causal effect of assigning the training; compliance is a collider affected by the intervention and by factors that also affect performance.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: Players have baseline fitness/motivation and latent injury risk. t1: Club assigns the pressing block (X). t2: Some players comply/complete (Z) depending on baseline traits and early fatigue/injury. t3: Match performance (Y) is realized.",
    "conditional_answers": "Answer if the question is 'Does completing the block predict better performance among those who completed it?': Yes, it may predict. Answer if the question is 'Does assigning the block improve performance for the squad (intention-to-treat)?': Cannot be concluded from the complier-only comparison.",
    "label": "No",
    "correct_reasoning": "The claim is flawed because it infers an intervention effect of X on Y from a comparison that conditions on Z (compliance/completion). In the causal graph, X -> Z, while unobserved baseline fitness/motivation and early injury/fatigue -> Z and also -> Y. Thus Z is a collider on the path X -> Z <- (baseline factors) -> Y. By restricting analysis to Z=1 (compliers), the analyst opens this backdoor path, inducing an association between X and the baseline factors, which then transmits to Y. Therefore the observed performance advantage among completers can be produced even if the pressing block assignment has no causal effect on match performance. To estimate the causal effect at Pearl Level 2, one should analyze assignment (intention-to-treat) without conditioning on compliance, or use appropriate causal methods (e.g., randomized assignment with IV/CACE under assumptions) rather than a complier-only comparison."
  },
  {
    "id": "T3-BucketD-054",
    "pearl_level": "L3",
    "domain": "Sports",
    "scenario": "An NBA team’s analytics group reviews a playoff series where their star guard played 44+ minutes in Games 1–3 and then suffered a hamstring strain late in Game 3, missing most of Game 4. Fans argue the coach “caused the injury” by overplaying him. The coach counters that the player would have been injured anyway because he was already carrying a tight hamstring, and the extra minutes were necessary to win earlier games. A counterfactual question is posed: in the closest world where the coach capped him at 34 minutes in Game 3, would he have avoided the hamstring strain and been available for Game 4?",
    "claim": "If the coach had limited the star guard to 34 minutes in Game 3 (X), he would not have strained his hamstring and would have played effectively in Game 4 (Y).",
    "variables": {
      "X": "Counterfactual coaching decision: cap the star guard at 34 minutes in Game 3 instead of playing 44+ minutes",
      "Y": "Counterfactual outcome: no hamstring strain by end of Game 3 and effective availability/performance in Game 4",
      "Z": "Unobserved, time-evolving tissue vulnerability and pain tolerance (micro-damage accumulation, neuromuscular fatigue, and player self-reporting accuracy) that both affects minutes played and injury risk"
    },
    "annotations": {
      "trap_type": "Selection Bias",
      "trap_subtype": "Counterfactual Conditioning",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "Z (latent vulnerability) influences both X (minutes/coach willingness to extend run) and Y (injury and next-game availability). Additionally, conditioning the counterfactual on the observed fact that an injury occurred in the actual world (Y=injury) implicitly selects worlds where Z was high, which distorts the comparison between do(X=34) and do(X=44+).",
      "key_insight": "The counterfactual is being evaluated conditional on an outcome-defined subset (the realized world where injury happened), but the relevant counterfactual distribution requires comparing worlds without conditioning on post-outcome information that is itself informative about latent vulnerability.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: pre-Game 3 latent micro-damage/vulnerability Z. t1: coach observes imperfect signals (player says he feels 'ok', game context) and sets minutes X. t2: within-Game 3 exertion/fatigue accumulates (partly downstream of X and Z). t3: hamstring strain realized (component of Y). t4: Game 4 availability/performance realized (component of Y).",
    "conditional_answers": "Ambiguous unless we specify (i) what information the coach used when choosing minutes (signals about Z), (ii) the causal effect of minutes on injury holding fixed pre-game Z (a well-defined intervention do(X)), and (iii) whether the counterfactual is meant unconditionally or conditional on the observed injury in the actual world. If we instead ask the unconditional causal effect of do(X=34) vs do(X=44+) on injury risk averaged over the pre-Game 3 population distribution of Z, it may be estimable with rich tracking/medical data and a valid identification strategy; but the specific statement 'given that he actually got injured, he would have been fine under X=34' requires cross-world assumptions about Z that are not identified from usual data.",
    "label": "Ambiguous",
    "correct_reasoning": "This is an L3 counterfactual claim about an individual player: it asserts Y_{X=34}=no-injury/effective-G4 in the actual case where we observed X=44+ and injury. The reasoning trap is counterfactual conditioning on an outcome-defined realized world. Observing that the player was injured provides information that the latent vulnerability Z was likely high in the actual world. But the claim implicitly compares the actual world (where Z is inferred high because injury occurred) to a hypothetical world under do(X=34) while keeping 'everything else the same'—which informally attempts to hold fixed the very latent factors that are only partially revealed by the injury. Formally, the quantity of interest resembles P(Y_{34}=0 | X=44+, Y=1) or a statement about Y_{34} for the specific unit given Y=1. This conditions on a post-treatment outcome (Y) that is downstream of both Z and X, selecting a subset of worlds/units with high Z and potentially inducing selection bias in the counterfactual comparison. Without a specified structural causal model linking Z, X, and Y (including how Z would evolve under different minutes and what the coach would have done given different signals), the counterfactual is not identified: multiple causal models can fit the observed facts yet disagree on whether Y_{34} would be 0 or 1. Therefore the claim cannot be labeled true or false from the given information; it remains ambiguous because it hinges on unobserved Z and cross-world assumptions about how the player’s vulnerability and exertion trajectory would have unfolded under the alternative minutes cap."
  },
  {
    "id": "T3-BucketD-055",
    "pearl_level": "L3",
    "domain": "Sports",
    "scenario": "A tennis federation reviews a star player who withdrew mid-match at a Grand Slam. The player had been on a new, aggressive serving program for 6 weeks. In the actual world, the player withdrew with shoulder pain and therefore logged fewer total serves and fewer high-velocity serves in that match. A commentator claims the new program caused the withdrawal because the player’s shoulder was overloaded. The federation asks a counterfactual question: 'If the player had not done the new serving program, would they still have withdrawn in that match?' Analysts attempt to answer using only matches where players did not withdraw (because those are the only matches with complete serve-tracking and post-match MRI data).",
    "claim": "If the player had not adopted the new aggressive serving program (X=0), they would not have withdrawn mid-match (Y=0), because among matches with complete tracking (i.e., non-withdrawals), players on the program show fewer withdrawals.",
    "variables": {
      "X": "Adoption of a new aggressive serving program in the 6 weeks before the match (yes/no)",
      "Y": "Withdrawal mid-match due to shoulder pain (yes/no)",
      "Z": "Latent shoulder fragility / pre-existing micro-tears and pain tolerance that both increase likelihood of adopting/being assigned the program (via coaches trying to 'fix' serve) and increase withdrawal risk; plus match completeness (having full tracking/MRI) as a post-outcome selection variable"
    },
    "annotations": {
      "trap_type": "Selection Bias",
      "trap_subtype": "Counterfactual Conditioning",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "Z (latent fragility) affects X (program adoption) and Y (withdrawal). Y also determines S (data completeness: full tracking/MRI available), and analysts condition on S=1 (non-withdrawals) when estimating the counterfactual Y_{X=0}. This creates counterfactual conditioning on a post-outcome selection variable and entangles identification of 'would have withdrawn' with the fact that withdrawal censors the data.",
      "key_insight": "The counterfactual 'would the player have withdrawn without the program' cannot be identified from data restricted to non-withdrawals because conditioning on survival/completion (S=1) selects on the outcome and changes the cross-world comparison needed for L3 questions.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: latent shoulder fragility and prior pain (Z) exists. t1: coaching/medical staff decide on aggressive serving program (X). t2: match begins; serving load accumulates. t3: shoulder pain escalates; withdrawal occurs (Y). t4: only if Y=0 do full serve-tracking and post-match MRI/physio assessments enter the dataset (S=1).",
    "conditional_answers": "Answer if (i) we had pre-match imaging and pain scores for all players regardless of withdrawal, (ii) random or quasi-random assignment of the serving program, and (iii) complete serve-load measurement even when a player withdraws (or a principled model for censoring): then we could estimate the causal effect of X on Y and answer the counterfactual more credibly. Answer if we instead define the estimand as 'withdrawal before match end' and ensure outcome ascertainment is complete for everyone; otherwise the counterfactual remains sensitive to unverifiable assumptions about missingness and latent fragility.",
    "label": "Ambiguous",
    "correct_reasoning": "The claim asserts a specific counterfactual for this player: whether Y would have been 0 under X=0. At Pearl Level 3, that requires reasoning about Y_{X=0} for the same unit, which is not identified by a mere association among observed non-withdrawals. The analysts condition on S=1 (complete tracking/MRI), but S is a post-outcome selection variable largely determined by Y (withdrawals censor data). Conditioning on S=1 induces selection bias: it restricts attention to worlds (and players) where Y=0, which is exactly the event whose counterfactual probability is being queried. Moreover, Z (latent fragility) is an unobserved common cause of both X and Y, so even without selection the comparison of X groups is confounded; with selection, the problem becomes a counterfactual conditioning trap because the needed cross-world link between (Y under X=1) and (Y under X=0) is distorted by outcome-dependent observation. Therefore the direction and magnitude of the causal effect of the serving program on withdrawal—and thus whether this player would have withdrawn without it—cannot be concluded from the described data without strong, untestable assumptions (e.g., ignorability given measured Z proxies and a correct model for censoring). Hence the claim is not decidably true or false from the information given."
  },
  {
    "id": "T3-BucketD-056",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "In the NFL, coaches often call a timeout right before the opposing kicker attempts a game-winning field goal (known as 'icing the kicker'). An analyst compares kicks where the timeout was called vs. not called. They find kickers miss *more* often when 'iced'. The analyst concludes the tactic works. However, coaches only 'ice' the kicker in high-pressure, last-second situations, whereas non-iced kicks include many routine 2nd-quarter kicks.",
    "claim": "Calling a timeout before a kick (X) causes the kicker to miss (Y).",
    "variables": {
      "X": "Calling a timeout before the kick ('Icing')",
      "Y": "Missed Field Goal",
      "Z": "Game Pressure / Leverage (Last second vs. mid-game)"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Confounding by Indication",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z (High Pressure) causes X (Coach calls timeout) and Z causes Y (Kicker chokes/misses). X is not randomly assigned.",
      "key_insight": "The intervention (icing) is applied selectively during high-stress moments. High stress makes kicking harder. The comparison group (non-iced kicks) includes low-stress kicks.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z (last second) -> X (timeout). Z -> Y (miss).",
    "conditional_answers": "Ambiguous. To determine if icing works, one must compare iced vs. non-iced kicks *only* within high-leverage situations. Studies suggest the effect is negligible or nonexistent once Z is controlled.",
    "label": "Ambiguous",
    "correct_reasoning": "The claim implies do(X) -> Y. However, X is confounded by Z (Game Pressure). Coaches do not ice kickers in the 1st quarter. They ice them at the end of the game when pressure is highest. Pressure (Z) increases the miss rate (Y). Therefore, the observed relationship is confounded. Without adjusting for Z, the causal claim is invalid."
  },
  {
    "id": "T3-BucketD-057",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "An NBA team considers a policy change: mandate that all players complete a 12-minute dynamic warm-up immediately before entering the game (including after halftime and after long bench stints). The performance staff evaluates the causal effect of this policy on in-game soft-tissue injuries using player-game data. A naive analyst proposes estimating the effect by comparing injury rates between games where players complied with the warm-up and games where they did not, restricting analysis to 'compliant' player-games only.",
    "claim": "If the team intervenes to mandate the 12-minute dynamic warm-up (X), it will reduce in-game soft-tissue injuries (Y), based on the observed lower injury rate among compliant player-games.",
    "variables": {
      "X": "Mandated 12-minute dynamic warm-up protocol before game entry (team policy intervention)",
      "Y": "In-game soft-tissue injury occurrence (e.g., hamstring/groin strain) during that game",
      "Z": "Compliance status with the warm-up (a post-intervention variable influenced by fatigue/coach usage/availability and linked to injury risk)"
    },
    "annotations": {
      "trap_type": "Selection Bias",
      "trap_subtype": "Post-intervention Selection",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "X affects Z (policy increases compliance). Unobserved factors U (e.g., acute fatigue, time pressure from late substitutions, minor tightness, coach urgency) affect both Z (skipping/shortening warm-up) and Y (injury risk). Conditioning on Z (analyzing only compliers) induces selection bias; the causal effect of X on Y must be evaluated without post-treatment selection (or via appropriate causal estimands like ITT).",
      "key_insight": "To answer an intervention question, you cannot estimate the policy effect by restricting to a post-policy subgroup (compliers), because compliance is itself affected by the intervention and by risk factors for injury. Use an intention-to-treat comparison (policy-on vs policy-off) or methods that account for noncompliance without conditioning on it.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: Team implements warm-up mandate (X). t1: On each game entry, players either comply or not (Z), influenced by acute fatigue/time pressure U. t2: Injury occurs or not during play (Y).",
    "conditional_answers": "Answer if the team compares all eligible player-games under policy-on vs policy-off (intention-to-treat): the causal claim that the mandate reduces injuries is supported (Yes), assuming no other concurrent injury-prevention changes and stable reporting. Answer if the team instead compares only compliers vs non-compliers within the policy period: the conclusion would be biased and could flip (would become No/Ambiguous).",
    "label": "Yes",
    "correct_reasoning": "This is a Level-2 (interventional) question about the effect of implementing a warm-up mandate (X) on injury risk (Y). The key trap is post-intervention selection: compliance (Z) occurs after X and is causally affected by X, so conditioning on Z does not generally identify the causal effect of X on Y. However, the claim as stated is about the policy intervention itself (do(X)=1 vs do(X)=0). The correct estimand is the intention-to-treat effect: compare injury rates under the mandate versus no mandate across all eligible player-games, without restricting to compliers. Under the causal structure, X increases the probability of compliance, and compliance is a mechanism through which injuries can be reduced. Provided there are no unblocked backdoor paths between X and Y at the policy level (e.g., no simultaneous changes in minutes management or medical staffing that coincide with the mandate), the interventional contrast do(X)=1 vs do(X)=0 captures the policy’s causal effect. Therefore, the causal conclusion that mandating the warm-up reduces injuries is valid when evaluated as an intervention effect (not as a per-protocol 'complier-only' association), so the label is Yes."
  },
  {
    "id": "T3-BucketD-058",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A professional soccer club evaluates a new coaching policy: after any match where the team concedes 2+ goals, the head coach mandates an extra high-intensity conditioning session the next day. Analysts compare subsequent-match defensive performance between weeks where the extra session was mandated versus weeks where it was not, and find that weeks with the extra session are followed by fewer goals conceded in the next match. The club concludes the policy causally improves defense and decides to mandate it permanently.",
    "claim": "Mandating an extra high-intensity conditioning session after conceding 2+ goals causes the team to concede fewer goals in the next match.",
    "variables": {
      "X": "Mandated extra high-intensity conditioning session the day after a match (policy on/off)",
      "Y": "Goals conceded in the next match (defensive performance)",
      "Z": "Opponent strength and match context that triggered the mandate (e.g., facing top-tier attacks, red cards, injuries, congested schedule), which both increases goals conceded in the trigger match and influences next-match goals conceded"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Time-varying process: prior defensive outcomes and match context influence whether X is assigned; the same evolving context also affects future Y. Past Y (or its drivers) -> X, and shared evolving factors Z_t -> X and Z_t -> Y.",
      "key_insight": "Because the extra session is assigned reactively based on recent defensive failure and changing match context, naive comparisons mix the effect of the policy with the effect of the underlying time-varying difficulty/injuries/fatigue that drive both assignment and future defense.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: Team plays Match k with context Z_t0 (opponent strength, red cards, fatigue) influencing goals conceded in Match k. t1: Observing 2+ conceded triggers X (extra session) assigned at t1. t2: Next match defensive outcome Y at Match k+1 is influenced by updated context Z_t2 (lineup health, fatigue from congestion, opponent strength) and potentially by X; but Z evolves partly from earlier Z and match outcomes.",
    "conditional_answers": "Answer would change if (i) X were randomized independent of recent defensive outcomes and match context, or (ii) the analysis correctly adjusted for the full time-varying history that drives both assignment and future defense (e.g., using marginal structural models with appropriate weights) including opponent strength, injuries, fatigue, red cards, and schedule congestion.",
    "label": "No",
    "correct_reasoning": "The claim is flawed because the observed association after 'mandating X' does not identify the causal effect of an intervention do(X) when treatment assignment is time-varying and depends on prior outcomes and evolving context. Here, X is not assigned exogenously: it is triggered by conceding 2+ goals, which is itself a downstream indicator of latent and observed match context Z (opponent quality, lineup disruptions, fatigue, in-game events). Those same factors Z also affect the next-match goals conceded Y. Thus there is an open backdoor path X <- (prior defensive outcome / match context history) <- Z -> Y, and additionally Z evolves over time (Z_t0 -> Z_t2), so simple adjustment with static covariates or ignoring history fails to block confounding. The reduction in next-match goals conceded could reflect regression to more typical opponents, recovery of injured defenders, less congested scheduling, or reversion after an unusually bad match—factors that both increase the chance X is assigned and independently improve (or worsen) Y. Therefore the comparison of mandated-versus-not weeks does not estimate the interventional effect of mandating the extra session, so the causal conclusion 'X causes lower Y' is not warranted."
  },
  {
    "id": "T3-BucketD-059",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "In competitive volleyball, coaches often substitute their setter when the team loses 3 consecutive points. Data shows that after such substitutions, the team still loses the set 80% of the time. The board concludes the substitution policy is ineffective and disrupts the team.",
    "claim": "Substituting the setter (X) causes the team to lose the set (Y).",
    "variables": {
      "X": "Substituting the setter",
      "Y": "Losing the set",
      "Z": "Negative Momentum / Opponent Dominance (The team is already being outplayed)"
    },
    "annotations": {
      "trap_type": "Reverse Causation",
      "trap_subtype": "Reactive Intervention",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z (Opponent is dominating) triggers X (Coach tries a sub) and Z causes Y (Loss). The intervention is reactive to a negative trajectory.",
      "key_insight": "The substitution is a 'Hail Mary' attempt to stop a loss that is already in progress. The high loss rate reflects the situation that triggered the sub, not the effect of the sub itself.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z (0-3 run) at t0 -> X (sub) at t1 -> Y (loss) at t2.",
    "conditional_answers": "No. It is likely that without the sub, the loss rate would have been equal or higher (e.g. 90%). The sub might have improved the odds slightly, even if the absolute outcome was still a loss.",
    "label": "No",
    "correct_reasoning": "This is a Reactive Intervention (L2). The coach intervenes (X) because the probability of Y is already high due to Z (momentum/performance gap). Comparing P(Y|X) to P(Y|no X) is biased because 'no X' usually implies the team was playing well enough not to need a sub. The intervention did not cause the loss; the bad performance that triggered the intervention did."
  },
  {
    "id": "T3-BucketD-060",
    "pearl_level": "L1",
    "domain": "Sports",
    "scenario": "A soccer club’s analyst reports that players who log more high-intensity sprint distance per match tend to have higher post-match hamstring soreness ratings. A coach concludes that sprint distance causes soreness and proposes reducing sprinting demands in training and matches to prevent soreness.",
    "claim": "The observed positive association between high-intensity sprint distance and hamstring soreness does not by itself establish that increasing sprint distance causes more soreness, because fitter or more competitively deployed players may both sprint more and be more likely to report soreness due to heavier workloads and match roles.",
    "variables": {
      "X": "High-intensity sprint distance recorded in a match (e.g., meters above a speed threshold)",
      "Y": "Post-match hamstring soreness rating (self-report or physio scale within 24 hours)",
      "Z": "Underlying workload/role intensity (e.g., being a starting winger in a high-press system, total minutes played, and cumulative recent load) that influences both sprint distance and soreness"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Omitted Variable",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z -> X and Z -> Y, with an observed association X <-> Y induced by the common cause Z",
      "key_insight": "In observational match data, sprint distance is partly a proxy for role and accumulated load; without measuring/adjusting for that common cause, the X–Y association is not a causal effect of sprinting itself.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z at t-7 to t0 (recent cumulative load and tactical role) increases X at t0 (match sprint distance) and independently increases Y at t0+1 (next-day soreness); thus X and Y correlate even if X has no direct causal effect on Y.",
    "conditional_answers": "Answer if asked whether sprinting should be reduced: Not from this association alone; you would need either randomization (e.g., experimentally altered sprint exposure) or credible adjustment for Z (minutes, role, pressing intensity, prior load, baseline hamstring status) to estimate the causal effect of X on Y.",
    "label": "Yes",
    "correct_reasoning": "At Pearl L1 we are restricted to associational statements. The coach’s original causal leap (X causes Y) is not licensed by the reported correlation because there exists a plausible omitted common cause Z. Specifically, Z (role intensity and accumulated workload) increases X (players in demanding roles and with more minutes will sprint more) and also increases Y (those same players experience more muscle fatigue and soreness). In a DAG, Z opens a backdoor path X <- Z -> Y, which creates an association between X and Y even if the direct causal arrow X -> Y were weak or absent. Therefore, the correct L1 conclusion is the claim: the association alone does not identify causation, and the correlation is explainable by confounding through Z."
  },
  {
    "id": "T3-BucketD-061",
    "pearl_level": "L3",
    "domain": "Sports",
    "scenario": "A soccer club’s star striker finishes a match with mild hamstring tightness. The medical staff has a policy: if the post-match tightness score is above a threshold, they prescribe an added recovery day (no sprinting) before the next match; otherwise the player trains normally. In this particular week, the striker reports high tightness and is given the added recovery day, then plays the next match and does not suffer a hamstring strain. A fan argues: “The added recovery day prevented a strain; if he had trained normally, he would have strained.” The club wants to know whether that counterfactual statement is true for this specific week.",
    "claim": "For this specific week, if the striker had not been given the added recovery day, he would have suffered a hamstring strain in the next match.",
    "variables": {
      "X": "Added recovery day prescribed by staff (no sprinting) between matches",
      "Y": "Hamstring strain occurring in the next match (yes/no)",
      "Z": "Underlying hamstring vulnerability that week (micro-tear/fatigue state) that influences both the tightness report and true injury risk"
    },
    "annotations": {
      "trap_type": "Preemption",
      "trap_subtype": "Early Preemption",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z increases tightness report and baseline injury risk Y. High reported tightness triggers X. X reduces injury risk by preventing overload. In the actual world, X occurs and preempts the injury pathway that would have produced Y under no recovery; the absence of Y is therefore not evidence that Z was harmless.",
      "key_insight": "At L3 we ask a unit-level counterfactual: whether Y would have occurred in the same week for the same player if X were different. Here X can prevent (preempt) the injury mechanism, so observing no injury under X does not mean the player was safe; it can be precisely because X acted early.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: Z (micro-damage/fatigue) exists after the prior match. t1: tightness is reported/assessed; policy assigns X based on this. t2: training load differs due to X. t3: next match occurs and Y (strain) may or may not occur.",
    "conditional_answers": "Answer is Yes if (i) Z was sufficiently high that, holding all else in that week fixed, normal training would have crossed the tissue-failure threshold producing Y, and (ii) the added recovery day reduced load enough to keep the tissue below that threshold. Answer would become Ambiguous if X were assigned for reasons unrelated to true vulnerability (e.g., rotation/rest for tactical reasons) or if multiple other unmodeled interventions changed simultaneously.",
    "label": "Yes",
    "correct_reasoning": "We are evaluating a counterfactual of necessity for this specific instance: whether Y_{X=0}=1 given that we observed X=1 and Y=0. The causal model posits an early-acting prevention pathway where X intervenes between the latent vulnerability Z and the injury outcome Y by reducing subsequent load. Because Z can be high in the actual world while Y is still 0 (due to X), the absence of injury does not imply the striker was uninjurable; it is compatible with a world in which, had X been removed while keeping the same Z and week-level conditions, the overload mechanism would have proceeded and produced Y. This is an Early Preemption structure: X occurs before the injury mechanism can manifest, blocking the otherwise sufficient pathway from Z to Y. Under the stated assumptions (Z high enough and X strong enough to avert threshold crossing), the claim that the added recovery day prevented a strain for this week is causally valid, so the label is Yes."
  },
  {
    "id": "T3-BucketD-062",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A soccer club considers a new in-game coaching policy: at the 60th minute, if the team is not leading, the coach makes an “attacking triple-sub” (three offensive substitutions within five minutes). Analysts compare matches where the triple-sub happened vs. matches where it did not, and observe that the triple-sub matches have a higher probability of conceding a late goal and a lower probability of winning. The front office asks whether they should ban the triple-sub policy.",
    "claim": "Banning the 60th-minute attacking triple-sub would increase the team’s win probability because the triple-sub causes more late goals conceded and fewer wins.",
    "variables": {
      "X": "Implementing the 60th-minute attacking triple-sub policy (yes/no) in a match",
      "Y": "Match outcome after minute 60 (e.g., win probability or goal differential at full time)",
      "Z": "Minute-60 match state and trajectory (scoreline, opponent strength, red cards, fatigue, expected-goals trend up to minute 60) that drives both the decision to triple-sub and the likelihood of winning/conceding late"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z (minute-60 state/trajectory) affects X (triple-sub decision) and also affects Y (final outcome). Additionally, earlier match events influence both Z and Y, making Z a time-varying confounder that evolves with the game.",
      "key_insight": "The triple-sub is typically triggered by deteriorating match conditions (trailing, fatigue, opponent dominance). Those same conditions predict poor late outcomes, so naive comparisons of X vs. not-X mix the effect of the intervention with the effect of the evolving match state that prompted it.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0 (kickoff to 60') produces evolving match state Z at t1 (minute 60). At t1 the coach chooses X based on Z. From t1 to t2 (full time), both Z and X influence Y.",
    "conditional_answers": "Ambiguous: If the triple-sub were randomly assigned (or assigned by an exogenous rule unrelated to Z) then the observed association could be interpreted causally; if it is primarily chosen in worse match states Z, the association likely overstates harm (or could even mask benefit).",
    "label": "Ambiguous",
    "correct_reasoning": "We are being asked an L2 question about the effect of an intervention: do(X=ban/avoid the triple-sub) on Y (winning/late goals). The observed data compare matches with X=1 vs X=0, but X is not assigned independently; it is chosen reactively based on the evolving match state Z at minute 60. Z is a time-varying confounder: it is a common cause of X (coach is more likely to triple-sub when trailing, fatigued, or being outplayed) and Y (those same states make conceding late and losing more likely). Therefore, P(Y|X) is not equal to P(Y|do(X)) unless we correctly block the backdoor path X <- Z -> Y with adequate measurement and modeling of Z as it evolves. However, even conditioning on a coarse Z (e.g., just scoreline) may be insufficient because unmeasured components of Z (true fatigue, tactical mismatch, opponent adjustments, red-card risk, xG momentum) can remain and keep the backdoor path partially open. Without a credible identification strategy (randomization, a valid instrument such as an exogenous substitution constraint, a well-specified g-method / marginal structural model using rich time-stamped covariates, or a natural experiment), we cannot determine whether the triple-sub is harmful, beneficial, or neutral. Hence the claim that banning the triple-sub would increase win probability is not justified from the association alone, and the correct label is Ambiguous rather than No, because the direction and magnitude of the causal effect remain unidentified with the information given."
  },
  {
    "id": "T3-BucketD-063",
    "pearl_level": "L3",
    "domain": "Sports",
    "scenario": "A tennis coach reviews a season where a star player missed several tournaments due to a wrist injury. The coach argues that the player should have switched to a lighter racquet earlier in the season. In support, the coach notes that in the actual season, the player switched to a lighter racquet only after the injury, and after the switch the player’s pain reports decreased and match availability improved. The coach then makes a counterfactual claim: 'If the player had used the lighter racquet from the start, the player would still have suffered the same wrist injury (because the wrist was already fragile), but would have recovered faster and missed fewer tournaments.'",
    "claim": "If the player had switched to a lighter racquet from the start of the season, the player would still have suffered the same wrist injury, but would have recovered faster and missed fewer tournaments.",
    "variables": {
      "X": "Using a lighter racquet from the start of the season (equipment intervention)",
      "Y": "Number of tournaments missed during the season (availability/participation outcome)",
      "Z": "Wrist injury severity and recovery trajectory (mediating health process affected by X)"
    },
    "annotations": {
      "trap_type": "Confounder–Mediator Error",
      "trap_subtype": "Mediator Fixing Error",
      "difficulty": "Easy",
      "subdomain": "Sports",
      "causal_structure": "X affects Z (load on the wrist and inflammation), and Z affects Y (missed tournaments). The claim implicitly holds the injury occurrence/severity constant while changing X, even though X would also change Z and thus downstream Y.",
      "key_insight": "You cannot evaluate the effect of an intervention while simultaneously 'fixing' a mediator that lies on the causal pathway from that intervention to the outcome; this mixes incompatible (cross-world) assumptions.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: X (racquet choice) influences cumulative wrist load; t1: Z (injury severity/inflammation) evolves; t2: Y (tournaments missed) is realized based on Z and medical decisions.",
    "conditional_answers": "Answer if you intervene on X but allow Z to change naturally: the effect on Y depends on how much X reduces wrist load and thus changes Z. Answer if you (incorrectly) hold Z fixed to its actual-season value while changing X: you are asking an incoherent counterfactual because Z is downstream of X.",
    "label": "No",
    "correct_reasoning": "The claim is flawed because it asserts a counterfactual effect of X on Y while stipulating that the wrist injury (Z) would be 'the same' as in the actual world. In the causal model, X -> Z -> Y: racquet choice changes mechanical load and thus changes the injury severity and recovery trajectory Z, which in turn drives missed tournaments Y. Therefore, the counterfactual world where X is changed generally implies a different Z, not the same Z as observed. Holding Z fixed to its factual value while intervening on X is a mediator-fixing (cross-world) error: it combines Z from the factual world with X from the counterfactual world, which is not a coherent single world under the assumed causal structure. A valid counterfactual must either (i) change X and let Z evolve according to the model to infer Y, or (ii) ask a controlled direct effect question explicitly defined as changing X while intervening to set Z, which is not what the coach justified. Hence the stated conclusion does not follow causally."
  },
  {
    "id": "T3-BucketD-064",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A professional soccer club considers an in-season intervention: mandating that all starters use a new GPS-based training-load app that enforces a weekly 'red-zone' cap (automatic reduced drills once a player exceeds the cap). The sports science department presents a mid-season analysis: among players who were put on the app, the rate of soft-tissue injuries over the next 6 weeks is higher than among players not put on the app. Coaches conclude the app is causing injuries and want to stop using it. However, the rollout was not randomized: the head physio prioritized the app for players flagged as 'high risk' based on recent fatigue markers and minor niggles, and the physio also adjusted other recovery modalities (e.g., massage, rest days) in response to the same flags. Additionally, when a player reports soreness, coaches often immediately reduce minutes in matches, which changes subsequent training exposure and injury risk.",
    "claim": "Mandating the training-load app (X) increases soft-tissue injury risk (Y), so stopping the app will reduce injuries.",
    "variables": {
      "X": "Intervention: mandatory adoption of the GPS-based training-load app with enforced weekly red-zone caps",
      "Y": "Outcome: soft-tissue injury occurrence within the next 6 weeks (e.g., hamstring strain, calf strain)",
      "Z": "Time-varying confounding mechanism: evolving latent injury risk/fatigue status (proxied by fatigue biomarkers, soreness reports, recent minutes played) that influences both app assignment and future injury, and is itself affected by prior training loads and prior near-injuries"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "Dynamic treatment assignment: prior fatigue/near-injury risk Z_t affects whether X_t is imposed and also affects injury Y_{t+1}; prior exposure/training load (partly altered by earlier X_{t-1}) affects Z_t, creating treatment-confounder feedback. Additional co-interventions (recovery changes) are triggered by Z_t and correlate with X_t.",
      "key_insight": "Because Z changes over time and is influenced by earlier training decisions (and possibly earlier app use), naive comparisons or standard regression adjustment can produce biased estimates of the causal effect of X on Y; without a clearly specified intervention protocol and appropriate longitudinal causal methods, the direction and magnitude of the effect are not identifiable from the described evidence.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: baseline fatigue/biomarkers and recent minutes define Z0; t1: physio mandates app for high-risk players (X1) and adjusts recovery; t2: training load and match minutes change, updating fatigue status Z1; t3: injury Y observed over subsequent weeks; Z continues to evolve and influences further app enforcement and minutes.",
    "conditional_answers": "Ambiguous: If X were randomly assigned (or assigned via a known protocol independent of potential outcomes given measured history) and co-interventions were held constant, we could estimate whether the app causally increases or decreases injuries; if instead X is preferentially assigned to high-risk players and Z is incompletely measured, the observed higher injury rate under X could be entirely due to time-varying confounding by indication rather than harm from the app.",
    "label": "Ambiguous",
    "correct_reasoning": "This is a Level-2 (interventional) question: we want the effect of imposing the app policy X on subsequent injury Y, i.e., compare Y under do(X=1) versus do(X=0). The observed association P(Y|X) is not equal to the interventional quantity P(Y|do(X)) because treatment assignment is endogenous over time. Specifically, the evolving fatigue/latent injury risk Z_t both (i) increases the probability the physio mandates/enforces the app (X_t) and (ii) increases future injury risk (Y_{t+1}), creating an unblocked backdoor path X_t <- Z_t -> Y_{t+1}. Moreover, Z_t is itself affected by earlier training decisions and possibly earlier app enforcement (X_{t-1} -> training load -> Z_t), so Z_t is a time-varying confounder affected by prior treatment. Therefore, naive adjustment (or stratifying on contemporaneous Z_t) can induce bias because it conditions on a variable on the causal pathway from earlier X to later Y while also acting as a confounder for later X. Given the described rollout (risk-prioritized adoption, concurrent recovery changes, and minutes reductions responding to soreness), the data do not identify the causal effect of X without additional assumptions (e.g., sequential ignorability with rich measured history) and appropriate longitudinal methods (e.g., g-methods). Hence the claim that stopping the app will reduce injuries is not justified, but neither is the opposite; the sign of the true causal effect remains undetermined from the provided information, so the correct label is Ambiguous."
  },
  {
    "id": "T3-BucketD-065",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "An NBA team introduces a new wearable-based “fatigue management” policy. When a player’s rolling 3-game workload score exceeds a threshold, the staff mandates an extra rest day and limits minutes in the next game. Midseason, an analyst compares games where players were put on the rest/limit protocol versus games where they were not, and finds that protocol games have lower win probability and worse player efficiency ratings. The analyst proposes to stop using the protocol because it “hurts performance.” Coaches counter that the protocol is meant to prevent late-season injuries and that it’s triggered precisely when players are already fatigued.",
    "claim": "Mandating the wearable-triggered rest/minutes-limit protocol causes worse next-game performance, so the team should stop the protocol to improve wins.",
    "variables": {
      "X": "Implementing the wearable-triggered rest/minutes-limit protocol for a player before/for a given game (extra rest day and/or reduced minutes)",
      "Y": "Next-game performance (team win probability and player efficiency rating in that game)",
      "Z": "Player fatigue/injury-risk state and recent workload trend that both triggers the protocol and independently reduces performance"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "Z(t-1) (fatigue/workload) affects X(t) (rest/limit decision) and directly affects Y(t) (next-game performance); additionally Y(t-1) can affect Z(t-1) (hard minutes in close games increase fatigue), creating time-varying confounding where past outcomes influence future treatment assignment via fatigue.",
      "key_insight": "Because the protocol is triggered by evolving fatigue that is itself affected by prior games, naive comparisons of treated vs untreated games mix the effect of the protocol with the effect of underlying fatigue; without a strategy that handles time-varying confounding, the causal effect of intervening on rest is not identified.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Y at t-1 (previous game intensity/close-game minutes) increases Z at t-1 (fatigue); Z at t-1 triggers X at t (rest/minutes limit); Z at t-1 also decreases Y at t (next-game performance).",
    "conditional_answers": "Ambiguous: If the analysis properly adjusts for time-varying confounding (e.g., using marginal structural models with inverse probability weights based on observed workload/fatigue history) and still finds a negative causal effect of X on Y, then the claim could be valid. If the observed association disappears or reverses after appropriate adjustment (or under a randomized rest policy), then the claim is flawed. If key drivers of Z (true fatigue, nagging injuries, unrecorded practice load, travel stress) are unmeasured, the direction and magnitude remain uncertain.",
    "label": "Ambiguous",
    "correct_reasoning": "This is a Level-2 (interventional) question about the effect of setting X (mandating rest/minutes limits) on Y (next-game performance). The observed comparison between protocol games and non-protocol games is not an estimate of P(Y|do(X)) because X is assigned based on an evolving state Z (fatigue/workload) that both (i) causes the staff to apply the protocol and (ii) directly worsens next-game performance. Moreover, Z is time-varying and is itself affected by prior outcomes/contexts (e.g., previous close games produce high minutes, which increases fatigue), so conditioning only on contemporaneous covariates or doing a simple regression can leave an unblocked backdoor path through the treatment history and Z-history. Therefore, from the described evidence alone, we cannot determine whether intervening to remove the protocol would improve performance (the negative association could be entirely due to fatigued players being selected into treatment), nor can we conclude the protocol is beneficial without a design that identifies the causal effect. The correct conclusion is that the claim is not identifiable from the naive comparison; additional assumptions, better measurement of Z over time, or an identification strategy for time-varying confounding is required."
  },
  {
    "id": "T3-BucketD-066",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A soccer club evaluates whether its new high-intensity pressing training program improved match results. Mid-season, the head coach mandates the program for all starters. Analysts compare matches where the team logged higher average pressing intensity (measured by high-speed runs and pressures per 90) to matches with lower intensity, and they run a regression controlling for the opponent's expected goals (xG) and the team's in-match fatigue index (derived from GPS load). They conclude the training caused better results because higher pressing matches are associated with more wins after adjustment.",
    "claim": "Mandating the high-intensity pressing training program (X) caused the team to win more matches (Y), because after controlling for fatigue (Z) the effect remains positive.",
    "variables": {
      "X": "Intervention: mandated high-intensity pressing training program for starters (club policy implemented mid-season)",
      "Y": "Outcome: match result / win probability in subsequent matches",
      "Z": "Mediator/mechanism: in-match fatigue index (GPS load / exertion), which is affected by the training and also affects match results"
    },
    "annotations": {
      "trap_type": "Confounder–Mediator Error",
      "trap_subtype": "Mediator Adjustment Error",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "X affects Z (pressing training increases exertion and fatigue); Z affects Y (fatigue lowers late-game performance and win probability); X may also affect Y through other pathways (tactical coordination, opponent disruption). Conditioning on Z blocks part of X's causal effect and can distort the estimated total effect of X on Y.",
      "key_insight": "Fatigue is downstream of the training intervention; adjusting for it answers a different causal question (a controlled direct effect) and can bias the estimate of the total policy impact.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: club mandates pressing training (X). t1: training changes players' exertion and fatigue profile during matches (Z). t2: fatigue influences late-match execution and results (Y).",
    "conditional_answers": "If the estimand is the total effect of mandating pressing training on winning, then controlling for fatigue is inappropriate. If instead the estimand is the direct effect of training holding fatigue fixed at a set level (a controlled direct effect), then controlling for fatigue could be aligned with that narrower question, but it still requires additional assumptions (e.g., no unmeasured mediator-outcome confounding).",
    "label": "No",
    "correct_reasoning": "The claim is flawed because it treats Z (fatigue) as a confounder to be adjusted for when estimating the causal effect of the intervention X on outcome Y. Under the stated causal structure, Z is caused by X (X -> Z) and also causally affects Y (Z -> Y). Therefore Z lies on a causal pathway from X to Y and is a mediator. Conditioning on a mediator blocks part of the causal effect of X on Y, so the regression coefficient after adjusting for Z does not identify the total causal effect of the policy intervention do(X) on match wins. Moreover, because Z is post-intervention, adjusting for it can introduce bias if there exist unmeasured common causes of Z and Y (e.g., match intensity, injuries, rotation decisions) that become active once conditioning occurs. Thus, the analysis cannot support the conclusion that mandating pressing training increased wins; at best it estimates a different quantity (a direct effect not through fatigue) under additional unverified assumptions."
  },
  {
    "id": "T3-BucketD-067",
    "pearl_level": "L3",
    "domain": "Sports",
    "scenario": "An NBA team reviews a playoff series where their star guard played through a mild ankle sprain. The medical staff gave him a pregame painkilling injection and taped the ankle. He ended up scoring 38 points, but in the fourth quarter he landed awkwardly and suffered a high-ankle sprain that sidelined him for the rest of the series. A debate erupts: did the injection 'cause' the severe injury, or would it have happened anyway given the minutes load and defensive pressure? Analysts propose a counterfactual: 'If he had not received the injection, would he have avoided the severe sprain?' The only data available are game video, minutes, and the fact that he played because he felt able to after the injection.",
    "claim": "If the star guard had not received the painkilling injection (X), he would not have suffered the high-ankle sprain later in the game (Y).",
    "variables": {
      "X": "Receiving a pregame painkilling injection (and associated numbing) to enable playing through an ankle sprain",
      "Y": "Suffering a high-ankle sprain during the game (severe injury event)",
      "Z": "Latent 'playability/participation' state: the joint's true stability plus willingness/ability to play heavy minutes (a mediator of X and a selection variable that depends on symptoms and risk tolerance)"
    },
    "annotations": {
      "trap_type": "Selection Bias",
      "trap_subtype": "Counterfactual Conditioning",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "X affects Z (symptom masking increases participation/usage). Z affects Y (more minutes, more explosive cuts, more exposure to contact/awkward landings). Unobserved ankle instability and coaching necessity also affect Z and Y. The counterfactual question is implicitly conditioned on Z=played heavy minutes, but Z is itself affected by X, creating a cross-world selection problem when asking about Y under do(X=0) while holding 'he played the same way' fixed.",
      "key_insight": "The claim mixes two counterfactual worlds: it asks about Y under no injection while implicitly keeping the post-treatment participation path (Z) that occurred only because of the injection. Conditioning on a post-treatment selection/participation variable makes the counterfactual not identifiable without extra assumptions about how playing time and movement would change under X=0.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: baseline mild ankle sprain and joint instability exist. t1: injection given (X). t2: due to reduced pain, he plays heavy minutes and attacks the rim more (Z). t3: awkward landing/contact occurs; severe high-ankle sprain happens (Y).",
    "conditional_answers": "Answer if (i) under X=0 he would still have played the same minutes and movement profile (Z unchanged), and (ii) the injection only affects injury risk through Z (no direct biomechanical effect): then the injection would not change Y given fixed Z, so the claim would be false. Answer if instead (i) under X=0 he would have self-limited and played fewer explosive cuts (Z would decrease), and (ii) exposure is a major driver of Y: then the injection could increase Y via increased exposure, making the claim potentially true. Without knowing how Z would counterfactually change and whether there is a direct physiological effect of numbing on mechanics, the claim cannot be settled.",
    "label": "Ambiguous",
    "correct_reasoning": "This is a Level-3 question because it asks a counterfactual: Y_{X=0} for the same player/game. The observed world includes both X=1 and the downstream participation/usage state Z that followed from X. The claim implicitly asserts Y_{X=0}=0 because Y_{X=1}=1, but that inference is invalid because it conditions on a post-treatment selection variable: we only observe the severe injury in the world where he both received the injection and then played heavy minutes (Z=high). To evaluate the claim we would need the counterfactual distribution of Z under X=0 (would he have played, and how), and whether X has any direct effect on Y beyond Z (e.g., altered proprioception/landing mechanics). Because Z is affected by X and also driven by latent ankle instability and coaching necessity that also affect Y, comparing the 'played-through' scenario to a hypothetical 'no injection' scenario while holding participation fixed mixes incompatible (cross-world) conditions. Therefore the truth of the claim is not identifiable from the described information; it could be true if X increases exposure via Z or false if the injury was primarily driven by underlying instability and a stochastic landing event that would have occurred regardless. Hence the correct label is Ambiguous."
  },
  {
    "id": "T3-BucketD-068",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "An NBA team introduces a new 'load management' policy: any player reporting soreness on the daily wellness app is automatically held out of back-to-back games. Midseason, the team notices that players who are held out under the policy have a higher rate of soft-tissue injuries in the following month than players who are not held out. A staff member concludes the policy is causing injuries and proposes ending it.",
    "claim": "Holding players out of back-to-back games (load management) increases next-month soft-tissue injury risk.",
    "variables": {
      "X": "Intervention: holding a player out of back-to-back games due to the new load-management rule",
      "Y": "Outcome: soft-tissue injury occurrence in the following month",
      "Z": "Time-varying confounder: evolving underlying tissue fatigue/soreness status (and related training load) that both triggers being held out and predicts near-future injury"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Easy",
      "subdomain": "Sports",
      "causal_structure": "Z(t) (fatigue/soreness) influences X(t) (held out) and also influences Y(t+1) (injury). Additionally, past fatigue and micro-injuries can affect both future fatigue Z(t+1) and future treatment assignment X(t+1), creating a time-varying confounding path that is not blocked by naive comparisons.",
      "key_insight": "Because the decision to hold out is a reactive intervention driven by changing fatigue/soreness, the observed association between being held out and later injury can reflect who gets held out (high-risk players) rather than the causal effect of the holdout itself.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z at t0 (accumulated fatigue/micro-damage) -> X at t0 (held out next back-to-back) and Z at t0 -> Y at t1 (injury next month). Also Y at t1 can influence future Z at t2 and future X at t2 via rehab and altered minutes.",
    "conditional_answers": "If players are randomly assigned to be held out independent of their current fatigue/soreness (or if fatigue is perfectly measured and appropriately handled with a valid causal method for time-varying confounding, e.g., marginal structural models), then we could estimate whether X causally changes Y. If, instead, holdouts are triggered by unmeasured or imperfectly measured fatigue, then the higher injury rate among held-out players can arise even if the policy is protective.",
    "label": "Ambiguous",
    "correct_reasoning": "This is an L2 question about the effect of an intervention do(X)=1 (holding a player out) on Y (future injury). The observed comparison P(Y|X=1) vs P(Y|X=0) is not, by itself, an estimate of P(Y|do(X=1)) vs P(Y|do(X=0)) because treatment assignment is confounded by a time-varying state Z (fatigue/soreness) that both causes the decision to hold out and causes injury risk. The backdoor path X <- Z -> Y remains open unless Z is measured and correctly adjusted for across time; moreover, Z is dynamic and affected by prior workload and possibly prior injuries, so naive adjustment can fail if Z is itself influenced by earlier treatment or performance processes. Therefore the data pattern (held-out players later get injured more) does not logically identify the sign of the causal effect: it could mean the policy is harmful, or it could mean the policy is applied to higher-risk players and is partially protective but not enough to offset their baseline risk. With only the described observational comparison, the causal claim cannot be validated or refuted, so the correct label is Ambiguous."
  },
  {
    "id": "T3-BucketD-069",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A soccer club evaluates whether its new high-press training program improved match results. Analysts compare games where the team executed a high press (as coded by tracking data) versus games where they did not, and they adjust for 'time spent pressing' to isolate the direct effect of the program. They find that after adjustment, the high-press training appears to have no benefit (or even a slight negative effect) on points earned.",
    "claim": "Because points earned are unchanged (or worse) after controlling for time spent pressing, implementing the high-press training program does not causally improve match results.",
    "variables": {
      "X": "Implementing the high-press training program (team adopts the new pressing drills and tactical scheme)",
      "Y": "Match outcome (e.g., points earned per match / win probability)",
      "Z": "In-match pressing intensity or time spent pressing (a downstream tactical behavior influenced by the training program)"
    },
    "annotations": {
      "trap_type": "Confounder–Mediator Error",
      "trap_subtype": "Mediator Adjustment Error",
      "difficulty": "Easy",
      "subdomain": "Sports",
      "causal_structure": "X -> Z -> Y, with possible additional direct path X -> Y (e.g., improved coordination or fitness). Conditioning on Z blocks the mediated pathway and can also induce bias if Z is affected by other match factors.",
      "key_insight": "Z is a mediator caused by X; adjusting for Z answers a different question (direct effect) and can erase the total causal effect of X on Y.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "X at preseason (t0) changes pressing behavior Z during matches (t1), which influences match outcomes Y (t2).",
    "conditional_answers": "If the goal is the total effect of adopting the high-press program on match outcomes, do not condition on pressing intensity Z. If the goal is specifically the direct effect not through pressing (a narrower estimand), then conditioning on Z may be relevant but still requires strong assumptions about other causes of Z.",
    "label": "No",
    "correct_reasoning": "The claim is flawed because it treats an adjusted association as the causal effect of an intervention. In the assumed causal graph, implementing the training program (X) is designed to change pressing behavior (Z), and pressing behavior is one mechanism through which X affects match outcomes (Y). Conditioning on Z is therefore post-treatment adjustment: it blocks the causal path X -> Z -> Y and removes (part of) the very effect we want when asking whether adopting the program helps overall. Thus, the estimated effect after controlling for Z is not the total causal effect of X on Y; it is closer to a direct effect that excludes the mediated pathway. Consequently, observing 'no benefit after controlling for Z' does not imply that intervening to implement the program fails to improve results; it may simply reflect overcontrol of a mediator (and potentially additional bias if other match conditions also influence Z)."
  },
  {
    "id": "T3-BucketD-070",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A soccer club considers a new in-game hydration protocol: at minute 30, the staff triggers an extra “micro-break” (ball-out-of-play pause plus quick sideline fluids) for players whose GPS shows high high-intensity running in the first 25 minutes. Analysts want to estimate the causal effect of implementing the protocol across matches on second-half cramp incidence. However, the training load in the preceding week influences both early-match running intensity and cramp risk, and coaches also adjust the micro-break decision based on early-match signs of fatigue. The club proposes a model that estimates the intervention effect while controlling for the previous week’s training load and baseline fitness, but explicitly does not control for early-match running intensity because it is affected by the protocol decision rule and lies on the pathway to cramps.",
    "claim": "If the club intervenes to implement the micro-break hydration protocol and adjusts for prior-week training load (and baseline fitness), the estimated effect on second-half cramp incidence identifies the causal effect of the protocol, because prior-week training load is an unblocked backdoor confounder that must be blocked, while early-match running intensity should not be adjusted for since it is downstream of the protocol decision rule and part of the causal mechanism.",
    "variables": {
      "X": "Intervention: Implement the minute-30 micro-break hydration protocol (club policy applied across matches) versus standard play (no added micro-break hydration).",
      "Y": "Outcome: Second-half cramp incidence rate (e.g., proportion of players experiencing cramps after halftime).",
      "Z": "Confounder: Prior-week training load (e.g., acute workload/ACWR or total high-speed distance in training), which affects both likelihood/need of micro-break hydration and cramp risk."
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Unblocked Backdoor",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "Z -> X and Z -> Y; X -> (early-match running intensity / fatigue signs) -> Y. Coaches use early fatigue signs to trigger the protocol, but the policy is evaluated as an intervention that sets X at the match level; blocking Z closes the backdoor path X <- Z -> Y. Adjusting for early-match running intensity would block part of the causal effect (mediator) and can induce bias if it is also influenced by unmeasured factors.",
      "key_insight": "For L2 identification, you must block true pre-treatment confounding (Z) to estimate do(X), but you must not adjust for post-treatment mediators that transmit the effect of X to Y.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z measured at t-7d (prior-week load) influences X decision at t0 (match protocol implementation) and influences Y at t1 (second-half cramps). X at t0 affects early-match intensity/fatigue at t0+25m, which affects Y at t1.",
    "conditional_answers": "Answer if (i) Z is measured before the match and is not affected by X, (ii) the intervention truly sets X independent of match-specific fatigue signals (i.e., policy is enforced rather than selectively applied), and (iii) no additional unmeasured common causes of X and Y remain after adjusting for Z and baseline fitness: then the claim holds and the causal effect of do(X) on Y is identifiable via backdoor adjustment on Z. If instead X is still selectively applied based on in-match fatigue (a post-baseline factor) without proper longitudinal methods, additional time-varying confounding could remain and the claim would no longer be guaranteed.",
    "label": "Yes",
    "correct_reasoning": "We want the causal estimand E[Y | do(X=1)] - E[Y | do(X=0)]. In the observational regime, X is not randomized because prior-week training load Z influences both the likelihood that the protocol is implemented (X) and the probability of cramps (Y), creating the backdoor path X <- Z -> Y. This path is open unless we condition on Z (and any other pre-treatment common causes), so failing to adjust for Z yields confounding bias. Under the stated conditions, Z is pre-treatment and not affected by X, so conditioning on Z satisfies the backdoor criterion by blocking X <- Z -> Y while not blocking any causal paths from X to Y. Early-match running intensity/fatigue is downstream of X (part of the mechanism X -> mediator -> Y). Adjusting for it would remove part of the causal effect (overcontrol) and could also introduce bias if the mediator is influenced by other unmeasured factors. Therefore, adjusting for Z (and other pre-treatment covariates like baseline fitness) and not adjusting for the mediator correctly targets the interventional quantity do(X), making the claim valid."
  },
  {
    "id": "T3-BucketD-071",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A soccer club considers a new coaching policy: after any match where the team’s high press looks disorganized, the head coach orders an extra high-intensity pressing drill in the next training session. The analyst compares matches following 'extra drill weeks' vs 'normal weeks' and sees worse defensive outcomes after extra-drill weeks. The coach instead runs a small pilot in which, for a randomly chosen subset of weeks (regardless of how the last match looked), the team is assigned the extra pressing drill, and then compares subsequent match defense.",
    "claim": "In the randomized pilot, assigning the extra high-intensity pressing drill causes the team to concede fewer goals in the next match, even though observationally extra-drill weeks looked worse because they were usually scheduled after poor defensive performances.",
    "variables": {
      "X": "Intervention: assignment of an extra high-intensity pressing drill in the next training week (vs normal training load)",
      "Y": "Outcome: goals conceded (or expected goals against) in the subsequent match",
      "Z": "Time-varying confounder: prior-match defensive disorganization/fatigue that both triggers the coach to add the drill and also predicts conceding more goals next match"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Easy",
      "subdomain": "Sports",
      "causal_structure": "Z (prior-match defensive issues) influences X (coach assigns extra drill) and also influences Y (next-match goals conceded). Estimating the causal effect of X on Y requires breaking the Z->X backdoor path via random assignment or proper adjustment.",
      "key_insight": "The coach’s decision is reactive to recent performance, so naive comparisons mix the effect of the drill with the effect of the underlying defensive problem that prompted the drill.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: prior match reveals defensive disorganization/fatigue (Z). t1: coach assigns extra pressing drill (X). t2: next match goals conceded / xGA (Y). Z persists from t0 into t2, affecting Y directly and via readiness.",
    "conditional_answers": "Answer if you only observe club logs (non-random): extra-drill weeks may look worse due to Z->X and Z->Y confounding. Answer if you randomize assignment of extra drills (or perfectly adjust for Z): you can identify the causal effect of X on Y, which in this scenario is beneficial (fewer goals conceded).",
    "label": "Yes",
    "correct_reasoning": "This is a Level-2 (interventional) claim because it asserts what happens under an intervention do(X=extra drill) versus do(X=normal). In routine operations, X is not exogenous: the coach assigns extra drills in response to Z (recent defensive disorganization/fatigue), and Z also increases Y (conceding goals) in the next match. Thus the observational association P(Y|X) is biased by an unblocked backdoor path X<-Z->Y, and can even have the wrong sign. In the randomized pilot, X is assigned independently of Z, which blocks the backdoor path by design (X ⟂ Z). Therefore the contrast in outcomes between assigned extra-drill weeks and assigned normal weeks identifies the causal effect E[Y|do(X=extra)] - E[Y|do(X=normal)]. Given the pilot shows fewer goals conceded under assignment, the causal conclusion that the extra pressing drill reduces Y is valid despite the misleading observational correlation."
  },
  {
    "id": "T3-BucketD-072",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A soccer club pilots an AI-driven substitution policy mid-season. The model recommends earlier substitutions for players whose live GPS load and heart-rate patterns resemble prior fatigue-related injury episodes. Coaches adopt the policy for some matches but not others: they are more likely to follow it in high-stakes games (derbies, relegation six-pointers) and when the bench has strong replacement options. The analytics staff evaluates the policy by comparing matches where the coach 'followed the AI recommendation' vs matches where they did not, and reports that following the recommendation reduces late-match goals conceded and reduces hamstring injuries over the next 14 days.",
    "claim": "If the club forces coaches to follow the AI recommendation (do(X)=1) in all matches, the team will concede fewer late goals and suffer fewer hamstring injuries than if it does not (do(X)=0).",
    "variables": {
      "X": "Intervention: forcing adherence to the AI substitution recommendation (earlier subs when the model flags fatigue risk)",
      "Y": "Outcome: (i) late-match goals conceded (75'+) and (ii) hamstring injury incidence within 14 days after the match",
      "Z": "Time-varying confounding mechanism: evolving match context and player state that simultaneously affects adherence and outcomes (e.g., current scoreline, opponent strength, tactical urgency, player fatigue trajectory, bench depth, and prior-minute load), some of which is influenced by earlier substitution decisions"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "Dynamic treatment regime: pre-match factors (opponent strength, bench quality) and within-match evolving state (scoreline, tactical urgency, fatigue/load) affect both X (whether the coach adheres to the AI sub advice at time t) and Y (late goals and subsequent injury). Additionally, earlier adherence decisions change the subsequent match state (fatigue distribution, scoreline/tactics), which then affects later adherence and Y, creating treatment-confounder feedback.",
      "key_insight": "Because Z changes over time and is partly affected by earlier X, naive comparisons of adherence vs non-adherence (or standard regression adjusting for observed Z) can be biased; identifying the causal effect of forcing adherence requires a longitudinal causal model (e.g., g-formula / marginal structural models) and assumptions that may not hold with unmeasured tactical intent.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: pre-match opponent strength/bench depth -> influences baseline risk and likelihood of following AI. t1 (60-70'): evolving scoreline, pressing intensity, player load -> influences adherence decision X_t1. t2: adherence changes who plays minutes and tactical shape -> alters subsequent fatigue/scoreline (Z_t2). t3 (75-90'): late goals conceded realized; t4 (next 14 days): hamstring injury realized, influenced by accumulated load and substitutions.",
    "conditional_answers": "Answer if (a) all time-varying confounders Z are fully measured at each decision point, (b) there is no unmeasured coach intent/tactical hidden variable affecting both adherence and outcomes, (c) positivity holds (the club sometimes adheres and sometimes does not at every relevant Z history), and (d) the effect of forcing adherence is well-defined as a specific substitution protocol: then the causal effect of do(X)=1 could in principle be identified using marginal structural models or the g-formula. If any of these fail—especially unmeasured tactical urgency or hidden injury information—then the direction and magnitude of the effect remain uncertain.",
    "label": "Ambiguous",
    "correct_reasoning": "The claim is a Level-2 (interventional) statement about the effect of forcing adherence to the AI substitution rule, i.e., comparing Y under do(X)=1 versus do(X)=0. However, the observed association between adherence and outcomes is generated in a longitudinal setting with time-varying confounding: match context and player state Z_t both influence the coach's adherence decision and directly affect late goals and injury risk. Crucially, Z_t is not purely pre-treatment: earlier adherence decisions (earlier substitutions) change subsequent fatigue distribution, tactical shape, and even scoreline dynamics, which then feed back into later adherence decisions and into Y. This treatment–confounder feedback means that (i) a naive comparison of adherent vs non-adherent matches is not an unbiased estimate of the do-effect (unblocked backdoor paths through Z histories), and (ii) even 'adjusting for Z' with standard regression can induce bias because parts of Z are mediators of earlier X while also confounding later X. Therefore, without a fully specified longitudinal causal model and strong identification assumptions (sequential exchangeability/no unmeasured time-varying confounders, positivity, and a well-defined intervention), the data described do not suffice to conclude that forcing adherence will causally reduce late goals or injuries. The correct conclusion is that the causal effect is not identified from the stated evaluation design, so the claim remains ambiguous."
  },
  {
    "id": "T3-BucketD-073",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "An NBA team pilots a new pre-game “high-intensity warmup” routine for two weeks. Coaches later report that players who did the routine had higher in-game shooting percentages than players who did not. The staff concludes the routine causally improves shooting and decides to mandate it for everyone.",
    "claim": "Mandating the high-intensity warmup routine (X) will increase players' in-game shooting percentage (Y).",
    "variables": {
      "X": "High-intensity warmup routine implemented before the game (mandated vs not used)",
      "Y": "In-game shooting percentage for that game",
      "Z": "Player health/fatigue status and minor injury management that influences both whether the routine is used and shooting performance"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Easy",
      "subdomain": "Sports",
      "causal_structure": "Z (fatigue/health) affects X (coaches skip/modify routine for tired or banged-up players) and also affects Y (shooting%). Z also evolves over time and is influenced by prior games/prior performance, which in turn affects future assignment to X.",
      "key_insight": "Warmup assignment is reactive to changing player condition; the observed association mixes the effect of the warmup with the effect of being healthy/rested.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: Prior game load/performance influences t1 fatigue/health Z; t1 Z influences whether X is assigned pre-game; t2 shooting% Y is realized; t2 outcomes feed back into subsequent t3 load decisions that further change Z.",
    "conditional_answers": "If the routine were randomly assigned (or assigned by a rule independent of fatigue/health) and compliance were measured, then estimating the causal effect of X on Y would be more credible; under the current reactive assignment, the association is not causal.",
    "label": "No",
    "correct_reasoning": "The claim is flawed because the comparison is not an interventionally valid estimate of the effect of X on Y. Assignment to the warmup (X) is confounded by player condition Z: coaches are more likely to allow the routine when a player is feeling good and to skip/scale it down when a player is fatigued or managing a minor injury. Z causally affects Y (healthy/rested players shoot better), so there is an open backdoor path X \u001f Z \u001f Y. Moreover, Z is time-varying: prior game load and prior performance affect current Z, which then affects current X and Y, and later outcomes can influence future load decisions that further shift Z. Therefore, the observed higher shooting% among those who did the routine can be explained by differences in Z rather than by the warmup itself. Without blocking the backdoor (e.g., via randomization or an appropriate time-varying adjustment strategy), we cannot conclude that mandating X would increase Y."
  },
  {
    "id": "T3-BucketD-079",
    "pearl_level": "L1",
    "domain": "Sports",
    "scenario": "A baseball blog notices that starting pitchers who are pulled from the game early (fewer than 80 pitches) lose more often than pitchers who stay in for 100+ pitches. The blog advises managers to 'show faith' and leave starters in longer to improve win rates.",
    "claim": "Leaving a starting pitcher in for 100+ pitches causes the team to win more often.",
    "variables": {
      "X": "Pitcher duration (staying in for >100 pitches)",
      "Y": "Winning the game",
      "Z": "Pitcher performance/effectiveness on the day (giving up runs/hits)"
    },
    "annotations": {
      "trap_type": "Reverse Causation",
      "trap_subtype": "Outcome-driven Selection",
      "difficulty": "Easy",
      "subdomain": "Sports",
      "causal_structure": "Z (giving up runs) causes the manager to remove the pitcher (low X) and causes the team to lose (low Y). Conversely, if Z is good (no runs allowed), the manager leaves the pitcher in (high X) and the team wins (high Y).",
      "key_insight": "Pitch count is a survivor metric; pitchers only accrue high pitch counts if they are pitching well enough to not be pulled. The causation flows from Performance -> Duration, not Duration -> Performance.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z (performance) is realized innings 1-5. If Z is bad, X is truncated at t5. If Z is good, X extends to t9.",
    "conditional_answers": "No. Forcing a struggling pitcher to stay in (intervening on X) would likely increase runs allowed, not decrease them.",
    "label": "No",
    "correct_reasoning": "The claim gets the causal arrow backwards. High pitch counts (X) do not cause wins; rather, pitching well (Z) causes both the manager to allow a high pitch count (X) and the team to win (Y). This is a classic case of reverse causation via performance-based selection (survivorship bias)."
  },
  {
    "id": "T3-BucketD-075",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A professional soccer club evaluates a new high-intensity interval training (HIIT) conditioning program introduced mid-season. The performance analyst compares players who 'fully adopted' the HIIT plan (completed at least 90% of prescribed sessions) versus players who did not, and finds the adopters improved their match running distance and had fewer soft-tissue injuries over the next 8 weeks. The analyst concludes the HIIT program causally improved fitness and reduced injuries, and recommends mandating it for the whole squad.",
    "claim": "Mandating the HIIT program (X) will cause higher match running distance and fewer soft-tissue injuries (Y) because players who complied with HIIT performed better and got injured less.",
    "variables": {
      "X": "Mandated HIIT conditioning program (intervention assignment)",
      "Y": "Subsequent performance and health: match running distance and soft-tissue injury incidence over the next 8 weeks",
      "Z": "Compliance/availability status driven by latent factors (e.g., baseline fitness, existing niggles, motivation, and coach/medical restrictions) that both affect ability to complete HIIT and affect future performance/injury risk"
    },
    "annotations": {
      "trap_type": "Collider",
      "trap_subtype": "Conditioning on Compliance",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "X influences compliance C; Z (baseline fitness/latent injury risk/motivation/medical restrictions) also influences C; Z also directly influences Y. Comparing outcomes within the compliant group conditions on collider C, inducing spurious association between X and Z and biasing the estimated effect of X on Y.",
      "key_insight": "Compliance is post-intervention and is jointly caused by treatment assignment and player health/fitness constraints; conditioning on it opens a non-causal path that makes the program look better than it would under a mandate.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: Club introduces/assigns HIIT (X). t1: Players comply or not (C) based on Z and X. t2: Over weeks 1-8, performance and injuries are realized (Y), also affected by Z.",
    "conditional_answers": "Answer is 'No' if the analysis conditions on compliance (e.g., only includes players who completed ≥90% sessions) or otherwise uses a per-protocol comparison without valid adjustment/IV methods; the effect of a mandate should be estimated by intention-to-treat or with a valid causal strategy that handles noncompliance.",
    "label": "No",
    "correct_reasoning": "The claim is flawed because it infers the causal effect of an intervention (mandating HIIT, X) from an analysis that conditions on compliance, which is a post-intervention variable. Let C denote 'fully adopted HIIT'. C is caused by X (being assigned/mandated increases the chance of adopting) and also by Z (baseline fitness, existing niggles, motivation, and medical restrictions determine whether a player can safely complete HIIT). Z also causally affects Y (fitter, less-injured, more-motivated players both run more and get injured less). When the analyst restricts to C=1 (or adjusts for C), they condition on a collider on the path X -> C <- Z, which opens a non-causal association between X and Z. This induces bias: within the compliant group, assignment/mandate status becomes statistically related to Z, and since Z affects Y, the comparison of Y across X is confounded even if X were otherwise randomized. Therefore, the observed advantage among compliers cannot be interpreted as the causal effect of mandating HIIT on performance/injuries. A valid L2 estimand would require intention-to-treat (effect of assignment/mandate regardless of compliance) or a design that addresses noncompliance (e.g., a valid instrument with exclusion and monotonicity), rather than conditioning on C."
  },
  {
    "id": "T3-BucketD-076",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A soccer club is deciding whether to mandate a new post-match recovery protocol. Historically, players who used the recovery protocol had fewer soft-tissue injuries later in the season, but the medical staff notes that they typically assign the protocol more strictly to players who had heavy minutes in the prior match. The club runs a pilot: for a month, the head coach mandates the recovery protocol for all players who played at least 30 minutes, regardless of perceived fatigue, and compares subsequent 14-day soft-tissue injury incidence to what would have happened under usual discretionary assignment.",
    "claim": "Mandating the recovery protocol for all players with ≥30 minutes will reduce 14-day soft-tissue injury incidence compared with the usual discretionary assignment, because the historical association was partly confounded by workload and the pilot blocks that backdoor path.",
    "variables": {
      "X": "Intervention: Mandated post-match recovery protocol (ice bath + compression + guided mobility) for all players who played ≥30 minutes",
      "Y": "Outcome: Soft-tissue injury incidence within the next 14 days (e.g., hamstring/groin strain)",
      "Z": "Confounder: Match workload/fatigue (minutes played, high-speed running distance) that influences both assignment to recovery and injury risk"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Unblocked Backdoor",
      "difficulty": "Easy",
      "subdomain": "Sports",
      "causal_structure": "Z -> X and Z -> Y; X -> Y. In observational data, Z opens a backdoor path X <- Z -> Y; the mandate sets X exogenously for the eligibility group, blocking the backdoor influence of Z on X.",
      "key_insight": "The observational correlation between recovery use and injuries is biased because workload drives both recovery assignment and injury risk; a mandate (do(X)) removes the Z -> X link, enabling a causal comparison for the targeted group.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z at t0 (match workload) affects injury risk Y at t1 (next 14 days) and, under usual practice, affects recovery assignment X at t0+ (immediately post-match). The mandate replaces the usual Z->X decision rule during the pilot window.",
    "conditional_answers": "Answer is Yes if the mandate is enforced (no discretionary exceptions) and injury recording is comparable pre/post; if compliance is partial or only some players are analyzed post-mandate, the conclusion would require additional assumptions about selection/compliance.",
    "label": "Yes",
    "correct_reasoning": "Under usual practice, workload Z is a common cause of both receiving recovery X and subsequent injury Y, so the observed association between X and Y is confounded through the open backdoor path X <- Z -> Y. The policy question is interventional: compare Y under do(X=mandated) versus Y under the status quo assignment mechanism. In the pilot, X is assigned by a rule based on minutes-threshold eligibility rather than discretionary medical judgment tied to Z, which severs (or substantially weakens) the causal link Z -> X within the eligible group. With the backdoor path blocked by design, differences in Y between mandated and usual assignment can be attributed to X (up to standard implementation assumptions like consistent outcome measurement and stable environment). Therefore the claim that mandating recovery reduces 14-day soft-tissue injuries is a valid causal conclusion in this setup."
  },
  {
    "id": "T3-BucketD-077",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A soccer club evaluates a new high-intensity pressing program introduced mid-season. Coaches compare players who 'fully adopted' the program (measured by meeting GPS running-distance and high-speed-sprint targets in training) to those who did not. They find that full adopters have fewer soft-tissue injuries over the next 8 weeks and conclude the program prevents injuries. The analysis is restricted to players who met the targets (compliers) and excludes players who were modified or held out by medical staff during the rollout.",
    "claim": "Implementing the high-intensity pressing program (X) causally reduces soft-tissue injury risk (Y) because, among players who complied with the program, injuries were lower than among non-compliers.",
    "variables": {
      "X": "Intervention: mandate a new high-intensity pressing training program with specific GPS workload targets",
      "Y": "Outcome: soft-tissue injury incidence in the subsequent 8 weeks (e.g., hamstring/groin strains causing missed matches)",
      "Z": "Post-intervention selection/compliance mechanism: being able/allowed to meet the workload targets (compliance), which is influenced by latent injury risk, current soreness, prior load, and medical restrictions"
    },
    "annotations": {
      "trap_type": "Collider",
      "trap_subtype": "Conditioning on Compliance",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "X affects compliance Z (players are asked to hit targets). Latent injury susceptibility and early symptoms also affect Z (medical staff restrict high-risk players; sore players self-limit). Those same latent factors also affect Y (future injuries). Conditioning on Z (analyzing only compliers) opens a non-causal path between X and Y via the common effects structure, biasing the estimated effect of X on Y.",
      "key_insight": "Compliance is post-treatment and partly determined by the same factors that predict injury; restricting to compliers creates collider bias and can make an ineffective (or harmful) program look protective.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "t0: Program X is introduced and targets are set. t0→t1: Players/medical staff decide who can meet targets (Z) based on soreness, prior workload, and perceived fragility. t1→t2: Injuries Y occur during matches/training. The analysis conditions on Z measured after t0.",
    "conditional_answers": "If the club instead estimated an intention-to-treat effect (assigned-to-program regardless of compliance) or used a valid design/instrument that identifies a complier average causal effect without conditioning on post-treatment compliance, the causal claim might be testable; as stated (conditioning on compliance), the conclusion is not justified.",
    "label": "No",
    "correct_reasoning": "The claim is flawed because it infers an interventional effect of X on Y using a comparison that conditions on Z, where Z is compliance measured after the intervention is introduced. In the causal graph, X → Z and U → Z and U → Y, where U denotes latent injury risk/early symptoms/prior load that both (i) reduce the ability/permission to comply and (ii) increase subsequent injury incidence. By restricting the analysis to Z=1 (compliers), we condition on a collider (Z) that is caused by both X and U. Conditioning on this post-treatment collider opens a spurious association between X and U within the selected set, creating an unblocked backdoor path X → Z ← U → Y in the conditioned data. Therefore, even if X has no protective effect (or is harmful), the selected group of compliers can appear safer because high-risk players are disproportionately filtered out of Z=1 by medical restrictions or self-limiting behavior. The observed lower injury rate among compliers is thus not an unbiased estimate of P(Y | do(X)) and cannot support the causal conclusion that implementing the program reduces injuries."
  },
  {
    "id": "T3-BucketD-078",
    "pearl_level": "L3",
    "domain": "Sports",
    "scenario": "A 'Best of 5' tennis match is in the first set. At 4:00 PM, Player A sprains his ankle. The match is abandoned immediately. At 4:15 PM (15 minutes later), a massive thunderstorm floods the court, which would have forced the cancellation of play for the rest of the day regardless of the score.",
    "claim": "If Player A had not sprained his ankle, the match would have been completed that day.",
    "variables": {
      "X": "Player A's Ankle Sprain (4:00 PM)",
      "Y": "Match Outcome (Completed vs. Abandoned)",
      "Z": "Thunderstorm (4:15 PM)",
      "D": "Minimum Duration to complete a Best of 5 match (Fact: > 15 minutes)"
    },
    "annotations": {
      "trap_type": "Preemption",
      "trap_subtype": "Early Preemption",
      "difficulty": "Medium",
      "subdomain": "Sports",
      "causal_structure": "X (Sprain) causes Y=Abandoned at t=0. Z (Storm) causes Y=Abandoned at t=15. Because the minimum time to complete the match (D) is greater than the time until Z, the match cannot be completed in the counterfactual world where X is removed.",
      "key_insight": "The claim fails because the 'Backup Cause' (Z) arrives sooner than the 'Success Condition' (Match Completion). Removing the injury allows the match to continue, but only for 15 minutes.",
      "author": "Ray Du"
    },
    "label": "No",
    "correct_reasoning": "The claim is false. We are evaluating the counterfactual scenario where the sprain (X) does not occur. While this removes the immediate cause of abandonment at 4:00 PM, we must look at the timeline. The match was in the first set of a Best-of-5 series, meaning it required at least 4560 more minutes to reach a natural conclusion (D). However, the storm (Z) occurred only 15 minutes later. In the counterfactual world, the players continue playing until 4:15 PM, at which point the storm stops the match. Thus, the outcome remains 'Match Abandoned,' just for a different reason."
  },
  {
    "id": "T3-BucketD-079",
    "pearl_level": "L1",
    "domain": "Sports",
    "scenario": "A soccer analytics blog analyzes 5 seasons of match logs from a top European league. They find that teams that make a substitution before the 60th minute have a higher probability of winning than teams that wait longer. The blog suggests the pattern reveals a coaching edge: early subs 'create momentum' and directly increase win probability.",
    "claim": "Making a substitution before the 60th minute increases the chance of winning the match.",
    "variables": {
      "X": "Early substitution indicator (at least one substitution made before minute 60)",
      "Y": "Match outcome (win vs not win)",
      "Z": "Match state and team context at the time the substitution becomes possible (e.g., current scoreline, red cards, injury shocks, pre-match team strength, opponent strength)"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Omitted Variable",
      "difficulty": "Easy",
      "subdomain": "Sports",
      "causal_structure": "Z influences both X (coaches substitute earlier when match state/context demands it or enables it) and Y (the same match state/context also predicts final result); X and Y therefore exhibit an association even though the pathway may not be causal.",
      "key_insight": "At Pearl L1 we may assert an association statement if it is purely observational; the 'trap' is mistaking a confounded association for a causal effect. The correct label can be Yes because the claim is explicitly associative, not interventional.",
      "author": "Ray Du"
    },
    "label": "No",
    "correct_reasoning": "The Momentum effect is an artifact of Confounding. The blog observes that early substitutions (X) correlate with wins (Y) but ignores the common cause: the Match State (Z). When we control for the scoreline and team strength (Z) rather than the action (X), the perceived advantage might disappear. The substitution is a luxury afforded by a winning position, not the driver of it."
  },
  {
    "id": "T3-BucketD-080",
    "pearl_level": "L2",
    "domain": "Sports",
    "scenario": "A soccer club deploys an AI-driven training-load policy: if a player’s daily fatigue score exceeds a threshold, the staff automatically reduces that player’s next-day minutes in training and may rest them on matchday. Midseason, analysts compare players who triggered the policy (minutes reduced/rested) versus those who did not, and find that the triggered group has a higher subsequent soft-tissue injury rate over the next 4 weeks. The performance director asks whether enforcing the AI rest policy is causing more injuries and should be discontinued.",
    "claim": "Implementing the AI rest policy (reducing training/match minutes when fatigue is high) increases soft-tissue injury risk in the following month.",
    "variables": {
      "X": "AI-triggered load reduction/rest decision (e.g., reduced next-day training minutes or match rest)",
      "Y": "Soft-tissue injury incidence within the next 4 weeks",
      "Z": "Latent injury susceptibility and evolving fatigue/health state that both raises the fatigue score and affects injury risk; also influences coaches’ rest decisions"
    },
    "annotations": {
      "trap_type": "Confounding",
      "trap_subtype": "Time-varying Confounding",
      "difficulty": "Hard",
      "subdomain": "Sports",
      "causal_structure": "Z(t) (time-varying fatigue/incipient injury) affects X(t) (rest/load reduction) and also affects future Y(t+1) (injury). Additionally, past micro-injuries and prior load affect current Z(t), and past X(t-1) changes current Z(t) by altering recovery, creating treatment-confounder feedback over time.",
      "key_insight": "Because fatigue/incipient injury both drives the intervention and is itself influenced by prior interventions, naive comparisons (or standard regression adjusting for contemporaneous fatigue) can yield misleading signs; identifying the causal effect requires a longitudinal causal model (e.g., g-methods) and clear intervention definition.",
      "author": "Ray Du"
    },
    "hidden_timestamp": "Z at t0 (accumulated fatigue / micro-damage) increases probability of X at t0 (rest). Z at t0 also increases probability of Y during t1..t4 (injury). Meanwhile, X at t0 changes Z at t1 (recovery), and Z at t1 influences X at t1, continuing the loop.",
    "conditional_answers": "Ambiguous: If the fatigue score fully captures Z and the policy is applied deterministically with no unmeasured time-varying confounding, then g-computation/IPW could show the policy is protective (claim would be No). If substantial unmeasured incipient injury remains in Z (not captured by the score) or the policy changes exposure patterns (e.g., rested players return with acute:chronic spikes), the observed association could reflect either harm or benefit depending on the true dynamics.",
    "label": "Ambiguous",
    "correct_reasoning": "We are asked an interventional question: what would Y be under do(X=rest) versus do(X=no rest) for the same players over time. The observed comparison is not a valid estimate of this causal effect because X is assigned in response to a time-varying health state Z that also predicts Y (an unblocked backdoor path X <- Z -> Y at each decision point). Moreover, Z is affected by earlier rest decisions (X affects recovery and thus future Z), so Z is simultaneously a confounder for later X and a mediator of earlier X, creating time-varying confounding with treatment-confounder feedback. In such settings, (i) unadjusted comparisons are biased by confounding by indication (players rested are precisely those already at higher baseline risk), and (ii) standard adjustment for contemporaneous fatigue can introduce additional bias by blocking part of the causal pathway from earlier X to later Y while still leaving residual confounding if Z is imperfectly measured. Therefore, the sign of the observed association (higher injuries among those rested) does not identify whether the policy truly increases injuries; it could be harmful (e.g., deconditioning and return-to-play spikes) or beneficial but overwhelmed by higher underlying risk in the treated group. Without a specified longitudinal causal model, measurement quality for Z, and an identification strategy (e.g., marginal structural models with stabilized weights, sequential randomization assumptions, or a randomized rollout), the causal claim cannot be validated or rejected, hence Ambiguous."
  }
]